#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_OrgaMech

#include "Basic.hpp"

#include "ABP_OrgaMech_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_OrgaMech.ABP_OrgaMech_C
// 0x0710 (0x1C50 - 0x1540)
class UABP_OrgaMech_C final : public UFWAIMechAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_OrgaMech::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                 // 0x1548(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1560(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1568(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1570(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x1590(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x15D8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1658(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1680(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x16A8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1718(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1788(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x17D0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x17F0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1860(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1880(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1948(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x19C8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x19F0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1A38(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1A60(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1AA8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1AF0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1B38(0x0048)()
	bool                                          Turning;                                           // 0x1B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B81[0x7];                                     // 0x1B81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DesiredRelYaw;                                     // 0x1B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_OrgaFootstep_SC;                                // 0x1B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Orga_CurrrentAttack_SC;                         // 0x1B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_OrgaFootStep_SC;                                // 0x1BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x1BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_Melee_SC;                                  // 0x1BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_Melee360_SC;                               // 0x1BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_DashStabMelee_SC;                          // 0x1BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_Melee180_SC;                               // 0x1BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_DashMelee_SC;                              // 0x1BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x1BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_MeleeSmash_SC;                             // 0x1BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Orga_StompMelee_SC;                             // 0x1BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Arrgo_Charge_SC;                                // 0x1BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Meatman_Multipunch_SC;                          // 0x1BF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Meatman_Melee_Stomp;                            // 0x1C20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_AN_Meatman_Melee_Stomp();
	void AnimNotify_AN_MeatMan_MultiPunch();
	void AnimNotify_AN_Orga_Charge_FS();
	void AnimNotify_AN_Orga_DashMelee();
	void AnimNotify_AN_Orga_DashStabMelee();
	void AnimNotify_AN_Orga_FS();
	void AnimNotify_AN_Orga_FS_Quiet();
	void AnimNotify_AN_Orga_Melee();
	void AnimNotify_AN_Orga_Melee_180();
	void AnimNotify_AN_Orga_Melee_360();
	void AnimNotify_AN_Orga_MeleeStomp();
	void AnimNotify_AN_Orga_SmashMelee();
	void AnimNotify_ExitTurn();
	void AnimNotify_InTurn();
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void DashMelee();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OrgaMech_AnimGraphNode_BlendListByBool_6428EBD04FB08F3CBE068AABF1111143();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OrgaMech_AnimGraphNode_TransitionResult_08F045CC4FA7B87BE545AEAFC1FF8336();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OrgaMech_AnimGraphNode_TransitionResult_0C0212A14E05D8782A5013990268B8F7();
	void ExecuteUbergraph_ABP_OrgaMech(int32 EntryPoint);
	void OnLoaded_B9C7CA104F2FE1CF3B0BCCB1B7166E0D(class UObject* Loaded);
	void OnLoaded_F42E87A8403CEDB806281DB1C7D76B8A(class UObject* Loaded);
	void Play_Foot_Step_SFX(float VolumeMultiplier);
	void Play_Melee_SFX(class USoundBase* Sound);
	void Reset_Charge();
	void Setting_SFX();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_OrgaMech_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_OrgaMech_C")
	}
	static class UABP_OrgaMech_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_OrgaMech_C>();
	}
};

}

