#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AI_Europa_Base_V3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.ADS
// 0x0028 (0x0028 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_ADS final
{
public:
	struct FPoseLink                              InPose_ADS;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          IsADSActive;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is3PAimActive;                                     // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              ADS_0;                                             // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.Aiming
// 0x0038 (0x0038 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_Aiming final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Aim_Yaw_0;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Aim_Pitch_0;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquippingWeapon_0;                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Aiming_0;                                          // 0x0028(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.AimingLocomotion
// 0x0030 (0x0030 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_AimingLocomotion final
{
public:
	struct FPoseLink                              AimLocoPose;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Yaw_0;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pitch_0;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              AimingLocomotion_0;                                // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.Crouch
// 0x0010 (0x0010 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_Crouch final
{
public:
	struct FPoseLink                              Crouch_0;                                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.ExecuteUbergraph_ABP_AI_Europa_Base_V3
// 0x0058 (0x0058 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_ExecuteUbergraph_ABP_AI_Europa_Base_V3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AI_CharacterBase_C*                 K2Node_DynamicCast_AsBP_AI_Character_Base;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFWAIController*                        K2Node_DynamicCast_AsFWAIController;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLeader_ReturnValue;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.Locomotion
// 0x0010 (0x0010 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_Locomotion final
{
public:
	struct FPoseLink                              Locomotion_0;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.OnBecomeRelevant
// 0x0050 (0x0050 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_OnBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAnimNodeReferenceConversionResult            CallFunc_ConvertToSequencePlayer_Result;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayer_ReturnValue;      // 0x0028(0x0010)(NoDestructor)
	float                                         CallFunc_RandomFloatFromStream_ReturnValue;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetStartPosition_ReturnValue;             // 0x0040(0x0010)(NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.OnInitialUpdate
// 0x0020 (0x0020 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_OnInitialUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.RecoilADS
// 0x0020 (0x0020 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_RecoilADS final
{
public:
	struct FPoseLink                              RecoilPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RecoilADS_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Base_V3.ABP_AI_Europa_Base_V3_C.RecoilHipFire
// 0x0020 (0x0020 - 0x0000)
struct ABP_AI_Europa_Base_V3_C_RecoilHipFire final
{
public:
	struct FPoseLink                              RecoilPoseHipFire;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RecoilHipFire_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

