#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AI_Europa_Main_V3

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.ADS
// 0x0028 (0x0028 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_ADS final
{
public:
	struct FPoseLink                              InPose_ADS;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          IsADSActive;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is3PAimActive;                                     // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              ADS_0;                                             // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.Aiming
// 0x0038 (0x0038 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_Aiming final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Aim_Yaw;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Aim_Pitch;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquippingWeapon;                                 // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Aiming_0;                                          // 0x0028(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.AimingLocomotion
// 0x0030 (0x0030 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_AimingLocomotion final
{
public:
	struct FPoseLink                              AimLocoPose;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Yaw;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pitch;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              AimingLocomotion_0;                                // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.Crouch
// 0x0010 (0x0010 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_Crouch final
{
public:
	struct FPoseLink                              Crouch_0;                                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.ExecuteUbergraph_ABP_AI_Europa_Main_V3
// 0x0004 (0x0004 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_ExecuteUbergraph_ABP_AI_Europa_Main_V3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.Locomotion
// 0x0010 (0x0010 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_Locomotion final
{
public:
	struct FPoseLink                              Locomotion_0;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.RecoilADS
// 0x0020 (0x0020 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_RecoilADS final
{
public:
	struct FPoseLink                              RecoilPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RecoilADS_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ABP_AI_Europa_Main_V3.ABP_AI_Europa_Main_V3_C.RecoilHipFire
// 0x0020 (0x0020 - 0x0000)
struct ABP_AI_Europa_Main_V3_C_RecoilHipFire final
{
public:
	struct FPoseLink                              RecoilPoseHipFire;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RecoilHipFire_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

