#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AI_Brawler_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HitReactionProceduralSystem_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AI_Brawler_Main.ABP_AI_Brawler_Main_C
// 0x0990 (0x16F0 - 0x0D60)
class UABP_AI_Brawler_Main_C final : public USBotCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0D68(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0D70(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0D78(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0D80(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0DA0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0E58(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0E78(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0E98(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0F50(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0F70(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0F90(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1048(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1068(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1120(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1140(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x11F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1218(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x12D0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x12F0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1310(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1358(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1420(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x14A0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x14C8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1590(0x0048)()
	struct FAnimNode_HitReaction                  AnimGraphNode_HitReaction;                         // 0x15D8(0x0088)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1660(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x16A8(0x0048)()

public:
	void ADS(const struct FPoseLink& InPose_ADS, bool IsADSActive, bool Is3PAimActive, struct FPoseLink* ADS_0);
	void Aiming(const struct FPoseLink& InPose, double Aim_Yaw, double Aim_Pitch, bool IsEquippingWeapon, struct FPoseLink* Aiming_0);
	void AimingLocomotion(const struct FPoseLink& AimLocoPose, double Yaw, double pitch, struct FPoseLink* AimingLocomotion_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void Crouch(struct FPoseLink* Crouch_0);
	void Death(const struct FPoseLink& InPose, struct FPoseLink* Death_0);
	void ExecuteUbergraph_ABP_AI_Brawler_Main(int32 EntryPoint);
	void Locomotion(struct FPoseLink* Locomotion_0);
	void PlayStagger();
	void RecoilADS(const struct FPoseLink& RecoilPose, struct FPoseLink* RecoilADS_0);
	void RecoilHipFire(const struct FPoseLink& RecoilPoseHipFire, struct FPoseLink* RecoilHipFire_0);
	void SelectReactionAnimation(ECardinalDirection InDirection);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AI_Brawler_Main_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AI_Brawler_Main_C")
	}
	static class UABP_AI_Brawler_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AI_Brawler_Main_C>();
	}
};

}

