#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_Main

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_Player_Main_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Player_Main.ABP_Player_Main_C
// 0x3390 (0x4090 - 0x0D00)
class UABP_Player_Main_C final : public UFWPlayerAnimInstance
{
public:
	uint8                                         Pad_CF8[0x8];                                      // 0x0CF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Player_Main::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x0D08(0x0007)(HasGetValueTypeHash)
	uint8                                         Pad_D0F[0x1];                                      // 0x0D0F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0D10(0x0008)()
	struct FAnimSubsystem_SharedLinkedAnimLayers  AnimBlueprintExtension_SharedLinkedAnimLayers;     // 0x0D18(0x0028)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0D40(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0D48(0x0008)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x0D50(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x0D78(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x0E40(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x0F30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x0F58(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x0F80(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x1000(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x1080(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x1170(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x1198(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x1260(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x12E0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x1300(0x0028)()
	uint8                                         Pad_1328[0x8];                                     // 0x1328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_1;                            // 0x1330(0x01F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x1520(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x15A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x15C8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x1648(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1670(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x16B8(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x17A8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x17F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1810(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x18C8(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1910(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1930(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1950(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1970(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x1990(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x1A58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1A80(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x1AA8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x1B70(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x1BB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1BE0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x1C28(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x1C50(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1C98(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x1CE0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x1DD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x1DF8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x1E20(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x1EA0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x1EC8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x1FB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1FE0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2028(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x2050(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x20D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x20F8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2120(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x21A0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x2290(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x22B8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x2380(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x23C8(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x2410(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x24D8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2520(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x2568(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x25B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x25D0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x25F8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x26B0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2730(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2758(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x27D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x27F8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x28B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x28D0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x2988(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x29A8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x29C8(0x00C8)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting;                   // 0x2A90(0x0138)()
	struct FAnimNode_SplineIK                     AnimGraphNode_SplineIK;                            // 0x2BC8(0x0270)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2E38(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x2F60(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2FA8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x2FD0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x3018(0x00F0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3108(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x31C0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x31E0(0x0020)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x3200(0x0440)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x3640(0x01F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x3830(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x3920(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x3968(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x39B0(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3AD8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3AF8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x3B18(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3C08(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3C88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3CB0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x3CD8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x3D20(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x3D68(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3DB0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3DD8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3E20(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3F10(0x0028)()
	bool                                          __CustomProperty_Is3PAimActive_475AEE074CEABFB8F07A79928F6E6B29; // 0x3F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_IsADSActive_475AEE074CEABFB8F07A79928F6E6B29; // 0x3F39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F3A[0x6];                                     // 0x3F3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Pitch_AFC97390488BB765E1AE51866C88A4CF; // 0x3F40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Yaw_AFC97390488BB765E1AE51866C88A4CF; // 0x3F48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_IsEquippingWeapon_3E5648E44AD41C70D909ACA8EA6B5A91; // 0x3F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F51[0x7];                                     // 0x3F51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_Pitch_3E5648E44AD41C70D909ACA8EA6B5A91; // 0x3F58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Aim_Yaw_3E5648E44AD41C70D909ACA8EA6B5A91; // 0x3F60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_PropertyAccess;                             // 0x3F68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponEquip;                                       // 0x3F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponReload;                                      // 0x3F71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponADS;                                         // 0x3F72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponFire;                                        // 0x3F73(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSprinting;                                      // 0x3F74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F75[0x3];                                     // 0x3F75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Twist_End;                                         // 0x3F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F7C[0x4];                                     // 0x3F7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Control_Points_1;                                  // 0x3F80(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IkLeftHand;                                        // 0x3FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FE8[0x8];                                     // 0x3FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Effector_Transform;                                // 0x3FF0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double Ik_Left_Hand)> LeftHandleOnFired;                           // 0x4050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(double Ik_Left_Hand)> LeftHandleOffFired;                          // 0x4060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_PlayerBase_C*                       Pawn;                                              // 0x4070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        IkStartTime;                                       // 0x4078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FireAbilityOn;                                     // 0x4080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReloadAbilityOn;                                   // 0x4081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponEquipAbilityOn;                              // 0x4082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnyWeaponAbilityOn;                                // 0x4083(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ADS(const struct FPoseLink& InPose_ADS, bool IsADSActive, bool Is3PAimActive, struct FPoseLink* ADS_0);
	void Aiming(const struct FPoseLink& InPose, double Aim_Yaw, double Aim_Pitch, bool IsEquippingWeapon, struct FPoseLink* Aiming_0);
	void AimingLocomotion(const struct FPoseLink& AimLocoPose, double Yaw, double pitch, struct FPoseLink* AimingLocomotion_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_ConsumeFX();
	void AnimNotify_HideConsume();
	void AnimNotify_LeftIkHandleOff();
	void AnimNotify_LeftIkHandleOn();
	void AnimNotify_LockMovement();
	void AnimNotify_ShowCig();
	void AnimNotify_ShowConsume();
	void AnimNotify_UnlockMovement();
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void Crouch(struct FPoseLink* Crouch_0);
	void ExecuteUbergraph_ABP_Player_Main(int32 EntryPoint);
	void FaceAnimation(struct FPoseLink* FaceAnimation_0);
	void Lean_Detect();
	void Locomotion(struct FPoseLink* Locomotion_0);
	void RecoilADS(const struct FPoseLink& RecoilPose, struct FPoseLink* RecoilADS_0);
	void RecoilHipFire(const struct FPoseLink& RecoilPoseHipFire, struct FPoseLink* RecoilHipFire_0);
	void Weapon_State_Detect();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Player_Main_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Player_Main_C")
	}
	static class UABP_Player_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Player_Main_C>();
	}
};

}

