#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_AudioGameplay_AmbienceTrigger

#include "Basic.hpp"

#include "E_Reverb_structs.hpp"
#include "Engine_structs.hpp"
#include "E_FilterAndAtt_AudioVolume_structs.hpp"
#include "E_Filter_structs.hpp"
#include "E_AmbientArea_structs.hpp"
#include "AudioGameplayVolume_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_AudioGameplay_AmbienceTrigger.AC_AudioGameplay_AmbienceTrigger_C
// 0x0058 (0x0108 - 0x00B0)
class UAC_AudioGameplay_AmbienceTrigger_C : public UAudioGameplayVolumeComponentBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FadeDuration;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AmbientArea                                 Ambient_Area_Enter;                                // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AmbientArea                                 Ambient_Area_Exit;                                 // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Reverb                                      Reverb_Enter;                                      // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Reverb                                      Reverb_Exit;                                       // 0x00C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FilterAndAtt_AudioVolume                    Occ_Settings_Enter;                                // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FilterAndAtt_AudioVolume                    Occ_Settings_Exit;                                 // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         SFX_To_Activate;                                   // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         SFX_To_Deactivate;                                 // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	E_Filter                                      MSS_Filter_Enter;                                  // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Filter                                      MSS_Filter_Exit;                                   // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Debug___Volume_Text;                               // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Debug_;                                            // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AmbienceEnter();
	void AmbienceExit();
	void Emitters_To_Activate_();
	void Emitters_To_Deactivate();
	void ExecuteUbergraph_AC_AudioGameplay_AmbienceTrigger(int32 EntryPoint);
	void LoadEmiiter(double FadeDuration_0);
	void OnListenerEnter();
	void OnListenerExit();
	void StopEmitter(double FadeDuration_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_AudioGameplay_AmbienceTrigger_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_AudioGameplay_AmbienceTrigger_C")
	}
	static class UAC_AudioGameplay_AmbienceTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_AudioGameplay_AmbienceTrigger_C>();
	}
};

}

