#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_AI_AwarenessMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWAICore_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_AI_AwarenessMarker.AC_AI_AwarenessMarker_C
// 0x0140 (0x07E0 - 0x06A0)
class UAC_AI_AwarenessMarker_C final : public UFWAwarenessWidgetComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EFWAIAwarenessState                           Current_Awareness_State;                           // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFWAIAwarenessState                           Previous_Awareness_State;                          // 0x06A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AA[0x6];                                      // 0x06AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LOStoLocalPlayerTimer;                             // 0x06B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ImDead;                                            // 0x06B8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinVisDist;                                        // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxVisDist;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetIsLocalPlayer;                               // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_AwarenessMarker_C*                  My_Awareness_Widget;                               // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_to_Local_Player;                          // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor_Override;                                    // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Actor_Override_;                               // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Agro_Override_Used_;                               // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         V2_Global_Collect_Vars_Attempts;                   // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 V2_My_Owner;                                       // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         V2_Server_Collect_Vars_Attempts_0;                 // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           V2_SERVER_Awareness_Value_Timer;                   // 0x0708(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        V2_Prev_Awareness;                                 // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class AFWGamePlayerCharacter*, double>   V2_SERVER_Player_to_Awareness;                     // 0x0718(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AFWGamePlayerCharacter*, double>   V2_CLIENTS_Player_to_Awareness;                    // 0x0768(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 V2_Current_Target;                                 // 0x07B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EFWAIAwarenessState                           V2_Current_Awareness_State;                        // 0x07C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Current_Target_is_a_Player_;                       // 0x07C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          V2_Enemy_Targeting_Local_Player;                   // 0x07C2(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C3[0x5];                                      // 0x07C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           V2_Post_Agro_Timer;                                // 0x07C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          V2_in_agro_window;                                 // 0x07D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          V2_Local_Player_is_my_current_target;              // 0x07D1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D2[0x6];                                      // 0x07D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastUpdateAwareness;                               // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void V2_Track_post_Agro();
	void OnRep_V2_Enemy_Targeting_Local_Player();
	void V2_Awareness_State_Changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, EFWAIAwarenessState NewAwarenessState, EFWAIAwarenessState PreviousAwarenessState);
	void OnRep_ImDead();
	void V2_Dead_Shut_Down();
	void V2_Took_Damage(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void V2_SERVER_Get_Current_Awareness_Target(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void V2_SERVER_Get_Current_Awareness_Value();
	void V2_Get_Awareness_Component(class UFWAIAwarenessComponent_NPC** Awareness_Component);
	void V2_Get_Health_Component(class UFWHealthComponent** FW_Health_Component);
	void V2_Collect_Variables(bool* Success_);
	void Check_Distance_to_Player(const struct FVector& My_Location);
	void ReceiveBeginPlay();
	void CLIENTS_Awareness_State_Update(EFWAIAwarenessState New_Awareness_State, EFWAIAwarenessState Previous_Awareness_State_0);
	void Override_Awareness_Dist(double New_Min_Dist, double New_Max_Dist);
	void V2_Retry_Collect_Variables();
	void V2_Server_Retry_Collect_Vars();
	void V2_Update_Awareness_Values();
	void V2_CLIENTS_Update_Awareness_Values(class AFWGamePlayerCharacter* The_Player, double Awareness_Value);
	void Just_Distance();
	void Was_Killed(class UFWHealthComponent* HealthComponent, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void Local_Player_Target_Eval();
	void Awareness_Changed(EFWAIAwarenessState New_Awareness_State, EFWAIAwarenessState Previous_Awareness_State_0);
	void SERVER_Awareness_Changed(EFWAIAwarenessState New_Awareness_State, EFWAIAwarenessState Previous_Awareness_State_0);
	void ExecuteUbergraph_AC_AI_AwarenessMarker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_AI_AwarenessMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_AI_AwarenessMarker_C")
	}
	static class UAC_AI_AwarenessMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_AI_AwarenessMarker_C>();
	}
};

}

