#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_EnemyDetect_Marker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_EnemyDetect_Marker.AC_EnemyDetect_Marker_C
// 0x0058 (0x00F8 - 0x00A0)
class UAC_EnemyDetect_Marker_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Focused_Actor;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TargetDistance;                                    // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTracingInteractionArea;                          // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteractionArea_C*                  FocusedInteractionArea;                            // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Length;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Trace_timer;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Interaction_Area;                                  // 0x00D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AC_EnemyDetect_Marker(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Trace();
	void Trace_Timer_Event();
	void TraceInteractionArea(bool Trace);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_EnemyDetect_Marker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_EnemyDetect_Marker_C")
	}
	static class UAC_EnemyDetect_Marker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_EnemyDetect_Marker_C>();
	}
};

}

