#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_SyncAnimationV2

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_SyncAnimationV2.AC_SyncAnimationV2_C
// 0x0068 (0x0108 - 0x00A0)
class UAC_SyncAnimationV2_C final : public UActorComponent
{
public:
	struct FGameplayTagContainer                  OwnedGameplayTags;                                 // 0x00A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           VictimSyncKillMontages;                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           InstigatorSyncKillMontage;                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return_Value_Location;                             // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SyncAnimationPairIndex;                            // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Sync_Point_Location;                               // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetAnimatioonDefintion(class UFWCharacterAnimationDefinition** AnimationDefinition);
	void GetInstigatorSyncAnimSetDirection(class AActor* VictimTarget, class AActor* Instigator, class UAnimMontage** Output);
	void GetVictimSyncKillMontages(const struct FGameplayTagContainer& Selection, class UAnimMontage** Output);
	void StartSync(class AActor* VictimActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_SyncAnimationV2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_SyncAnimationV2_C")
	}
	static class UAC_SyncAnimationV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_SyncAnimationV2_C>();
	}
};

}

