#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AgentAI

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_classes.hpp"
#include "FWAICore_classes.hpp"
#include "FWAI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AgentAI_structs.hpp"


namespace SDK
{

// Class AgentAI.AgentLibrary
// 0x0000 (0x0028 - 0x0028)
class UAgentLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AgentCoverCheck(ECoverFoundResult* Result, const TScriptInterface<class ICoverAware>& Agent, struct FCoverDescription* BestCover, struct FTraversalDescription* TraversalData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgentLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgentLibrary")
	}
	static class UAgentLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgentLibrary>();
	}
};

// Class AgentAI.BTDecorator_IsMeleeAttackable
// 0x0038 (0x00C8 - 0x0090)
class UBTDecorator_IsMeleeAttackable final : public UBTDecorator_BlackboardBase
{
public:
	struct FBox                                   TargetBox;                                         // 0x0090(0x0038)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_IsMeleeAttackable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_IsMeleeAttackable")
	}
	static class UBTDecorator_IsMeleeAttackable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_IsMeleeAttackable>();
	}
};

// Class AgentAI.BTService_ControlCrouch
// 0x0000 (0x0070 - 0x0070)
class UBTService_ControlCrouch final : public UBTService
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTService_ControlCrouch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_ControlCrouch")
	}
	static class UBTService_ControlCrouch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_ControlCrouch>();
	}
};

// Class AgentAI.BTTask_FireWeapon
// 0x0078 (0x0110 - 0x0098)
class UBTTask_FireWeapon final : public UBTTask_BlackboardBase
{
public:
	bool                                          bUseKeyAsTriggerTime;                              // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TriggerTimeKey;                                    // 0x00A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bDelayFireResponse;                                // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 DelayFireTimeKey;                                  // 0x00D0(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         TriggerTime;                                       // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggerTimeRandomDeviation;                        // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyMuzzleCheck;                                  // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bConeCheckTarget : 1;                              // 0x0104(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceSuccessIfConeFails : 1;                      // 0x0104(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConeCheckHalfAngle;                                // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_FireWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_FireWeapon")
	}
	static class UBTTask_FireWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FireWeapon>();
	}
};

// Class AgentAI.FWAgentController
// 0x0018 (0x0468 - 0x0450)
class AFWAgentController : public AFWAIController
{
public:
	uint8                                         Pad_450[0x18];                                     // 0x0450(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPawnConfigUpdated(float Accuracy, float FireRate, float EngagementDistance);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAgentController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAgentController")
	}
	static class AFWAgentController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAgentController>();
	}
};

// Class AgentAI.AgentCharacter
// 0x0000 (0x0000 - 0x0000)
class IAgentCharacter final
{
public:
	void AbortMeleeAttack();
	TScriptInterface<class IAgentWeapon> GetCurrentWeapon();
	void MeleeAttack(class AActor* Target);
	void SetAgentIsAiming(bool bNewValue);
	void SetAgentIsInCover(bool NewIsInCover);

	bool GetAgentHasCoverAvailable() const;
	bool GetAgentIsAiming() const;
	bool GetAgentIsFiring() const;
	bool GetAgentIsInCover() const;
	bool GetIsInMelee() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgentCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgentCharacter")
	}
	static class IAgentCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAgentCharacter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class AgentAI.AgentControllableCharacter
// 0x0000 (0x0000 - 0x0000)
class IAgentControllableCharacter final
{
public:
	TScriptInterface<class IAgentCharacter> GetAgentCharacter();

	const class ACharacter* GetCharacter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgentControllableCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgentControllableCharacter")
	}
	static class IAgentControllableCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAgentControllableCharacter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class AgentAI.AgentWeapon
// 0x0000 (0x0000 - 0x0000)
class IAgentWeapon final
{
public:
	void SetAgentAccuracyMultiplier(float Multiplier);
	void SetAgentFireRateMultiplier(float Multiplier);

	int32 GetCurrentAmmo() const;
	int32 GetMaxAmmo() const;
	int32 GetTotalAmmoAvailable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgentWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgentWeapon")
	}
	static class IAgentWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAgentWeapon>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class AgentAI.AgentWeaponBPL
// 0x0000 (0x0028 - 0x0028)
class UAgentWeaponBPL final : public UBlueprintFunctionLibrary
{
public:
	static TScriptInterface<class IAgentWeapon> FromWeaponActor(class AActor* Actor, EAgentWeaponBPLResult* Result);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgentWeaponBPL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgentWeaponBPL")
	}
	static class UAgentWeaponBPL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgentWeaponBPL>();
	}
};

}

