#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AN_AI_Infantry_FootStepAudio

#include "Basic.hpp"

#include "E_Footstep_AnimType_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AN_AI_Infantry_FootStepAudio.BP_AN_AI_Infantry_FootStepAudio_C
// 0x0018 (0x0050 - 0x0038)
class UBP_AN_AI_Infantry_FootStepAudio_C final : public UAnimNotify
{
public:
	E_Footstep_AnimType                           AnimType;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundConcurrency*                      Reduced_Scon_Setting;                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Get_FS_SFX(class UActorComponent* Mesh, class USoundBase** SB_FootStepSFX) const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AN_AI_Infantry_FootStepAudio_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AN_AI_Infantry_FootStepAudio_C")
	}
	static class UBP_AN_AI_Infantry_FootStepAudio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AN_AI_Infantry_FootStepAudio_C>();
	}
};

}

