#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_ShotGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"
#include "ProjectP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_ShotGun.BP_Action_SlaveArm_ShotGun_C
// 0x0030 (0x0248 - 0x0218)
class UBP_Action_SlaveArm_ShotGun_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_ShotGun_C;       // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Shot;                                              // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shotgun_Normal;                                    // 0x0224(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Shotgun_Fire;                                      // 0x022C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Shotgun_Electric;                                  // 0x0234(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Shotgun_Acid;                                      // 0x023C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CounterEnable;                                     // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WidthIncrease;                                     // 0x0245(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          JustShot;                                          // 0x0246(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_ShotGun(int32 EntryPoint);
	void AmmoChange_Right_Keyboard();
	void AmmoChange_Down_Keyboard();
	void AmmoChange_Left_Keyboard();
	void AmmoChange_Up_Keyboard();
	void AmmoChange_Right_GamePad();
	void AmmoChange_Down_GamePad();
	void AmmoChange_Left_GamePad();
	void AmmoChange_Up_GamePad();
	void AmmoChange_Right();
	void AmmoChange_Left();
	void AmmoChange_Down();
	void AmmoChange_Up();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnStart();
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Action_SlaveArm_ShotGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_SlaveArm_ShotGun_C")
	}
	static class UBP_Action_SlaveArm_ShotGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_ShotGun_C>();
	}
};
DUMPER7_ASSERTS_UBP_Action_SlaveArm_ShotGun_C;

}

