#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_TurretBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWGameCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FWAICore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_TurretBase.BP_AI_TurretBase_C
// 0x00C0 (0x04C8 - 0x0408)
class ABP_AI_TurretBase_C : public AFWRook
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_IncomingDamageMod_C*               BPC_ShotgunImpact;                                 // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_SpecialLootDrop_C*                 BPC_SpecialLootDrop;                               // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_MaterialSwap_C*                    BPC_MaterialSwap;                                  // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterDeath_QuestTracker_C*     BPC_CharacterDeath_QuestTracker;                   // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_AI_AwarenessMarker_C*               AwarenessMarker;                                   // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 FWWeaponUser;                                      // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Center;                                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CompassMarkerComponent_C*           BP_QuestDataComponent;                             // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAIFactionComponent*                  AIFactionComponent;                                // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAIAwarenessComponent_NPC*            AIAwarenessComponent;                              // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAISenseComponent*                    AISenseComponent;                                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Visible_Distance;                                  // 0x0470(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DistanceTimer;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Last_Damage_Location;                              // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFWAIAwarenessState                           Current_Awareness_State;                           // 0x0498(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Currently_enabled_;                                // 0x0499(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x2];                                      // 0x049A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Potshot_TargetActorKey;                            // 0x049C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          Potshot_Controller;                                // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Potshot_Target;                                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Potshot_Primary_Threat;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   Potshot_Blackboard;                                // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Shut_down_all_sensors();
	void Is_actor_stunned_or_dead_(class AActor* Actor, bool* Stunned_or_dead_);
	void Add_myself_to_player_s_active_enemy_array();
	void Potshot_Check(bool* Target_was_cleared_);
	void Hostility_Tracker();
	void Currently_Enabled_Fired();
	void OnRep_Currently_Enabled_();
	void CorpseSettingsPostDeath();
	struct FVector GetAimAtPoint();
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void SERVER_Corpse_Settings();
	void CLIENTS_Corpse_Settings();
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void Awareness_state_changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, EFWAIAwarenessState NewAwarenessState, EFWAIAwarenessState PreviousAwarenessState);
	void Sensor_On_Off();
	void BndEvt__BP_AI_TurretBase_AISenseComponent_K2Node_ComponentBoundEvent_0_FWOnAIStartPlay__DelegateSignature();
	void ReceiveBeginPlay();
	void Awareness_Target_Changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void No_RPC_Corpse_Settings();
	void ExecuteUbergraph_BP_AI_TurretBase(int32 EntryPoint);

	void GetRookEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_TurretBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_TurretBase_C")
	}
	static class ABP_AI_TurretBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_TurretBase_C>();
	}
};

}

