#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_CeilingHitFalling

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_HitBase_classes.hpp"
#include "ProjectP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_CeilingHitFalling.BP_Action_CeilingHitFalling_C
// 0x0020 (0x03B8 - 0x0398)
class UBP_Action_CeilingHitFalling_C final : public UBP_Action_HitBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_CeilingHitFalling_C;      // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Montage_Instance_ID;                               // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Start_Montage_Instance_ID;                         // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hit_Anim;                                          // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CeilingTraceHeight;                                // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_CeilingHitFalling(int32 EntryPoint);
	void OnStart();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnCurrMontageBlendOutStarted(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	bool OnLanded(class ACharacter* LandingChar, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Action_CeilingHitFalling_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_CeilingHitFalling_C")
	}
	static class UBP_Action_CeilingHitFalling_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_CeilingHitFalling_C>();
	}
};
DUMPER7_ASSERTS_UBP_Action_CeilingHitFalling_C;

}

