#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_CharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FWAICore_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_CharacterBase.BP_AI_CharacterBase_C
// 0x0310 (0x11A0 - 0x0E90)
class ABP_AI_CharacterBase_C : public AFWGameAICharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_AI_HitReactManager_C*              BPC_AI_HitReactManager;                            // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_IFFcardDrop_C*                     BPC_IFFcardDrop;                                   // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VO_AudioComp;                                      // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_IncomingDamageMod_C*               BPC_ShotgunImpact;                                 // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_SpecialLootDrop_C*                 BPC_SpecialLootDrop;                               // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_TickPose_C*                        BPC_TickPose;                                      // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_DangerCloseDetect_C*               BPC_DangerCloseDetect;                             // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_NavMeshCheck_C*                    BPC_NavMeshCheck;                                  // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x0ED8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_MaterialSwap_C*                    BPC_MaterialSwap;                                  // 0x0EE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharacterDeath_QuestTracker_C*     BPC_CharacterDeath_QuestTracker;                   // 0x0EE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_Loot_DropLogic_C*                  BPC_Loot_DropLogic;                                // 0x0EF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AC_DropWeaponLogic_C*               BP_AC_DropWeaponLogic;                             // 0x0EF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AC_FootstepSFXs_C*                  BP_AC_FootstepSFXs;                                // 0x0F00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 FWWeaponUser;                                      // 0x0F08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CompassMarkerComponent_C*           BP_QuestDataComponent;                             // 0x0F10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_AI_AwarenessMarker_C*               AwarenessMarker;                                   // 0x0F18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAIAwarenessComponent_NPC*            AIAwarenessComponent;                              // 0x0F20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAISenseComponent*                    AISenseComponent;                                  // 0x0F28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAIFactionComponent*                  AIFactionComponent;                                // 0x0F30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SoftRef_EOD;                                       // 0x0F38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SoftRef_Heavy;                                     // 0x0F60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SoftRef_Euruska_Infantry_Soldier;                  // 0x0F88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 LastProjectile;                                    // 0x0FB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Visible_Distance;                                  // 0x0FB8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FBC[0x4];                                      // 0x0FBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DistanceTimer;                                     // 0x0FC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TakeHeadshotDamage_;                               // 0x0FC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC9[0x7];                                      // 0x0FC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HeadshotDamageMulti;                               // 0x0FD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OwnerDoesNotHaaveStateChangeAnims_;                // 0x0FD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD9[0x7];                                      // 0x0FD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           HeadshotBones;                                     // 0x0FE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseRandomWeapon_;                                  // 0x0FF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LootableCorpse_;                                   // 0x0FF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF2[0x2];                                      // 0x0FF2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CorpseDefaultLifespawn;                            // 0x0FF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Corpse_Loot_Table;                                 // 0x0FF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           MovementTrackingFunction;                          // 0x1008(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          MovementMakesSound_;                               // 0x1010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1011[0x7];                                     // 0x1011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 NEWWEP_Primary_Weapon;                             // 0x1018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         NEWWEP_RandomPrimaryWeapons;                       // 0x1020(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundCue*                              SC_Death_SFX;                                      // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_Pain_SFX;                                       // 0x1038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Loot_Object_Class;                                 // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone_Name;                                         // 0x1048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Ambient_VO_SFX;                                 // 0x1050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_Alert_SFX;                                      // 0x1058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SC_Aggro_SFX;                                      // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayPatrolVO_;                                     // 0x1068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerDetected;                                    // 0x1069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106A[0x6];                                     // 0x106A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AC_PainSFX_SC;                                     // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Patrol_SFX_SC;                                  // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_AlertSFX_SC;                                    // 0x1080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_AggroSFX_SC;                                    // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DeadMarker;                                        // 0x1090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetSelected;                                    // 0x1091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1092[0x6];                                     // 0x1092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Last_Damage_Location;                              // 0x1098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PatrolTimer;                                       // 0x10B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         VO_Rplay;                                          // 0x10B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10BC[0x4];                                     // 0x10BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceToPlayApproaching;                         // 0x10C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShooting_;                                       // 0x10C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C9[0x7];                                     // 0x10C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weapon_Headshot_Multi;                             // 0x10D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundConcurrency*                      Concurrency_Limit;                                 // 0x10D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow_Vision_Socket_Rotation_;                    // 0x10E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E1[0x7];                                     // 0x10E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Follow_Vision_Socket_Rotation_Delta;               // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow_Vision_Socket_Rotation_When_Sus_;           // 0x10F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F1[0x7];                                     // 0x10F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteractionArea_C*                  My_Interaction_Area;                               // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Marker_Spotted_C*                   Marker_Spotted_Object;                             // 0x1100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EFWAIAwarenessState                           New_Awareness_State;                               // 0x1108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1109[0x7];                                     // 0x1109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectImpactSettings                  DefaultImpactEffect;                               // 0x1110(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          Audio_AI_VO_Debug;                                 // 0x1150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1151[0x3];                                     // 0x1151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VisionSocket;                                      // 0x1154(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115C[0x4];                                     // 0x115C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Character_Headshot_Multi;                          // 0x1160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFWAIAwarenessState                           Current_Awareness_State;                           // 0x1168(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1169[0x3];                                     // 0x1169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Potshot_TargetActorKey;                            // 0x116C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1174[0x4];                                     // 0x1174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          Potshot_Controller;                                // 0x1178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Potshot_Target;                                    // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Potshot_Primary_Threat;                            // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   Potshot_Blackboard;                                // 0x1190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Should_Disable_ESP_;                               // 0x1198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Shut_down_all_sensors();
	void Add_myself_to_player_s_active_enemy_array();
	void Potshot_Check(bool* Target_was_cleared_);
	void Confirm_Actor_Valid_Look_Target(class UObject* Actor, bool* Valid_);
	void Hostility_Tracker();
	void AIDamageCheck(double Damage, const class UDamageType* damage_type, class AController* Instigated_By, class AActor* Damage_Causer);
	void Determine_Headshot_Calc();
	void PlayerDetected_SFX();
	void Aggro_SFX();
	void AmbientVO_SFX();
	void Alert_SFX();
	void Create_Interaction_Area();
	void Shotgun_Impact(double Damage_in, class UObject* damage_type, class AController* Instigator_0, class AActor* Damage_Causer, double* Damage_out);
	void Should_do_Headshot_Check_(class AController* Instigated_By, class AActor* Damage_Causer, bool* Calc_Headshot_);
	void Calculate_Weapon_Headshot_Multi(class AActor* Damage_Causer);
	bool ShootingAndDistance_(double A);
	void DistanceToPlayer(double* DistToPlayer, double* TickIntervalOut);
	void Spawn_Patrol_SFX();
	void PlayApproaching_VO();
	void Mantle_Fix();
	void CorpseSettingsPostDeath();
	void PlayDamageSFX();
	void Play_Death_SFX();
	void GarunteeOverlapFix();
	void MovementTracking();
	void HideShowLights(bool Hide_Lights_);
	void isPlayer(class AActor* Actor, bool* Result);
	void On_Selected_AITarget_Changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void UserConstructionScript();
	void AudioSet_Up();
	void Damage_SFX();
	void Killed_SFX(class AActor* Killer);
	void BndEvt__BP_AI_CharacterBase_AIAwarenessComponent_K2Node_ComponentBoundEvent_1_FWAIPlayerDetectedSignature__DelegateSignature(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class APlayerController* PlayerController);
	void ResetTimer_PlayVOApproaching();
	void OnWeaponFire_Event();
	void BndEvt__BP_AI_CharacterBase_AIAwarenessComponent_K2Node_ComponentBoundEvent_0_FWAIPlayerLostSignature__DelegateSignature(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class APlayerController* PlayerController);
	void Reset_ShootingAtPlayer_VO();
	void Multicast_StateChange(EFWAIAwarenessState NewAwarenessState);
	void Server_StateChange(EFWAIAwarenessState NewAwarenessState);
	void CustomEvent(class UFWAIAwarenessComponent_NPC* AwarenessComponent, EFWAIAwarenessState NewAwarenessState, EFWAIAwarenessState PreviousAwarenessState);
	void ShootingVO();
	void ReceiveBeginPlay();
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void Target_Changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void Awareness_Changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, EFWAIAwarenessState NewAwarenessState, EFWAIAwarenessState PreviousAwarenessState);
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void SERVER_Corpse_Settings();
	void CLIENTS_Corpse_Settings();
	void KillMarker();
	void Interface_ToggleFocus(bool Focus);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void Damage_Detect(double Damage, const class UDamageType* damage_type, class AController* Instigated_By, class AActor* Damage_Causer);
	void Reset_Damage_Detect();
	void SERVER_KillMarker();
	void CLIENTS_KillMarker();
	void Delay_destroy_Markers();
	void OnPlayHit(float DamageTaken, const struct FHitResult& HitResult, class APawn* PawnInstigator, class AActor* DamageCauser, bool bKilled);
	void Awareness_Target_Changed(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void ExecuteUbergraph_BP_AI_CharacterBase(int32 EntryPoint);

	void SetAwarenessMarkerVisibility(bool bVisible) const;
	void GetAIEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_CharacterBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_CharacterBase_C")
	}
	static class ABP_AI_CharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_CharacterBase_C>();
	}
};

}

