#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Audio_Announcement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Audio_Announcement.BP_Audio_Announcement_C
// 0x0048 (0x02D8 - 0x0290)
class ABP_Audio_Announcement_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        F_Prob_ItWillPlay;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Announcement_SC;                                // 0x02A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Line;                                              // 0x02D0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Audio_Announcement(int32 EntryPoint);
	void OnLoaded_DDA20F4749BD82BF8A01E3BCA275B366(class UObject* Loaded);
	void PlaySFX_Multcast();
	void PlaySFX_Server();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Audio_Announcement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Audio_Announcement_C")
	}
	static class ABP_Audio_Announcement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Audio_Announcement_C>();
	}
};

}

