#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Guard_Break

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_HitBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Guard_Break.BP_Action_Guard_Break_C
// 0x0030 (0x03C8 - 0x0398)
class BP_Action_Guard_Break::UBP_Action_Guard_Break_C final : public UBP_Action_HitBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_Guard_Break_C;            // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           GuardAnim;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Guard_L;                                           // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Guard_R;                                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGuardRotation;                                   // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsGuardBreak;                                      // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CommonAnim_Guard_Break;                            // 0x03BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_Guard_Break(int32 EntryPoint);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("BlueprintGeneratedClass BP_Action_Guard_Break.BP_Action_Guard_Break_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_Guard_Break_C")
	}
	static class BP_Action_Guard_Break::UBP_Action_Guard_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_Action_Guard_Break::UBP_Action_Guard_Break_C>();
	}
};
DUMPER7_ASSERTS_BP_Action_Guard_Break__UBP_Action_Guard_Break_C;

}

