#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AsyncEmitter_Audio

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.Audio_PlayingOrVirt
// 0x0005 (0x0005 - 0x0000)
struct BP_AsyncEmitter_Audio_C_Audio_PlayingOrVirt final
{
public:
	bool                                          T_or_F_;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVirtualized_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.ExecuteUbergraph_BP_AsyncEmitter_Audio
// 0x0058 (0x0058 - 0x0000)
struct BP_AsyncEmitter_Audio_C_ExecuteUbergraph_BP_AsyncEmitter_Audio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_FadeDuration_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Audio_PlayingOrVirt_T_or_F_;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_FadeDuration;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FadeTime_ImplicitCast;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.LoadEmiiter
// 0x0008 (0x0008 - 0x0000)
struct BP_AsyncEmitter_Audio_C_LoadEmiiter final
{
public:
	double                                        FadeDuration;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.OnLoaded_8C88CFEC415D5FCE1E23A4ACF7CCB562
// 0x0008 (0x0008 - 0x0000)
struct BP_AsyncEmitter_Audio_C_OnLoaded_8C88CFEC415D5FCE1E23A4ACF7CCB562 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.StartPlaying
// 0x0008 (0x0008 - 0x0000)
struct BP_AsyncEmitter_Audio_C_StartPlaying final
{
public:
	class USoundBase*                             NewSound;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.StopEmitter
// 0x0008 (0x0008 - 0x0000)
struct BP_AsyncEmitter_Audio_C_StopEmitter final
{
public:
	double                                        FadeDuration;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C.StopPlaying
// 0x0001 (0x0001 - 0x0000)
struct BP_AsyncEmitter_Audio_C_StopPlaying final
{
public:
	bool                                          CallFunc_Audio_PlayingOrVirt_T_or_F_;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

