#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AC_PlayerSprint_SFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AC_PlayerSprint_SFX.BP_AC_PlayerSprint_SFX_C
// 0x0160 (0x0200 - 0x00A0)
class UBP_AC_PlayerSprint_SFX_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APawn*                                  Target;                                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_SprintingSFX;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_LowHealthBreathing;                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<EPhysicalSurface, class USoundBase*>     SB_FS_Scuffs;                                      // 0x00C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	EPhysicalSurface                              Surface_Type;                                      // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VolumeScuffs;                                      // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EPhysicalSurface, class USoundBase*>     SB_FS_MS;                                          // 0x0118(0x0050)(Edit, BlueprintVisible)
	class UCharacterMovementComponent*            As_Character_Movement_Component;                   // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FallHeightTrackerTimer;                            // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Fall_Dist;                                         // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Falling;                                           // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Current_Location;                                  // 0x0188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GameTimeONStart;                                   // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x01A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Breathing_MS;                                   // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_VO_Up_SC;                                       // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_VO_Down_SC;                                     // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          EffortRunning_;                                    // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           JumpTimer;                                         // 0x01D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Landing_SFX_SC;                                 // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentStamina;                                    // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           StaminaTimer;                                      // 0x01E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Zero_Stamina_;                                     // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mantling_;                                         // 0x01F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Attach_Point_Name_VO;                              // 0x01F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool UP_Effort_Conditions();
	void TriggerStaminaBreathe();
	void SetStamina();
	void LandingSFX();
	void FallingVOBool();
	void FallHeightTracker();
	void SelectSound(class USoundBase** SelectSound_0);
	double OwnerVelocity();
	void GetOwnerMesh(class USkeletalMeshComponent** GetOwnerMesh_0);
	void InpActEvt_IA_Jump_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Sprint_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Turn180_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void SFXClientOnly_Breathing_Play();
	void SFXClientOnly_Breathing_Stop();
	void SFXClientOnly_FootstepStop();
	void SFXClientOnly_FootstepStopReset(EPhysicalSurface SurfaceType, const struct FVector& Location);
	void ReceiveBeginPlay();
	void Fall_Dist_Reset();
	void Unlock_Fall_Dist_Reset();
	void IntVar();
	void Landing();
	void Reset_JumpEfforts();
	void StopBreathing_Reset();
	void StartBreathing_Reset();
	void MantlingOrVaulting();
	void RecheckState();
	void ExecuteUbergraph_BP_AC_PlayerSprint_SFX(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AC_PlayerSprint_SFX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AC_PlayerSprint_SFX_C")
	}
	static class UBP_AC_PlayerSprint_SFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AC_PlayerSprint_SFX_C>();
	}
};

}

