#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_Fulminis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"
#include "ProjectP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_Fulminis.BP_Action_SlaveArm_Fulminis_C
// 0x0070 (0x0288 - 0x0218)
class UBP_Action_SlaveArm_Fulminis_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_Fulminis_C;      // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         CurrentChargeStep;                                 // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxChargeStep;                                     // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, float>                            ChargeStepTimeMap;                                 // 0x0228(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           FullCharge_Timer;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Pending_Fire;                                      // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_Fulminis(int32 EntryPoint);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStart();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void Fire();
	void OnFullCharge_Step_0();
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void CheckIfSectionChanged();
	void PlaySlaveArmMontage();
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Action_SlaveArm_Fulminis_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_SlaveArm_Fulminis_C")
	}
	static class UBP_Action_SlaveArm_Fulminis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_Fulminis_C>();
	}
};
DUMPER7_ASSERTS_UBP_Action_SlaveArm_Fulminis_C;

}

