#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_HostilityTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_HostilityTracker.BP_AI_HostilityTracker_C
// 0x00B8 (0x0348 - 0x0290)
class ABP_AI_HostilityTracker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Hostility_Timer;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FGameplayTag>      Living_AI;                                         // 0x02A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<struct FGameplayTag, int32>              Number_of_AI_per_Faction_Targeting_Players;        // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Collect_Living_AI();
	void Count_AI_targeting_Players();
	void ExecuteUbergraph_BP_AI_HostilityTracker(int32 EntryPoint);
	void Hostility_Tracking();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_HostilityTracker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_HostilityTracker_C")
	}
	static class ABP_AI_HostilityTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_HostilityTracker_C>();
	}
};

}

