#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AsyncEmitter_Audio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AsyncEmitter_Audio.BP_AsyncEmitter_Audio_C
// 0x0068 (0x02F8 - 0x0290)
class ABP_AsyncEmitter_Audio_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SFX;                                               // 0x02A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         CustomVolume;                                      // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Low_Pass_Filter_Enabled;                        // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         In_Low_Pass_Filter_Frequency;                      // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoNotPlay_;                                        // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_PlayingOrVirt(bool* T_or_F_);
	void ExecuteUbergraph_BP_AsyncEmitter_Audio(int32 EntryPoint);
	void LoadEmiiter(double FadeDuration);
	void OnLoaded_8C88CFEC415D5FCE1E23A4ACF7CCB562(class UObject* Loaded);
	void StartPlaying(class USoundBase* NewSound);
	void StopEmitter(double FadeDuration);
	void StopPlaying();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AsyncEmitter_Audio_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AsyncEmitter_Audio_C")
	}
	static class ABP_AsyncEmitter_Audio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AsyncEmitter_Audio_C>();
	}
};

}

