#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_Bait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AI_Scav_CharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_Bait.BP_AI_Bait_C
// 0x0050 (0x1690 - 0x1640)
class ABP_AI_Bait_C final : public ABP_AI_Scav_CharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AI_Bait_C;                       // 0x1640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   TargetActor;                                       // 0x1648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Bumped_Actors;                                     // 0x1650(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           Bait_Timer;                                        // 0x1660(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Bait_Dist;                                     // 0x1668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Bait_Duration;                                 // 0x1670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          I_am_Number_One_;                                  // 0x1674(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Other_Bait_is_Number_One_;                         // 0x1675(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1676[0x2];                                     // 0x1676(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Current_Timer_Handle_Time;                         // 0x1678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Number_One_Timer_Handle_Time;                      // 0x1680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Not_Number_One_Timer_Handle_Time;                  // 0x1688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Adjust_Bait_Timer();
	void Enable_Bait();
	void ExecuteUbergraph_BP_AI_Bait(int32 EntryPoint);
	void Handle_Bait(class AActor* Actor);
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void Manage_Bait_Timers();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_Bait_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_Bait_C")
	}
	static class ABP_AI_Bait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_Bait_C>();
	}
};

}

