#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Down_Up

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_DMG_STAND_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Down_Up.BP_Action_Down_Up_C
// 0x0020 (0x05E8 - 0x05C8)
class UBP_Action_Down_Up_C : public UBP_Action_DMG_STAND_C
{
public:
	EMovementMode                                 movementMode_Cached;                               // 0x05C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6[0x2];                                      // 0x05C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BoundPeakTimer;                                    // 0x05C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Bouncing;                                          // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HitStunningTimer;                                  // 0x05D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HitStunningEnd;                                    // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Flying;                                            // 0x05E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Action_Down_Up_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_Down_Up_C")
	}
	static class UBP_Action_Down_Up_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Down_Up_C>();
	}
};
DUMPER7_ASSERTS_UBP_Action_Down_Up_C;

}

