#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_Euruska_MeatMan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_MechBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_Euruska_MeatMan.BP_AI_Euruska_MeatMan_C
// 0x0040 (0x1110 - 0x10D0)
class ABP_AI_Euruska_MeatMan_C final : public ABP_MechBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AI_Euruska_MeatMan_C;            // 0x10D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x10D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 FWWeaponUser;                                      // 0x10E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Previous_Loc;                                      // 0x10E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Speed;                                     // 0x1100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AI_Euruska_MeatMan(int32 EntryPoint);
	void OnMeleeAttack(class AActor* Target);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void TunnelCheck(bool* Tunnel_Check_Done_);

	void GetAIEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_Euruska_MeatMan_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_Euruska_MeatMan_C")
	}
	static class ABP_AI_Euruska_MeatMan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_Euruska_MeatMan_C>();
	}
};

}

