#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_FlameThrower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"
#include "ProjectP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_FlameThrower.BP_Action_SlaveArm_FlameThrower_C
// 0x0038 (0x0250 - 0x0218)
class UBP_Action_SlaveArm_FlameThrower_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_FlameThrower_C;  // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FlameThrower_ThrowDuration;                        // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FlameThrower_Timer_ThrowDuration;                  // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          FireState_MultyplyDamage;                          // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableFirstHit;                                    // 0x0231(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Interval;                                          // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveAxisUpperLimit;                                // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lv3_Child_Spawn_Interval;                          // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Lv3_Child_Spawn_Timer;                             // 0x0240(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableFireBoom;                                    // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_FlameThrower(int32 EntryPoint);
	void OnTick(float DeltaTime);
	void OnStart();
	void OnFlameThrowerDurationOver();
	void Spawn_Lv3_Child();
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ApplyAllTimeReinforcement();
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Action_SlaveArm_FlameThrower_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_SlaveArm_FlameThrower_C")
	}
	static class UBP_Action_SlaveArm_FlameThrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_FlameThrower_C>();
	}
};
DUMPER7_ASSERTS_UBP_Action_SlaveArm_FlameThrower_C;

}

