#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_IdleTurn

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_IdleTurn.BP_Action_IdleTurn_C.ExecuteUbergraph_BP_Action_IdleTurn
// 0x0018 (0x0018 - 0x0000)
struct BP_Action_IdleTurn_C_ExecuteUbergraph_BP_Action_IdleTurn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Action_IdleTurn_C_ExecuteUbergraph_BP_Action_IdleTurn;

// Function BP_Action_IdleTurn.BP_Action_IdleTurn_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_IdleTurn_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Action_IdleTurn_C_OnStop;

}

