#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_Euruska_T90

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AI_TankBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_Euruska_T90.BP_AI_Euruska_T90_C
// 0x0030 (0x07F0 - 0x07C0)
class ABP_AI_Euruska_T90_C final : public ABP_AI_TankBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AI_Euruska_T90_C;                // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWArmorContainerComponent*             Armor;                                             // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWHardpointContainerComponent*         Hardpoints;                                        // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        MG_Socket;                                         // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_MuzzleFlash_MainGun;                       // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_MuzzleFlash_MG;                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UABP_AI_Chaos_T90_NEW_C*                AnimBP;                                            // 0x07E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AI_Euruska_T90(int32 EntryPoint);
	void HideMachinegun();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void WeaponFire(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_Euruska_T90_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_Euruska_T90_C")
	}
	static class ABP_AI_Euruska_T90_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_Euruska_T90_C>();
	}
};

}

