#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_Scav_Turret_20mm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AI_Europa_Turret_20mm_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_Scav_Turret_20mm.BP_AI_Scav_Turret_20mm_C
// 0x0050 (0x0658 - 0x0608)
class ABP_AI_Scav_Turret_20mm_C : public ABP_AI_Europa_Turret_20mm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AI_Scav_Turret_20mm_C;           // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       AmmoMarker;                                        // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Near_Turret_DOT_check;                             // 0x0618(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAmmo;                                           // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentAmmo;                                       // 0x0624(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Distance_From_Turret_Timer;                        // 0x0628(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Local_Player;                                      // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Ammo_Status_Marker_Range;                          // 0x0638(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckAbandoned;                                    // 0x0640(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Abandoned_Dist;                                    // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Abandon_Retry;                                     // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_for_moving_platform();
	void CLIENTS_Ammo_marker_Remove();
	void CLIENTS_Update_Ammo_Count_After_Fire();
	void ExecuteUbergraph_BP_AI_Scav_Turret_20mm(int32 EntryPoint);
	void Fire_Burst();
	void FireSoundsAndEffects();
	struct FVector GetAimAtPoint();
	void NearTurretDOT();
	void OnKilled(class UFWHealthComponent* HealthComponent, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void Player_Dist_from_Turret();
	void ReceiveBeginPlay();
	void SERVER_Ammo_Marker_Remove();
	void SERVER_ONLY_Update_Ammo_Count_After_Fire();
	void Server_Spawn_Projectile();
	void Turret_Abandoned_Check();
	void TurretCanBeSeen(bool* I_Am_Seen_);
	void TurretSuicide();
	void Update_Ammo_Count_after_Fire();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_Scav_Turret_20mm_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_Scav_Turret_20mm_C")
	}
	static class ABP_AI_Scav_Turret_20mm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_Scav_Turret_20mm_C>();
	}
};

}

