#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_SniperCannon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"
#include "ProjectP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C
// 0x0030 (0x0248 - 0x0218)
class UBP_Action_SlaveArm_SniperCannon_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_SniperCannon_C;  // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TargetLocation;                                    // 0x0220(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetCamera;                                      // 0x022C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFired;                                            // 0x022D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCameraManager*                        LCameraManager;                                    // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_ZoomIn;                                       // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_ZoomOut;                                      // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FastFire;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BackDash;                                          // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BackDashEnable;                                    // 0x0242(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PostBackDash;                                      // 0x0243(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon(int32 EntryPoint);
	void OnStopByMe(class ULActBase* StoppingAction);
	void OnTick(float DeltaTime);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnCommandOccured_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnStart();
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Action_SlaveArm_SniperCannon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Action_SlaveArm_SniperCannon_C")
	}
	static class UBP_Action_SlaveArm_SniperCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_SniperCannon_C>();
	}
};
DUMPER7_ASSERTS_UBP_Action_SlaveArm_SniperCannon_C;

}

