#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AC_HealthSFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_PlayerVictim_SyncKill_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AC_HealthSFX.BP_AC_HealthSFX_C
// 0x03F0 (0x0490 - 0x00A0)
class UBP_AC_HealthSFX_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CriticalHealthLevel;                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerBase_C*                       As_BP_Player_Base;                                 // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_LowHealth_SC;                                   // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_LowHealth_SC;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_LowHealth;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Dead_SC;                                        // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_PlayerDead_SC;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BeenDowned_;                                       // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Health;                                            // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_LowHealth_WhooshOut_SC;                         // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_HitReact_SC;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Downed_SC;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Downed_SC;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_Downed;                                       // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_DuckHitReact;                                 // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerCamIndex;                                    // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SecondaryCheck;                                    // 0x0128(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     SB_FleshImpacts_SFX;                               // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioComponent*                        AC_Impacts_SC;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          SyncKill_;                                         // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SB_Sync_SC;                                        // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GoodHealthTriggered_;                              // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SB_Rivived_SC;                                     // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowLowHealth_;                                   // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              SB_VO_BeingAttacked_SC;                            // 0x0170(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_Downed_SC;                                   // 0x0198(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_TeamMateDead_SC;                             // 0x01C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_Spawn_SC;                                    // 0x01F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_LargeNoEnemies_SC;                           // 0x0218(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_MediumNoEnemies_SC;                          // 0x0240(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_HunterKiller_BossSpotted_SC;                 // 0x0268(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_BossSpotted_SC;                              // 0x0290(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_BleedingOut_SC;                                 // 0x02B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_Pain_SC;                                     // 0x02E0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_VO_Extracted;                                   // 0x0308(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Character;                                         // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VO_CoolDown;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VO_CoolDown_Value;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AttackPlayed_VO;                                   // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeNumber_VO;                                    // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MediumNumber_VO;                                   // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x5];                                      // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AC_VO_BleedingOut_SC;                              // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Falling_;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AC_EnemiesSpotted_VO;                              // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_VO_BeingAttacked_SC;                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BossSpotted_;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              SCMM_SyncKill;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_TeamMateDowned_SC;                              // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          GeigarCounter_;                                    // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              SB_GeigarCounter_SC;                               // 0x03B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        AC_GeigarCounter_SC;                               // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           GeigarCounterTimer;                                // 0x03E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<E_PlayerVictim_SyncKill, TSoftObjectPtr<class USoundBase>> SB_VictimSyncKill_SC;            // 0x03E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FName                                   VO_Attach_Point_Name;                              // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Consuming_;                                        // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0448(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_DirectionalImpactUI_SB;                         // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_PlayerNotify_Burn_SC;                           // 0x0468(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void StopGeigarCounterSFX();
	void VO_Spawn_Check(struct FTimerHandle& Handle);
	void DamageChecks_ForPainVOSFX(const class UObject* Object);
	void PlayAtActorLocation(class USoundBase* Sound);
	void VO_BeingAttackedAndPainHit();
	void VO_CoolDownBool(bool* CoolDownPass);
	void PainReact_SFX(const class UObject* Object);
	void TempLoopFix();
	void SystemQueries();
	void QueryToStart();
	void StopAudioSticking();
	void SyncKillSFXChain();
	void CheckHealth();
	void LowHealth_State();
	void SettingUpPlayerState(class AFWPlayerState_Default** AsFWPlayer_State_Default);
	void SettingUpPlayerBase();
	void GoodHealth_State();
	void Revived_State();
	void Downed_State();
	void Dead_State();
	bool WithinCriticalHealth();
	void SetHealth();
	bool GoodHealth();
	void Audio_Good_Health();
	void Audio_LowHealth();
	void Audio_Revived();
	void Audio_Downed();
	void Audio_Dead();
	void InpActEvt_L_K2Node_InputDebugKeyEvent_0(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void OnLoaded_6AF5942D49CCFC0F5B7FBA8398531450(class UObject* Loaded);
	void OnLoaded_7C6E34F9439537EB75EC92B6BAA2A0DB(class UObject* Loaded);
	void OnLoaded_870A32D249FD9480BE5302B3E1EF64BA(class UObject* Loaded);
	void OnLoaded_ECB6B9AE4BCBBD807C4D44AADA8E96B3(class UObject* Loaded);
	void OnLoaded_AC361C244B7B76CC466F28A1B2F7E11D(class UObject* Loaded);
	void OnLoaded_94522F944689A4909B162EA64D865EEB(class UObject* Loaded);
	void OnLoaded_F638600B4F06A425B4F5FEBC5685ABBD(class UObject* Loaded);
	void OnLoaded_67A773924C196E5F2EF179ACC712CDD3(class UObject* Loaded);
	void OnLoaded_8C2544BF427C668043F3F59327AC4C82(class UObject* Loaded);
	void OnLoaded_4C853A22405195FE71B726A939AD74D4(class UObject* Loaded);
	void OnLoaded_590AE5144FEF818CF51A3BB4394FBDB3(class UObject* Loaded);
	void OnLoaded_2965F0134936679E89343EBF62129193(class UObject* Loaded);
	void OnLoaded_7726D2774CC2BD19A4315FB03E682EEC(class UObject* Loaded);
	void OnLoaded_0C9A41A744964C854B8FD09431EAD902(class UObject* Loaded);
	void OnLoaded_BD2039794C33242B6CAAD09AAD3A69E2(class UObject* Loaded);
	void ReceiveBeginPlay();
	void TakeDamage(class AActor* Actor);
	void HealthChecker();
	void LowHealth_SFXChain();
	void Dead_SFXChain();
	void Downed_SFXChain();
	void Reset_LowHealth_SFXChain();
	void Reset_DownSFX_Chain();
	void RegainHealth_SFXChain();
	void ResetHealthTimer();
	void Revived_SFXChain();
	void Revived_SFXChain_Reset();
	void int_0();
	void Reset_RegainHealth_SFXChain_();
	void StartSystem();
	void PlayerIsDead();
	void MusicState();
	void Hit_StartSystem_Reset();
	void SyncKill(E_PlayerVictim_SyncKill SyncKill_0);
	void BugFix();
	void StickBugFix();
	void ResetBug();
	void TriggerMusicSystem();
	void DeathDebug();
	void Downed_Debug();
	void Revived_Debug();
	void LowHealthDebug();
	void HealthyDebug();
	void HealthResetLoopingDebug();
	void SyncKill_Debug();
	void TimerEventsDebug();
	void SystemStart_Debug();
	void VO_Downed_Server();
	void VO_Downed_Multicast(TSoftObjectPtr<class USoundBase> Downed_SB, class AActor* Actor, TSoftObjectPtr<class USoundBase> BleedingOut_SB, class USceneComponent* AttachToComponent, int32 Line);
	void VO_TakingFireEvemt(const class UObject* Object);
	void VO_Spawn();
	void VO_LargeNumberSpotted_Server();
	void VO_MediumNumberSpotted_Server();
	void VO_LargeNumberSpotted_MultiCast(TSoftObjectPtr<class USoundBase> Sound, class USceneComponent* AttachToComponent, int32 inInt);
	void VO_MediumNumberSpotted_MultiCast(TSoftObjectPtr<class USoundBase> Sound, class USceneComponent* AttachToComponent, int32 inInt);
	void VO_BossSpotted_Server();
	void VO_BossSpotted_Multicast(class USoundBase* Sound, class USceneComponent* AttachToComponent, int32 inInt);
	void VO_Spawn_Timer();
	void OnExtraction(bool bIsTunnelExtract);
	void VO_Extraction_Server();
	void Vo_Extraction_Debug();
	void Falling();
	void BeingAttackedVO();
	void PainVO();
	void VO_Extraction_OwningClient();
	void Spawn_VO_Server();
	void Spawn_VO_Multicast(class USceneComponent* AttachToComponent, int32 inInt, TSoftObjectPtr<class UObject> Asset);
	void TeamMateDead_VO();
	void TeamMateDead_VO_Multicast(TSoftObjectPtr<class UObject> Asset, class USceneComponent* AttachToComponent, int32 inInt);
	void TeamMateDead_Vo_Server();
	void GeigarCounterStart_SFX();
	void GeigarCounterStop_SFX();
	void CustomEvent();
	void DownedPLayerNotify();
	void Retrigger_GeigarCounter();
	void Reset_GeigarCounter();
	void PlayerVO_SyncKill_Multicast();
	void PlayerVO_SyncKill_Server();
	void Consuming_Trigger_Block();
	void Consuming_Trigger_Unblock();
	void HunterKiller_VO();
	void HunterKiller_VO_Server();
	void HunterKiller_VO_Multicast(int32 inInt, class USceneComponent* AttachToComponent, TSoftObjectPtr<class UObject> Asset);
	void PlayerNotify_BurningDamge_SFX();
	void ExecuteUbergraph_BP_AC_HealthSFX(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AC_HealthSFX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AC_HealthSFX_C")
	}
	static class UBP_AC_HealthSFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AC_HealthSFX_C>();
	}
};

}

