#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AN_Standardised_AI_Footstep

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_AI_FootstepType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AN_Standardised_AI_Footstep.BP_AN_Standardised_AI_Footstep_C
// 0x0030 (0x0068 - 0x0038)
class UBP_AN_Standardised_AI_Footstep_C final : public UAnimNotify
{
public:
	class USoundBase*                             SB_FS_SC;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_AI_FootstepType                             FS_Type;                                           // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewVar;                                            // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RaiseSFXby;                                        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AN_Standardised_AI_Footstep_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AN_Standardised_AI_Footstep_C")
	}
	static class UBP_AN_Standardised_AI_Footstep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AN_Standardised_AI_Footstep_C>();
	}
};

}

