#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_Euruska_Stalker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Eurasia_CharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_Euruska_Stalker.BP_AI_Euruska_Stalker_C
// 0x0120 (0x12D0 - 0x11B0)
class ABP_AI_Euruska_Stalker_C final : public ABP_Eurasia_CharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AI_Euruska_Stalker_C;            // 0x11A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight2;                                       // 0x11B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x11C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SyncKillLight;                                     // 0x11C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         NeckYawRot;                                        // 0x11D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D4[0x4];                                     // 0x11D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SenseIndicator;                                    // 0x11D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StalkerMode;                                       // 0x11E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BB_SensedTarget;                                   // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         StalkerState;                                      // 0x11F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F1[0x7];                                     // 0x11F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerBase_C*                       SensedActor;                                       // 0x11F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       GrabbedPlayersCamera;                              // 0x1200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          SyncKilling_;                                      // 0x1208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1209[0x7];                                     // 0x1209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerBase_C*                       SyncKillVictim;                                    // 0x1210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SyncKillExitState;                                 // 0x1218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121C[0x4];                                     // 0x121C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   My_Blackboard;                                     // 0x1220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BBKey_SenseIndicator;                              // 0x1228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BBKey_StalkerState;                                // 0x1230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHealth;                                     // 0x1238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFWGamePlayerCharacter*                 As_FWGame_Player_Character;                        // 0x1240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ProximityDOTTimer;                                 // 0x1248(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          APlayerDetected_;                                  // 0x1250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1251[0x7];                                     // 0x1251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckTime;                                         // 0x1258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceToPlayBossMusic;                           // 0x1260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BossMusicTimer;                                    // 0x1268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceFromPlayer;                                // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DistanceFS;                                        // 0x1278(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Tracker_MS;                                     // 0x1280(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_CompletionStinger_02_SC;                        // 0x12A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Audio_BeginPlay();
	void BndEvt__BP_AI_Euruska_Stalker_AIAwarenessComponent_K2Node_ComponentBoundEvent_0_FWAIPlayerLostSignature__DelegateSignature(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class APlayerController* PlayerController);
	void BndEvt__BP_AI_Euruska_Stalker_AIAwarenessComponent_K2Node_ComponentBoundEvent_2_FWAISelectedTargetChangedSignature__DelegateSignature(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void Boss_Close_VO();
	void BossMusicFunction();
	void Consider_Actor_For_DOT(class AActor* Actor, TArray<class AActor*>& Actor_Array, const struct FVector& Location, bool* Add_to_DOT_);
	void ExecuteUbergraph_BP_AI_Euruska_Stalker(int32 EntryPoint);
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void Killed_SFX(class AActor* Killer);
	void Killed_SFX_Multicast();
	void Killed_SFX_Server();
	void NewHeadRot(double NewNeckRot);
	void NPCproximityDOT();
	void OnLoaded_8DE3717245FD8CE63050B2BA754934C5(class UObject* Loaded);
	void OnLoaded_D3B5F29F48E4E31AEBD686854F6AD8C4(class UObject* Loaded);
	void Play_Tracker();
	void PlayerDetected_Multicast();
	void PlayerDetected_Server();
	void PlayerLost_Multicast();
	void PlayerLost_Server();
	void ReceiveBeginPlay();
	void Reset_Timer();
	void SetHeadRot();
	void SetNormalMode();
	void SetStalkerMode();
	void Stop_Tracker();
	void TunnelCheck(bool* Tunnel_Check_Done_);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_Euruska_Stalker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_Euruska_Stalker_C")
	}
	static class ABP_AI_Euruska_Stalker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_Euruska_Stalker_C>();
	}
};

}

