#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AI_Europa_Soldier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWAnimation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Europa_CharacterBase_classes.hpp"
#include "FWAICore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AI_Europa_Soldier.BP_AI_Europa_Soldier_C
// 0x0490 (0x1630 - 0x11A0)
class ABP_AI_Europa_Soldier_C : public ABP_Europa_CharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AI_Europa_Soldier_C;             // 0x11A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   Text_Target;                                       // 0x11A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterDamage_C*                     CharacterDamage;                                   // 0x11B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_HitReactions_C*                     AC_HitReactions;                                   // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeathImpact;                                       // 0x11C0(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         HitCount;                                          // 0x11D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLeaningControls;                             // 0x11DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnablePoseControls;                                // 0x11DD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DE[0x2];                                     // 0x11DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IVisionRadius;                                     // 0x11E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E4[0x4];                                     // 0x11E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            IVisionSMs;                                        // 0x11E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bDebugState;                                       // 0x11F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F9[0x7];                                     // 0x11F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              bags4_Materials;                                   // 0x1200(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              gear4_Materials;                                   // 0x1210(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              PRC_radio2;                                        // 0x1220(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              Helmet;                                            // 0x1230(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              PRC_radio;                                         // 0x1240(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              rebreather;                                        // 0x1250(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              sleepbag;                                          // 0x1260(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              pants;                                             // 0x1270(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              kneepad;                                           // 0x1280(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              shoes;                                             // 0x1290(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              armguard;                                          // 0x12A0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              bellybags;                                         // 0x12B0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              armdevice;                                         // 0x12C0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              pauldron;                                          // 0x12D0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              dangly_bits;                                       // 0x12E0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              poncho;                                            // 0x12F0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              breastplate;                                       // 0x1300(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              upperbody;                                         // 0x1310(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class UAnimMontage*                           MeleeMontage;                                      // 0x1320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           RifleMelees;                                       // 0x1328(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           UnarmedMelees;                                     // 0x1338(0x0010)(Edit, BlueprintVisible)
	bool                                          Is_In_Melee;                                       // 0x1348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1349[0x3];                                     // 0x1349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Hit_Bone_Name;                                     // 0x134C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1354[0x4];                                     // 0x1354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Modified_Damage;                                   // 0x1358(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EHitStrength, class UAnimMontage*>       HItReactionDamageTypeMontages;                     // 0x1360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	EHitStrength                                  DamageType;                                        // 0x13B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B1[0x7];                                     // 0x13B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x13B8(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Physics_Blend_Weight;                              // 0x14B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B4[0x4];                                     // 0x14B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Gear;                                              // 0x14B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsRagDollRunning_;                                 // 0x14C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C1[0x7];                                     // 0x14C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           HitReactionMontage;                                // 0x14C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugCount;                                        // 0x14D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BlackboardIncomingDamage;                          // 0x14D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TEMPDELETE_TargetName;                             // 0x14DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E4[0x4];                                     // 0x14E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TEMPDELETE_Blank;                                  // 0x14E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TEMPDELETE_IHateScavs;                             // 0x14F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TEMPDELTE_ILoveScavs;                              // 0x1508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHitResult                             Hit_Result;                                        // 0x1518(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 Last_Hit;                                          // 0x1610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Mesh_Variant_1;                                    // 0x1618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USkeletalMesh*                          Mesh_Variant_2;                                    // 0x1620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          PlayHitReacts_;                                    // 0x1628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomSkele_;                                      // 0x1629(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	bool SetDamageType(EHitStrength DamageType_0);
	EHitStrength GetDamageType();
	class UAnimMontage* GetHitReactionMontage();
	void EnableRagDoll(class FName InHitBoneName);
	void Can_Melee(bool* Can_Melee_0);
	EImpactArea BoneToImpactArea(class FName BoneName);
	void PlaySignal(EA_SignalType Signal_Type, const struct FVector& Recipient_Location, const struct FVector& Target_Location);
	void OnRep_DeathImpact();
	void OnUnequipFinished();
	void PerformLineTrace(const struct FVector& StartLocation, class AActor** Actor);
	void OnNotifyEnd_F15BEE9E4769E7E5902A85BF29D4A1DC(class FName NotifyName);
	void OnNotifyBegin_F15BEE9E4769E7E5902A85BF29D4A1DC(class FName NotifyName);
	void OnInterrupted_F15BEE9E4769E7E5902A85BF29D4A1DC(class FName NotifyName);
	void OnBlendOut_F15BEE9E4769E7E5902A85BF29D4A1DC(class FName NotifyName);
	void OnCompleted_F15BEE9E4769E7E5902A85BF29D4A1DC(class FName NotifyName);
	void ApplyHitExtras();
	void OnMeleeAttack(class AActor* Target);
	void OnAbortMeleeAttack();
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType_0, class AController* InstigatedBy, class AActor* DamageCauser);
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void DamageReaction(double Damage, const struct FHitResult& Hit_Result_0, const class UDamageType* damage_type, class AActor* Damage_Causer);
	void Weapon_Management();
	void OnAwarenessStateChanged(class UFWAIAwarenessComponent_NPC* AwarenessComponent, EFWAIAwarenessState NewAwarenessState, EFWAIAwarenessState PreviousAwarenessState);
	void Rag_doll();
	void ExecuteUbergraph_BP_AI_Europa_Soldier(int32 EntryPoint);

	bool IsInMeleeAttack() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AI_Europa_Soldier_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AI_Europa_Soldier_C")
	}
	static class ABP_AI_Europa_Soldier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AI_Europa_Soldier_C>();
	}
};

}

