#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasePlayerContainer

#include "Basic.hpp"

#include "FWInventory_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BasePlayerContainer.BP_BasePlayerContainer_C
// 0x0030 (0x02C0 - 0x0290)
class ABP_BasePlayerContainer_C : public AFWBackpackRigContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Mantle_Checks;                                     // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UStaticMesh>>     Special_Rigs_that_Hide_Meshes;                     // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Invis_Checks;                                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void check_mantle_again();
	void Check_Mantle_Fix();
	void ExecuteUbergraph_BP_BasePlayerContainer(int32 EntryPoint);
	void IgnorePlayers();
	void MantleFix();
	void ReceiveBeginPlay();
	void Retry_Invis();
	void ShouldBeInvisible(bool* Success_);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BasePlayerContainer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BasePlayerContainer_C")
	}
	static class ABP_BasePlayerContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BasePlayerContainer_C>();
	}
};

}

