#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseDangleSingleConstraint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_OwnerFaction_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseDangleSingleConstraint.BP_BaseDangleSingleConstraint_C
// 0x0060 (0x0300 - 0x02A0)
class ABP_BaseDangleSingleConstraint_C : public ADangly
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Loot_DropLogic_C*                  BPC_Loot_DropLogic;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWDanglyComponent*                     DanglyComponent;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            Constraint;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        DestroyedEmitter;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Battle_Point_Row;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Battle_Point;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OwnerFaction                                Faction;                                           // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpeningContainerMakeFoe_;                          // 0x02D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Currently_Picked_Up;                               // 0x02D6(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pad_Loot_Collision_;                               // 0x02D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Pad_Loot_Collision_Static_Meshes;                  // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Padding_Occured;                                   // 0x02E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Loot_Detection_Padding_Scale;                      // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         Pad_Loot_Collision_Skele_Meshes;                   // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CLIENTS_Dangle_was_Dropped();
	void CLIENTS_Dangle_was_Looted();
	float GetBattlePoint();
	void ReceiveBeginPlay();
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void UserConstructionScript();
	void SetupAttachPoints(TArray<struct FTransform>& Points, uint8 UILocation, bool Relative, bool ExtraDangle, bool* Success);
	void Loot_Collision_Padding();
	void DanglyDropped();
	void DroppedDestroyedDangle();
	void BndEvt__BP_BaseDangleSingleConstraint_DanglyComponent_K2Node_ComponentBoundEvent_1_DanglyDestroyed__DelegateSignature();
	void BndEvt__BP_BaseDangleSingleConstraint_DanglyComponent_K2Node_ComponentBoundEvent_2_DanglyLooted__DelegateSignature();
	void BndEvt__BP_CritialLoot_QuestItem_DanglyComponent_K2Node_ComponentBoundEvent_5_DanglyDropped__DelegateSignature();
	void SERVER_Dangle_was_Dropped();
	void SERVER_Dangle_was_Looted();
	void Looted_Variables();
	void ExecuteUbergraph_BP_BaseDangleSingleConstraint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseDangleSingleConstraint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseDangleSingleConstraint_C")
	}
	static class ABP_BaseDangleSingleConstraint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseDangleSingleConstraint_C>();
	}
};

}

