#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomRigLoadouts

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.AddRig
// 0x0118 (0x0118 - 0x0000)
struct BP_CustomRigLoadouts_C_AddRig final
{
public:
	class FString                                 RigName;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	struct FFWCustomSavedRig                      RigData;                                           // 0x0010(0x00C8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CurrentIndecies;                                   // 0x00D8(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWCustomSavedIndecies                 K2Node_MakeStruct_FWCustomSavedIndecies;           // 0x00F0(0x0010)()
	struct FFWCustomSavedIndecies                 CallFunc_Map_Find_Value;                           // 0x0100(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.AddWeapon
// 0x00D0 (0x00D0 - 0x0000)
struct BP_CustomRigLoadouts_C_AddWeapon final
{
public:
	class FString                                 WeaponName;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	struct FFWCustomSavedWeapon                   WeaponData;                                        // 0x0010(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CurrentIndecies;                                   // 0x0090(0x0010)(Edit, BlueprintVisible)
	struct FFWCustomSavedIndecies                 K2Node_MakeStruct_FWCustomSavedIndecies;           // 0x00A0(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWCustomSavedIndecies                 CallFunc_Map_Find_Value;                           // 0x00B8(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.Delete Rig
// 0x01E8 (0x01E8 - 0x0000)
struct BP_CustomRigLoadouts_C_Delete_Rig final
{
public:
	class FString                                 RigName;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	struct FFWCustomSavedRig                      Data;                                              // 0x0010(0x00C8)(Edit, BlueprintVisible)
	TArray<int32>                                 Indicies;                                          // 0x00D8(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWCustomSavedRig                      CallFunc_Map_Find_Value;                           // 0x00F0(0x00C8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWCustomSavedIndecies                 K2Node_MakeStruct_FWCustomSavedIndecies;           // 0x01C0(0x0010)()
	struct FFWCustomSavedIndecies                 CallFunc_Map_Find_Value_1;                         // 0x01D0(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.DeleteWeapon
// 0x01D8 (0x01D8 - 0x0000)
struct BP_CustomRigLoadouts_C_DeleteWeapon final
{
public:
	class FString                                 WeaponName;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	struct FFWCustomSavedWeapon                   Data;                                              // 0x0010(0x0080)(Edit, BlueprintVisible)
	TArray<int32>                                 Indicies;                                          // 0x0090(0x0010)(Edit, BlueprintVisible)
	struct FFWCustomSavedWeapon                   CallFunc_Map_Find_Value;                           // 0x00A0(0x0080)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWCustomSavedIndecies                 CallFunc_Map_Find_Value_1;                         // 0x0128(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWCustomSavedIndecies                 K2Node_MakeStruct_FWCustomSavedIndecies;           // 0x0140(0x0010)()
	struct FFWCustomSavedWeapon                   CallFunc_Map_Find_Value_2;                         // 0x0150(0x0080)()
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.Get Rig Names
// 0x0020 (0x0020 - 0x0000)
struct BP_CustomRigLoadouts_C_Get_Rig_Names final
{
public:
	TArray<class FString>                         RigNames;                                          // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.GetPatch
// 0x0004 (0x0004 - 0x0000)
struct BP_CustomRigLoadouts_C_GetPatch final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.GetWeaponNames
// 0x0020 (0x0020 - 0x0000)
struct BP_CustomRigLoadouts_C_GetWeaponNames final
{
public:
	TArray<class FString>                         WeaponNames;                                       // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.PatchSave
// 0x0001 (0x0001 - 0x0000)
struct BP_CustomRigLoadouts_C_PatchSave final
{
public:
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.PatchWeaponPresets
// 0x0002 (0x0002 - 0x0000)
struct BP_CustomRigLoadouts_C_PatchWeaponPresets final
{
public:
	bool                                          RemovedPresets;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.RenameRig
// 0x01B8 (0x01B8 - 0x0000)
struct BP_CustomRigLoadouts_C_RenameRig final
{
public:
	class FString                                 OldName;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class FString                                 NewName;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FFWCustomSavedRig                      RigData;                                           // 0x0020(0x00C8)(Edit, BlueprintVisible)
	struct FFWCustomSavedRig                      CallFunc_Map_Find_Value;                           // 0x00E8(0x00C8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.RenameWeapon
// 0x0128 (0x0128 - 0x0000)
struct BP_CustomRigLoadouts_C_RenameWeapon final
{
public:
	class FString                                 OldName;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class FString                                 NewName;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FFWCustomSavedWeapon                   WeaponData;                                        // 0x0020(0x0080)(Edit, BlueprintVisible)
	struct FFWCustomSavedWeapon                   CallFunc_Map_Find_Value;                           // 0x00A0(0x0080)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CustomRigLoadouts.BP_CustomRigLoadouts_C.SaveGame
// 0x0008 (0x0008 - 0x0000)
struct BP_CustomRigLoadouts_C_SaveGame final
{
public:
	int32                                         CallFunc_GetPatch_Version;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToDatastore_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

