#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomPostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomPostProcess.BP_CustomPostProcess_C
// 0x0710 (0x09A0 - 0x0290)
class ABP_CustomPostProcess_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PP;                                                // 0x02B0(0x06F0)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BP_CustomPostProcess(int32 EntryPoint);
	void getPostProcess(struct FPostProcessSettings* PostProcessSettings);
	void UpdatePostProcess(const struct FPostProcessSettings& PP_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomPostProcess_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomPostProcess_C")
	}
	static class ABP_CustomPostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CustomPostProcess_C>();
	}
};

}

