#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomVendorList

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomVendorList.BP_CustomVendorList_C
// 0x00B0 (0x00D8 - 0x0028)
class UBP_CustomVendorList_C final : public USaveGame
{
public:
	int32                                         PathVersion;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPersistenceSubsystem*                Owning_Subsystem;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FFWVendorListItems> VendorLists;                                      // 0x0038(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FFWCustomSavedIndecies> ListIndicies;                                 // 0x0088(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DeleteList(const class FString& ListName);
	void GetLists(const class FString& BaseName, TArray<class FString>* VendorLists_0);
	void GetNextListIndex(const class FString& BaseName, int32* StartingIndex);
	void SaveGame();
	void SaveList(const class FString& Name_0, const struct FFWVendorListItems& List);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomVendorList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomVendorList_C")
	}
	static class UBP_CustomVendorList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomVendorList_C>();
	}
};

}

