#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomPostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CustomPostProcess.BP_CustomPostProcess_C.ExecuteUbergraph_BP_CustomPostProcess
// 0x0700 (0x0700 - 0x0000)
struct BP_CustomPostProcess_C_ExecuteUbergraph_BP_CustomPostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_CustomEvent_PP;                             // 0x0010(0x06F0)()
};

// Function BP_CustomPostProcess.BP_CustomPostProcess_C.getPostProcess
// 0x06F0 (0x06F0 - 0x0000)
struct BP_CustomPostProcess_C_getPostProcess final
{
public:
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0000(0x06F0)(Parm, OutParm)
};

// Function BP_CustomPostProcess.BP_CustomPostProcess_C.UpdatePostProcess
// 0x06F0 (0x06F0 - 0x0000)
struct BP_CustomPostProcess_C_UpdatePostProcess final
{
public:
	struct FPostProcessSettings                   PP_0;                                              // 0x0000(0x06F0)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

