#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CompassMarkerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CompassMarkerComponent.BP_CompassMarkerComponent_C
// 0x0020 (0x00C0 - 0x00A0)
class UBP_CompassMarkerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   QuestTag;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             QuestMarkerIcon;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         VisibleDistance;                                   // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 MarkerColor;                                       // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Marker();
	void AddMarkerForMultipleObjectToPickWithSameType();
	void ExecuteUbergraph_BP_CompassMarkerComponent(int32 EntryPoint);
	void ModifyQuestTag(const class FString& AdditionalTag);
	void MulticastAddMarker();
	void MulticastAddMarkerForMultipleObjectToPickWithSameType();
	void MulticastRemoveMarker();
	void MulticastRemoveMarkerForMultipleObjectToPickWithSameType();
	void RemoveMarker();
	void RemoveMarkerForMultipleObjectToPickWithSameType();
	void ServerAddMarker();
	void ServerAddMarkerForMultipleObjectToPickWithSameType();
	void ServerRemoveMarker();
	void ServerRemoveMarkerForMultipleObjectToPickWithSameType();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CompassMarkerComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CompassMarkerComponent_C")
	}
	static class UBP_CompassMarkerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CompassMarkerComponent_C>();
	}
};

}

