#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CritialLoot_QuestItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DangleContainerBag_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CritialLoot_QuestItem.BP_CritialLoot_QuestItem_C
// 0x0058 (0x0378 - 0x0320)
class ABP_CritialLoot_QuestItem_C final : public ABP_DangleContainerBag_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CritialLoot_QuestItem_C;         // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CompassMarkerComponent_C*           BP_CompassMarkerComponent;                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_PlasticBarrel_blue;                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Visible_Distance;                                  // 0x0344(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuestTaskRequirement>      Quest_Task_04_Requirement;                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UQuestTask>                 Quest_Task;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         QuestProgress;                                     // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestMarker_C*                      MarkerReference;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_Picked_Up;                                   // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ItemDropped;                                       // 0x0374(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          DestroyItem;                                       // 0x0375(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CritialLoot_QuestItem_DanglyComponent_K2Node_ComponentBoundEvent_4_DanglyLooted__DelegateSignature();
	void BndEvt__BP_CritialLoot_QuestItem_DanglyComponent_K2Node_ComponentBoundEvent_5_DanglyDropped__DelegateSignature();
	void DropDeadPlayerLoot(class AFWGamePlayerCharacter* Player);
	void DroppedCriticalLoot(class AActor* OldLoot);
	void DroppedItem(class APawn* Owner_0);
	void ExecuteUbergraph_BP_CritialLoot_QuestItem(int32 EntryPoint);
	void MutlicastRemoveMarker();
	void OnRep_DestroyItem();
	void OnRep_ItemDropped();
	void ReceiveBeginPlay();
	void ServerRemoveMarkerr();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CritialLoot_QuestItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CritialLoot_QuestItem_C")
	}
	static class ABP_CritialLoot_QuestItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CritialLoot_QuestItem_C>();
	}
};

}

