#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomRigLoadouts

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomRigLoadouts.BP_CustomRigLoadouts_C
// 0x0150 (0x0178 - 0x0028)
class UBP_CustomRigLoadouts_C final : public USaveGame
{
public:
	TMap<class FString, struct FFWCustomSavedRig> FWCustom_Saved_Rig;                                // 0x0028(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PathVersion;                                       // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FFWCustomSavedWeapon> FWCustomSavedWeapon;                            // 0x0080(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFWPersistenceSubsystem*                Owning_Subsystem;                                  // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FFWCustomSavedIndecies> WeaponIndicies;                                 // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FFWCustomSavedIndecies> RigIndicies;                                    // 0x0128(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddRig(const class FString& RigName, const struct FFWCustomSavedRig& RigData);
	void AddWeapon(const class FString& WeaponName, const struct FFWCustomSavedWeapon& WeaponData);
	void Delete_Rig(const class FString& RigName);
	void DeleteWeapon(const class FString& WeaponName);
	void Get_Rig_Names(TArray<class FString>* RigNames);
	void GetPatch(int32* Version);
	void GetWeaponNames(TArray<class FString>* WeaponNames);
	void PatchSave();
	void PatchWeaponPresets(bool* RemovedPresets);
	void RenameRig(const class FString& OldName, const class FString& NewName);
	void RenameWeapon(const class FString& OldName, const class FString& NewName);
	void SaveGame();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomRigLoadouts_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomRigLoadouts_C")
	}
	static class UBP_CustomRigLoadouts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomRigLoadouts_C>();
	}
};

}

