#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CRWUniversalBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CRWUniversalBase.BP_CRWUniversalBase_C.ExecuteUbergraph_BP_CRWUniversalBase
// 0x0028 (0x0028 - 0x0000)
struct BP_CRWUniversalBase_C_ExecuteUbergraph_BP_CRWUniversalBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;         // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CRWUniversalBase.BP_CRWUniversalBase_C.OnLoaded_A019339F499400AC7691EFA37B52AE8C
// 0x0008 (0x0008 - 0x0000)
struct BP_CRWUniversalBase_C_OnLoaded_A019339F499400AC7691EFA37B52AE8C final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

}

