#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dangle_Master

#include "Basic.hpp"

#include "FWInventory_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dangle_Master.BP_Dangle_Master_C
// 0x0018 (0x02B8 - 0x02A0)
class ABP_Dangle_Master_C : public AFWBackpackRigFrame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Container;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Mantle_Checks;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          High_Quality_;                                     // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Buff_Applied_;                                     // 0x02B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void check_mantle_again();
	void Check_Mantle_Fix();
	void ExecuteUbergraph_BP_Dangle_Master(int32 EntryPoint);
	void IgnorePlayers(class AFWGamePlayerCharacter* Player);
	void MantleFix();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Dangle_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Dangle_Master_C")
	}
	static class ABP_Dangle_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dangle_Master_C>();
	}
};

}

