#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DroppedContainer

#include "Basic.hpp"

#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_LootContainer_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DroppedContainer.BP_DroppedContainer_C
// 0x0078 (0x0608 - 0x0590)
class ABP_DroppedContainer_C final : public ABP_LootContainer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DroppedContainer_C;              // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Loot_DropLogic_C*                  BPC_Loot_DropLogic;                                // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Location;                                   // 0x05A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x05B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CheckContents;                                     // 0x05D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x05D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttemptsToGetPlayer;                               // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             LocalPlayer;                                       // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Visible_Distance;                                  // 0x05E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreLootLifespan;                                   // 0x05F0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x05F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ActorsToIgore_FindGround();
	void CanFitItem(const struct FInventoryItemDetails& ItemDetails, int32 StackCount, ECanFit* ItemFits);
	void CLIENTS_Destroy_Marker();
	void ContainerOpenStatusChanged(class AFWGamePlayerCharacter* Player);
	void ExecuteUbergraph_BP_DroppedContainer(int32 EntryPoint);
	void IgnoreItems(TArray<class AActor*>* IgnoreActors);
	void MonitorLootMarker();
	void NukeTheLid();
	void ReceiveBeginPlay();
	void SERVER_Destroy_Marker();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DroppedContainer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DroppedContainer_C")
	}
	static class ABP_DroppedContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DroppedContainer_C>();
	}
};

}

