#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EQS_NotVisibleToPlayer_PlayerInv

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EQS_NotVisibleToPlayer_PlayerInv.BP_EQS_NotVisibleToPlayer_PlayerInv_C.ProvideActorsSet
// 0x0130 (0x0130 - 0x0000)
struct BP_EQS_NotVisibleToPlayer_PlayerInv_C_ProvideActorsSet final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ResultingActorsSet;                                // 0x0010(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         Actor_Set;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASInventoryContainer*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	TArray<class ANiagaraActor*>                  CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0058(0x0010)(ReferenceParm)
	TArray<class ADangly*>                        CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0068(0x0010)(ReferenceParm)
	TArray<class ABP_Dangle_Master_C*>            CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0078(0x0010)(ReferenceParm)
	TArray<class ABP_BasePlayerContainer_C*>      CallFunc_GetAllActorsOfClass_OutActors_4;          // 0x0088(0x0010)(ReferenceParm)
	TArray<class AFWShotgun*>                     CallFunc_GetAllActorsOfClass_OutActors_5;          // 0x0098(0x0010)(ReferenceParm)
	TArray<class AFWPistol*>                      CallFunc_GetAllActorsOfClass_OutActors_6;          // 0x00A8(0x0010)(ReferenceParm)
	TArray<class AFWAIMechWeapon*>                CallFunc_GetAllActorsOfClass_OutActors_7;          // 0x00B8(0x0010)(ReferenceParm)
	TArray<class AFWWeaponBase*>                  CallFunc_GetAllActorsOfClass_OutActors_8;          // 0x00C8(0x0010)(ReferenceParm)
	TArray<class AFWAIMechCharacter*>             CallFunc_GetAllActorsOfClass_OutActors_9;          // 0x00D8(0x0010)(ReferenceParm)
	TArray<class AFWVehicle*>                     CallFunc_GetAllActorsOfClass_OutActors_10;         // 0x00E8(0x0010)(ReferenceParm)
	TArray<class AFWGameAICharacter*>             CallFunc_GetAllActorsOfClass_OutActors_11;         // 0x00F8(0x0010)(ReferenceParm)
	TArray<class AFWRook*>                        CallFunc_GetAllActorsOfClass_OutActors_12;         // 0x0108(0x0010)(ReferenceParm)
	TArray<class AFWGamePlayerCharacter*>         CallFunc_GetAllActorsOfClass_OutActors_13;         // 0x0118(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

