#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Encounter_Root

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EvolveScenario_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Encounter_Root.BP_Encounter_Root_C
// 0x0020 (0x03D0 - 0x03B0)
class ABP_Encounter_Root_C : public AScenarioEncounter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Encounter_NotInVision_C*           BPC_Encounter_NotInVision;                         // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          I_Have_Spawned;                                    // 0x03C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Number_of_Spawners;                                // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Spawn_Count;                                       // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Encounter_Root(int32 EntryPoint);
	void Init_BPC_Encounter_NotInVision();
	void ReceiveBeginPlay();
	void Spawned(class UFWAISpawnerComponent* SpawnerComponent, class APawn* AIPawn);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Encounter_Root_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Encounter_Root_C")
	}
	static class ABP_Encounter_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Encounter_Root_C>();
	}
};

}

