#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Emissive_FillLight_Plane

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Emissive_FillLight_Plane.BP_Emissive_FillLight_Plane_C
// 0x0048 (0x02D8 - 0x0290)
class ABP_Emissive_FillLight_Plane_C final : public AActor
{
public:
	class UStaticMeshComponent*                   EmissiveShape;                                     // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x02A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Emissive_Color;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Emissive_Intensity;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fade_Distance;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Emissive_FillLight_Plane_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Emissive_FillLight_Plane_C")
	}
	static class ABP_Emissive_FillLight_Plane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Emissive_FillLight_Plane_C>();
	}
};

}

