#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.ExecuteUbergraph_BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_ExecuteUbergraph_BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNpcSpawnerBaseComponent*               K2Node_Event_spawner;                              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_npcPawn;                              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.OnBlendOut_77FCDDBC4A84583CDA78A6AA1C83497F
// 0x0008 (0x0008 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_OnBlendOut_77FCDDBC4A84583CDA78A6AA1C83497F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.OnCompleted_77FCDDBC4A84583CDA78A6AA1C83497F
// 0x0008 (0x0008 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_OnCompleted_77FCDDBC4A84583CDA78A6AA1C83497F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.OnInterrupted_77FCDDBC4A84583CDA78A6AA1C83497F
// 0x0008 (0x0008 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_OnInterrupted_77FCDDBC4A84583CDA78A6AA1C83497F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.OnNotifyBegin_77FCDDBC4A84583CDA78A6AA1C83497F
// 0x0008 (0x0008 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_OnNotifyBegin_77FCDDBC4A84583CDA78A6AA1C83497F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.OnNotifyEnd_77FCDDBC4A84583CDA78A6AA1C83497F
// 0x0008 (0x0008 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_OnNotifyEnd_77FCDDBC4A84583CDA78A6AA1C83497F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal.BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C.OnPawnSequenceEndedOnCollision
// 0x0010 (0x0010 - 0x0000)
struct BP_Enc_Reinforcement_Seq_Dropoff_EURASIA_Opal_C_OnPawnSequenceEndedOnCollision final
{
public:
	class UNpcSpawnerBaseComponent*               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  npcPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

