#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameStateDemo

#include "Basic.hpp"

#include "E_ServerMigration_structs.hpp"
#include "S_PlayerBanList_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_DirectionInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "ForeverWinter_classes.hpp"
#include "E_LobbyTypes_structs.hpp"
#include "E_SquadPermissions_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameStateDemo.BP_GameStateDemo_C
// 0x0198 (0x06A0 - 0x0508)
class ABP_GameStateDemo_C final : public AFWGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         NumOfPlayersAlive;                                 // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CompassAndMarkers_C*                CompassReference;                                  // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_DirectionInfo>          DirectionsOnCompass;                               // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumericDirectionMultiplier;                        // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_DirectionInfo>          NumericDirections;                                 // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   PlayerCompassMarkerTag;                            // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Quest_Data;                                        // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQuestProfile>                  Quest_Profiles;                                    // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Use_Random_Quest_Profiles_;                        // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTable*>                     Random_Quest_Data;                                 // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQuestProfile>                  ScenarioStressTest2_Quests;                        // 0x0588(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FQuestProfile>                  ScenarioStressTest2_Optional_Quests;               // 0x0598(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnPlayerJoined;                                    // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         DeadPawns;                                         // 0x05B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LivingPawns;                                       // 0x05BC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_Quest_Enable_;                            // 0x05C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEvent                           Damage_event;                                      // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumPlayersExtracted;                               // 0x05D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   All_Players_States;                                // 0x05E0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	class UObject*                                UserBanList;                                       // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Local_Save_File_Slot;                              // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_PlayerBanList_C*                    SaveObject;                                        // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_PlayerBanList                       Ban_List;                                          // 0x0610(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Auth_Token;                                        // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SetUpPlayerCompass;                                // 0x0660(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PlayerBase_C*>               AllPlayers;                                        // 0x0668(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	class UWBP_Quests_C*                          QuestWidget;                                       // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_QuestMarker_C*>              PlayerMarkers;                                     // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void(const struct FGameplayTag& CharacterTag)> OnSpawnCharacter;        // 0x0690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AbandonSession();
	void AddCompass();
	void AddCompassMarker(class FName MarkerName, class UTexture2D* Texture, const struct FLinearColor& Color, class AActor* MarkerTarget);
	void AddPlayersToCompass();
	void BlockPlayerID(int32 PlayerId);
	void CLIENTS_RPC__Server_Used_Tunnel_Save();
	void CLIENTS_Scenario_Replication(class FName Scenario_Name, class ABP_ScenarioSpawner_C* Scenario_Object);
	void CreateLobby(E_ServerMigration ServerType);
	void DisbandSquad();
	void ExecuteUbergraph_BP_GameStateDemo(int32 EntryPoint);
	void FindLobby();
	void FindNewHost__Join();
	void GetAllPlayerStates(TArray<class APlayerState*>* PlayerStates);
	void HostStartMission();
	void Inform_Instance_Level_Info(const class FString& Level, bool Using_Tunnel_Save_);
	void InitPlayFab();
	void IsAnyServerSelected(bool* Result);
	void JoinSelectedSession();
	void MulticastOnPlayerJoined();
	void MulticastPlayerExtracted();
	void MulticastRemoveMarker(class FName TargetMarkerTag);
	void MulticastRemovePlayerCompassMarker(const class FString& PlayerName);
	void MulticastUpdatePlayerDownedMarkers(const class FString& PlayerName, int32 PlayerNumber, bool bIsDowned);
	void OnPlayerStateRemoved_Event(const class FString& PlayerName, const bool bIsHost);
	void OnRep_SetUpPlayerCompass();
	void PromoteToHost(int32 PlayerIndex);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RefreshServerList();
	void RemoveCompassMarker(class FName MarkerName);
	void RemoveMarker(class FName TargetMarkerTag);
	void RemovePlayerCompassMarker(const class FString& PlayerName);
	void RemovePlayerMarker(class FName CharacterObjectName);
	void SERVER_RPC__Server_Used_Tunnel_Save();
	void SERVER_Scenario_Replication(class FName Scenario_Name, class ABP_ScenarioSpawner_C* Scenario_Object);
	void Server_Used_Tunnel_Save();
	void ServerAddPlayersToCompass();
	void ServerBlockedPlayer(int32 Player_ID);
	void ServerKickedPlayer(int32 PlayerId);
	void ServerOnPlayerJoined();
	void ServerPlayerExtracted();
	void ServerRemoveMarker(class FName TargetMarkerTag);
	void ServerUpdatePlayerDownedMarkers(class APlayerState* PlayerState, bool bIsDowned);
	void SetLobbyInviteType(E_SquadPermissions SquadPermission);
	void SetLobbySearchType(E_LobbyTypes LobbyType);
	void ShowHideWidget(ESlateVisibility InVisibility);
	void SpawnCharacterEvent(const struct FGameplayTag& CharacterTag);
	void UpdatePlayerDownedMarkers(const class FString& PlayerName, int32 PlayerNumber, bool bIsDowned);
	void UpdatePlayerList();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GameStateDemo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GameStateDemo_C")
	}
	static class ABP_GameStateDemo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameStateDemo_C>();
	}
};

}

