#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HubWorldManager

#include "Basic.hpp"

#include "STRUCT_TugOfWar_Keys_structs.hpp"
#include "FWPersistence_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_TOWTableRows_structs.hpp"
#include "Struct_HideShowViaWater_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "FWHubWorld_classes.hpp"
#include "FWAICore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HubWorldManager.BP_HubWorldManager_C
// 0x0330 (0x05D0 - 0x02A0)
class ABP_HubWorldManager_C final : public AHubWorldManagerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_OctoManager_C*                     BPC_OctoManager;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_BartenderManager_C*                BPC_BartenderManager;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_TugOfWar_C*                        BPC_TugOfWar;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_BuncoQuestManager_C*               BPC_BuncoQuestManager;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_SideQuestManager_C*                BPC_SideQuestManager;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Usable_C*>                   Usables;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Vendor_Widget_Already_Owned;                       // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Vendor_C*                            Vendor_Widget;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   WesternWeaponVendorTag;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVendorTag;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MedVendorTag;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Weapons;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_PlayerBase_C*>               BP_Player_Pawn_WIP_Players;                        // 0x0320(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerStart*>                   Player_Start_Points;                               // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ATriggerBox*>                    Teleport_Trigger_Regions;                          // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Interrupt_Pray;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFWQuest*>                       AllQuests;                                         // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Instructions_01;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Instructions_02;                                   // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   EasternWeaponVendorTag;                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Usable_Location_Multi;                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Water;                                     // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Water_Level_Retry;                                 // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FStruct_HideShowViaWater> ShowElementsMap;                              // 0x03A0(0x0050)(Edit, BlueprintVisible)
	struct FTimerHandle                           Upgrade_Check;                                     // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FStruct_HideShowViaWater> HideElementsMap;                              // 0x03F8(0x0050)(Edit, BlueprintVisible)
	class UDataTable*                             HubItemWaterLevelTable;                            // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             HubItemRequiredUpgradesTable;                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           UnlockedShowActors;                                // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         WaitForPingStabilityDuration;                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PingMillisecondWarningThreshold;                   // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_ThunderDome;                                    // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Pray_User;                                         // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Pray_Response_Time;                                // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrayWater;                                         // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Should_Unlock_Pray_;                               // 0x048C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Percent_Chance_BEST_Pray_Result;                   // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent_Chance_GOOD_Pray_Result;                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent_Chance_NEUTRAL_Pray_Result;                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent_Chance_BAD_Pray_Result;                    // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent_Chance_WORST_Pray_Result;                  // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pray_Attempt_Count;                                // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Current_Prayer_Roll;                               // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELastMissionResult                            LastMissionResults;                                // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Items_to_remove_if_in_Demo;                        // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class FName>                           UnlockedHideActors;                                // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AFWAISpawner*>                   Activated_Spawners;                                // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class FName, struct FStruct_HideShowViaWater> Small__Med__Large_Water_Tanks;                // 0x0500(0x0050)(Edit, BlueprintVisible)
	bool                                          Has_tank_upgrade_1;                                // 0x0550(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Tank_Upgrade_2;                                // 0x0551(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552[0x6];                                      // 0x0552(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WaterVaultLocTimer;                                // 0x0558(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           Water_Vault_Usable;                                // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Ignore_these_for_vision_check;                     // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ATargetPoint*                           Water_Vault_Viz_Target_Point;                      // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FSTRUCT_TugOfWar_Keys& Active_Tug_of_War_Markers, const struct FSTRUCT_TOWTableRows& Returned_Rows)> Get_Active_Tug_of_War_Markers; // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class ABP_Usable_C*>                   ExpoDump_Usables;                                  // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TSubclassOf<class UDialogueWidget>            ExpoDump_Dialogue;                                 // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTimerHandle                           Suspend_Usable_Timer;                              // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Cinema_Playing;                                    // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Skin_Cinema_Timer;                                 // 0x05B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Skin_Cinema_Standby_On;                            // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerSaveGames_C*                 PlayerSaveComponent;                               // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Add_unique_quests();
	void Adjust_Pray_Chances();
	void AtomicLootFilter();
	void Audio_ClientOnly();
	void Base_MusicState();
	void Cancelled_03619860477AED7C6D0A6EB651966E62(class UFWPopupWidget* NewPopUp);
	void Cancelled_FFE50395438E398A2254FE9EEE5D60DC(class UFWPopupWidget* NewPopUp);
	void Confirmed_03619860477AED7C6D0A6EB651966E62(class UFWPopupWidget* NewPopUp);
	void Confirmed_FFE50395438E398A2254FE9EEE5D60DC(class UFWPopupWidget* NewPopUp);
	void Created_03619860477AED7C6D0A6EB651966E62(class UFWPopupWidget* NewPopUp);
	void Created_FFE50395438E398A2254FE9EEE5D60DC(class UFWPopupWidget* NewPopUp);
	void _Destroy_this_AI(class AFWAISpawner* Spawner);
	void EasterEgg_MusicState();
	void Eval_Player_Menu_Use();
	void Eval_Usable(class AActor* User, class AActor* Usable, bool* Function_Found_a_Valid_Usable);
	void Evaluate_Water_Level(int32 Current_HUB_Water, class FName _Hide, bool* Enough_Water_);
	void ExecuteUbergraph_BP_HubWorldManager(int32 EntryPoint);
	void ExpoDump_Closed(class UDialogueWidget* Widget_that_Closed);
	void ExpoDump_Was_Used(class AActor* Player_That_Used_Me, class AActor* Usable);
	void ExpoDumpBinding();
	void FindActorsToShow(TArray<class FName>* ActorGroupsToShow);
	void GetPlayerSaves(class UBPC_PlayerSaveGames_C** SavesComponent);
	void GiveHUBFTUETag();
	void Handle_Demo();
	void Handle_Water_Fight_Result();
	void _Show_Due_to_Water(TArray<class AActor*>& Actors_to_Hide, bool Show_, bool Toggle_Collision_);
	void Hide_Show_Usable_Locations(bool Hide_);
	void HideAllActors();
	void HubActorsToShowChanged();
	void IdentifyWaterVaultUsable();
	void Invulnerable_Players();
	void Is_skin_intro_playing_(bool* Sequence_Playing_);
	void Is_SPECIFIC_PLAYER_skin_intro_playing_(class AActor* Player, bool* Sequence_Playing_);
	void IsMenuActive();
	void Lift_Management();
	void Make_Friends_Another_Attempt();
	void Make_Ignore_List();
	void Manage_Water_Tanks();
	void MarkWaterVaultUsable();
	void OnFailed_D1DA77EF48C0BA52F3E6DC8C9A6732B7(class APawn* SpawnedAI, EFWAISpawnResultCode ResultCode);
	void OnSpawned_D1DA77EF48C0BA52F3E6DC8C9A6732B7(class APawn* SpawnedAI, EFWAISpawnResultCode ResultCode);
	void Player_entered_terleport_region(class AActor* OverlappedActor, class AActor* OtherActor);
	void PlayerJoined();
	void PlayerJoined_ManageNPCCollision();
	void PlayerJoined_ManagePlayers();
	void Pray_go_bad();
	void Pray_Go_Best();
	void Pray_go_Good();
	void Pray_go_Neutral();
	void Pray_go_Worst();
	void Pray_Mod_Water(int32 Water_Amount);
	void Ready_640536384833A5058BCC1290507264D4(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Ready_6E9307A646ABEBAF4C7D9B9D530507F7(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveBeginPlay();
	void Remove_Training_Mission_Quests();
	void Retry_Water_Level();
	void Show_All_Actors();
	void ShowHideActors__HIDE_Function(const TArray<class FName>& SetsToHide);
	void ShowHideActors__SHOW_Function(const TArray<class FName>& SetsToShow);
	void ShowPlayerUpgrades(TArray<class FName>* ActorGroupsToShow);
	void ShowQuestUpgrades(TArray<class FName>* ActorGroupsToShow);
	void ShowWaterLevelMeshes(TArray<class FName>* ActorGroupsToShow);
	void ShowWaterRaidResults();
	void Skin_Cinema_Playing_();
	void Spawn_this_AI(class AFWAISpawner* Spawner);
	void Suspend_usable_display();
	void UI_MusicState();
	void Unlock_Pray();
	void Used(class AActor* Player_That_Used_Me, class AActor* Usable);
	void Vendor(class FName Vendor_Tag, class AActor* Player_Using, class AActor* Vendor_Switch);
	void Water_Ticker();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HubWorldManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HubWorldManager_C")
	}
	static class ABP_HubWorldManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HubWorldManager_C>();
	}
};

}

