#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootContainer_QuestObj

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "BP_RandomLootContainer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LootContainer_QuestObj.BP_LootContainer_QuestObj_C
// 0x0048 (0x05F8 - 0x05B0)
class ABP_LootContainer_QuestObj_C final : public ABP_RandomLootContainer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LootContainer_QuestObj_C;        // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CompassMarkerComponent_C*           BP_QuestDataComponent;                             // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x05C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetName;                                        // 0x05C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveTag;                                      // 0x05CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Visible_Distance;                                  // 0x05D4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuestTaskRequirement>      Quest_Task_02_Requirement;                         // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FQuestProfile>                  Quest_Profiles;                                    // 0x05E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         VisibilityDistance;                                // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ContainerOpenStatusChanged(class AFWGamePlayerCharacter* Player);
	void ExecuteUbergraph_BP_LootContainer_QuestObj(int32 EntryPoint);
	void ExternalComplete();
	void OnRep_PickedUp();
	void OnRep_Visible_Distance();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LootContainer_QuestObj_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LootContainer_QuestObj_C")
	}
	static class ABP_LootContainer_QuestObj_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LootContainer_QuestObj_C>();
	}
};

}

