#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootContainer_QuestObj

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LootContainer_QuestObj.BP_LootContainer_QuestObj_C.ContainerOpenStatusChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_LootContainer_QuestObj_C_ContainerOpenStatusChanged final
{
public:
	class AFWGamePlayerCharacter*                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_LootContainer_QuestObj.BP_LootContainer_QuestObj_C.ExecuteUbergraph_BP_LootContainer_QuestObj
// 0x0010 (0x0010 - 0x0000)
struct BP_LootContainer_QuestObj_C_ExecuteUbergraph_BP_LootContainer_QuestObj final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWGamePlayerCharacter*                 K2Node_Event_Player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

