#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootContainer_Drill_Codex_ROOT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_LootContainer_RandomBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LootContainer_Drill_Codex_ROOT.BP_LootContainer_Drill_Codex_ROOT_C
// 0x0038 (0x0640 - 0x0608)
class ABP_LootContainer_Drill_Codex_ROOT_C final : public ABP_LootContainer_RandomBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LootContainer_Drill_Codex_ROOT_C; // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor;                                        // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWConsumableTriggerArea*               FWConsumableTriggerArea;                           // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_Lid_2;                                  // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CodexRoot_DrillNoiseTimer;                         // 0x0630(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CodexRoot_Player_Close_Timer;                      // 0x0638(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_LootContainerDrillTest_FWConsumableTriggerArea_K2Node_ComponentBoundEvent_0_TriggerAreaActorSpawnedDelegate__DelegateSignature(class AActor* Actor);
	void CodexRoot_Cleanup_Children();
	void CodexRoot_MakeAINoise();
	void CodexRoot_Overlapping_Instigator(bool* Found_place_, struct FVector* The_Found_Place);
	void CodexRoot_PlayerNear();
	void ExecuteUbergraph_BP_LootContainer_Drill_Codex_ROOT(int32 EntryPoint);
	void LerpTheLid();
	void OnRep_ContainerUnlocked();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LootContainer_Drill_Codex_ROOT_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LootContainer_Drill_Codex_ROOT_C")
	}
	static class ABP_LootContainer_Drill_Codex_ROOT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LootContainer_Drill_Codex_ROOT_C>();
	}
};

}

