#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootContainer

#include "Basic.hpp"

#include "S_LootContainerMesh_structs.hpp"
#include "Engine_structs.hpp"
#include "SearchedItems_structs.hpp"
#include "E_OwnerFaction_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LootContainer.BP_LootContainer_C
// 0x0110 (0x0590 - 0x0480)
class ABP_LootContainer_C : public ASInventoryContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWLootableComponent*                   FWLootable;                                        // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_Lid;                                    // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSearchedItems>                 SearchedItems;                                     // 0x04B0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	double                                        LootTimer;                                         // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                LootTimes;                                         // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          StartLootable;                                     // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LootContainerMesh                   LootContainerMesh;                                 // 0x04E0(0x0018)(Edit, BlueprintVisible, Net, RepNotify, ExposeOnSpawn, HasGetValueTypeHash)
	E_OwnerFaction                                Faction;                                           // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpeningContainerMakeFoe_;                          // 0x04F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            Default_Scene_Root_Mobility;                       // 0x04FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LidOpen;                                           // 0x04FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LidLerpTimer;                                      // 0x0500(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Lid_1_Value;                                       // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Number_of_times_opened, class AActor* Container_opened)> ContainerOpenedDispatch; // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Times_Opened;                                      // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Lid_1_Open_Value;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lid_1_Closed_Value;                                // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lid_2_Value;                                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lid_2_Open_Value;                                  // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lid_2_Closed_Value;                                // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroy_on_Level_Unload_;                          // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Current_Level;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Destroy_on_level_unloaded_timer;                   // 0x0560(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_LootBoxOpen_SC;                                 // 0x0568(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ContainerOpenStatusChanged(class AFWGamePlayerCharacter* Player);
	void ChangeLidStatus();
	void ApplyMesh();
	void OnRep_LootContainerMesh();
	void EnableLooting(bool Enabled);
	void SoftRemoveItem(int32 ItemIndex);
	float GetLootTimer(class AFWGamePlayerCharacter* Player);
	void OrganiseLoot(class AFWGamePlayerCharacter*& Player);
	void UpdatedSearchedItems(class AFWGamePlayerCharacter*& Player);
	void GetSearchedItems(const class AFWGamePlayerCharacter* Player, TArray<struct FContainerItem>* Items);
	void GetItemsToSearch(const class AFWGamePlayerCharacter* Player, TArray<struct FContainerItem>* Items);
	void OnLoaded_D2881346422418E05804B2972AC1CCEF(class UObject* Loaded);
	void SFX_Open();
	void SFX_Open_Server();
	void SFX_Open_Multicast();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void RemoveItem(int32 ItemIndex, bool Param_EnableLooting_0);
	void ReceiveDestroyed();
	void LerpTheLid();
	void OnRep_ContainerOpened();
	void Setup_Destroy_on_Level_Unloaded();
	void Detect_Level();
	void ExecuteUbergraph_BP_LootContainer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LootContainer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LootContainer_C")
	}
	static class ABP_LootContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LootContainer_C>();
	}
};

}

