#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Map_CollisionCheck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Map_CollisionCheck.BP_Map_CollisionCheck_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_Map_CollisionCheck_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_MarkPlayers_HunterKillers_C*       BPC_MarkPlayers_HunterKillers;                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Clear_LOS_Timer;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Clear_Niagara_Timer;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_LOS_Channels();
	void Clear_Niagara_LOS_Channels();
	void ExecuteUbergraph_BP_Map_CollisionCheck(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Map_CollisionCheck_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Map_CollisionCheck_C")
	}
	static class ABP_Map_CollisionCheck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Map_CollisionCheck_C>();
	}
};

}

