#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainTurret_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileMaster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainTurret_Projectile.BP_MainTurret_Projectile_C
// 0x0028 (0x0398 - 0x0370)
class ABP_MainTurret_Projectile_C final : public ABP_ProjectileMaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MainTurret_Projectile_C;         // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Tracer;                                         // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NFire_Exp_01;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RandomDamageRoot;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RandomDamageRNG_;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MainTurret_Projectile(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void Set_RNG_Damage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MainTurret_Projectile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MainTurret_Projectile_C")
	}
	static class ABP_MainTurret_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MainTurret_Projectile_C>();
	}
};

}

