#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MusicManager_HubWorld_Parent

#include "Basic.hpp"

#include "FWPersistence_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MusicManager_HubWorld_Parent.BP_MusicManager_HubWorld_Parent_C
// 0x0098 (0x0328 - 0x0290)
class ABP_MusicManager_HubWorld_Parent_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Music_HubWorld;                                 // 0x02A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        MS_Music_HubWorld;                                 // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Music_ThunderDome;                              // 0x02D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   Sucess;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Open;                                              // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UI;                                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EasterEgg;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MusicSelection;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EasterEgg_;                                        // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IntroLevel_;                                       // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Thunderdome_;                                      // 0x0322(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323[0x1];                                      // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Fade_in_Duration;                                  // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Base_MusicState();
	void BaseStateTrigeer();
	void CheckIfLoadingScreen();
	void EasterEgg_MusicState();
	void EasterEggTrigger();
	void ExecuteUbergraph_BP_MusicManager_HubWorld_Parent(int32 EntryPoint);
	void FadeInMusic();
	void FadeOutHubMusic(float FadeOutDuration);
	void NewFunction();
	void OnLoaded_5931FE0A40ED41F490847DAD57E8D2D1(class UObject* Loaded);
	void OnLoaded_8D9AB05A477643777F7E3E83736AA1D0(class UObject* Loaded);
	void ReceiveBeginPlay();
	void SelectBaseMusic();
	void StartHubMusic();
	void StartMusic();
	void UI_MusicState();
	void UITrigger();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MusicManager_HubWorld_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MusicManager_HubWorld_Parent_C")
	}
	static class ABP_MusicManager_HubWorld_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MusicManager_HubWorld_Parent_C>();
	}
};

}

