#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoiseMakerLogic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoiseMakerLogic.BP_NoiseMakerLogic_C
// 0x0040 (0x0ED0 - 0x0E90)
class ABP_NoiseMakerLogic_C final : public AFWGameAICharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWAIAwarenessComponent_NPC*            FWAIAwarenessComponent_NPC;                        // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAISenseComponent*                    FWAISense;                                         // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWAIFactionComponent*                  FWAIFaction;                                       // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Ping_Timer;                                        // 0x0EB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPC_Explosion_Grenade_C*               BPC;                                               // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Explosion_Object;                                  // 0x0EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Pings;                                             // 0x0EC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Anyone_attacking_me_(bool* Somone_Is_attacking_me_);
	void ExecuteUbergraph_BP_NoiseMakerLogic(int32 EntryPoint);
	void Ping();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Time_to_Die();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoiseMakerLogic_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoiseMakerLogic_C")
	}
	static class ABP_NoiseMakerLogic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NoiseMakerLogic_C>();
	}
};

}

