#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PCG_Trash_Mound

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PCG_Trash_Mound.BP_PCG_Trash_Mound_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_PCG_Trash_Mound_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_PCG_Primitive_Mound_01;                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPCGComponent*                          PCG;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        TrashBagDensity;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SmallTrashDensity;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VoxelSize;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrateDensity;                                      // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PCG_Trash_Mound_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PCG_Trash_Mound_C")
	}
	static class ABP_PCG_Trash_Mound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PCG_Trash_Mound_C>();
	}
};

}

