#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayFab_Instance

#include "Basic.hpp"

#include "E_LobbyTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUser_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_ServerMigration_structs.hpp"
#include "FWPersistence_structs.hpp"
#include "E_SquadPermissions_structs.hpp"
#include "FWOnlineServices_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Completed_03C81CD44396AE3960822C93D7A3AB33
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayFab_Instance_C_Completed_03C81CD44396AE3960822C93D7A3AB33 final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Completed_2BB700D941D9238368C3D28B71B669E8
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayFab_Instance_C_Completed_2BB700D941D9238368C3D28B71B669E8 final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Completed_6AE36D3848F87052938174B4CB3A1403
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayFab_Instance_C_Completed_6AE36D3848F87052938174B4CB3A1403 final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Completed_72C0F0E849C6F2F63656C1ADA190B00A
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayFab_Instance_C_Completed_72C0F0E849C6F2F63656C1ADA190B00A final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Completed_FA692C4644AA725ADDFAD1B8A327E27C
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayFab_Instance_C_Completed_FA692C4644AA725ADDFAD1B8A327E27C final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.CreateLobby
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayFab_Instance_C_CreateLobby final
{
public:
	E_ServerMigration                             ServerType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Execute Save Fixups
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayFab_Instance_C_Execute_Save_Fixups final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSeenGameplayElement_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerUpgrade_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.ExecuteUbergraph_BP_PlayFab_Instance
// 0x0478 (0x0478 - 0x0000)
struct BP_PlayFab_Instance_C_ExecuteUbergraph_BP_PlayFab_Instance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFWSessionMapDataChangeEnvelope        Temp_struct_Variable_1;                            // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFWSessionMapDataChangeEnvelope        Temp_struct_Variable_2;                            // 0x0058(0x0010)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPartySubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFWPartySubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyLeader_ReturnValue;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate_1; // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result_5;                       // 0x00B0(0x0028)(ConstParm)
	struct FOnlineResultInformation               Temp_struct_Variable_4;                            // 0x00D8(0x0028)()
	class UFWAsync_LeaveParty*                    CallFunc_LeaveOnlineParty_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate_2; // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result_4;                       // 0x0120(0x0028)(ConstParm)
	struct FOnlineResultInformation               Temp_struct_Variable_5;                            // 0x0148(0x0028)()
	class UFWAsync_LeaveParty*                    CallFunc_LeaveOnlineParty_ReturnValue_1;           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate_3; // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result_3;                       // 0x0190(0x0028)(ConstParm)
	struct FOnlineResultInformation               Temp_struct_Variable_6;                            // 0x01B8(0x0028)()
	class UFWAsync_LeaveParty*                    CallFunc_LeaveOnlineParty_ReturnValue_2;           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPartySubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInParty_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate_4; // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result_2;                       // 0x0210(0x0028)(ConstParm)
	struct FOnlineResultInformation               Temp_struct_Variable_7;                            // 0x0238(0x0028)()
	class UFWAsync_CreateParty*                   CallFunc_CreateOnlineParty_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_DataLoadError_C*                     CallFunc_Create_ReturnValue;                       // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFWPersistenceSubsystem*                K2Node_CustomEvent_Subsystem;                      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     K2Node_CustomEvent_Result_1;                       // 0x02A0(0x0018)(ConstParm)
	struct FPersistenceResult                     Temp_struct_Variable_8;                            // 0x02B8(0x0018)()
	class UFWPersistenceSubsystem*                Temp_object_Variable_2;                            // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFWAsync_WaitForDatastoreReady*         CallFunc_WaitForDatastoreToBeReady_ReturnValue;    // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate_7; // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result;                         // 0x02F8(0x0028)(ConstParm)
	struct FOnlineResultInformation               Temp_struct_Variable_9;                            // 0x0320(0x0028)()
	class UFWAsync_LeaveParty*                    CallFunc_LeaveOnlineParty_ReturnValue_3;           // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ServerMigration                             K2Node_Event_ServerType;                           // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFWPersistenceSubsystem* Subsystem)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0354(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAsync_WaitForDatastoreReady*         CallFunc_WaitForDatastoreToBeReady_ReturnValue_1;  // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFWPersistenceSubsystem*                Temp_object_Variable_3;                            // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFWSessionJoinPermissionChangeEnvelope Temp_struct_Variable_10;                           // 0x0379(0x0001)(NoDestructor)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPersistenceResult                     Temp_struct_Variable_11;                           // 0x0380(0x0018)()
	E_SquadPermissions                            K2Node_Event_SquadPermission;                      // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LobbyTypes                                  K2Node_Event_LobbyType;                            // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerIndex;                          // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Player_ID;                            // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPersistenceSubsystem*                K2Node_CustomEvent_Subsystem_2;                    // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     K2Node_CustomEvent_Result_7;                       // 0x03B0(0x0018)(ConstParm)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x03D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)> K2Node_CreateDelegate_OutputDelegate_9; // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_10; // 0x03E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFWSessionJoinPermissionChangeEnvelope Temp_struct_Variable_12;                           // 0x03F8(0x0001)(NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAsync_WaitForDatastoreReady*         CallFunc_WaitForDatastoreToBeReady_ReturnValue_2;  // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPersistenceSubsystem*                Temp_object_Variable_4;                            // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     Temp_struct_Variable_13;                           // 0x0418(0x0018)()
	class FName                                   CallFunc_GetSelectedMap_ReturnValue;               // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectedSpawn_ReturnValue;             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetGameJoinPermission_ReturnValue;        // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPersistenceSubsystem*                K2Node_CustomEvent_Subsystem_1;                    // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     K2Node_CustomEvent_Result_6;                       // 0x0450(0x0018)(ConstParm)
	TDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)> K2Node_CreateDelegate_OutputDelegate_11; // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Inform Instance Level Info
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayFab_Instance_C_Inform_Instance_Level_Info final
{
public:
	class FString                                 Level;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Using_Tunnel_Save_;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.IsAnyServerSelected
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayFab_Instance_C_IsAnyServerSelected final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPartySubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFWLobbySearchResult*                   CallFunc_GetPartyToJoin_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.OnMessageReceived_192D104C4B8E21932FF6DDA8CDAC196C
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayFab_Instance_C_OnMessageReceived_192D104C4B8E21932FF6DDA8CDAC196C final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.OnMessageReceived_EF9E914A475CB9D8E362139D809D3016
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayFab_Instance_C_OnMessageReceived_EF9E914A475CB9D8E362139D809D3016 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.PromoteToHost
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayFab_Instance_C_PromoteToHost final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Ready_395697214730FFEC5FAED19855810BC7
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayFab_Instance_C_Ready_395697214730FFEC5FAED19855810BC7 final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     Result;                                            // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Ready_60D066494E18A06AD898FD82D7BB695D
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayFab_Instance_C_Ready_60D066494E18A06AD898FD82D7BB695D final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     Result;                                            // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Ready_9D8FC5D7438F1E9A54DFC290DF0A40B4
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayFab_Instance_C_Ready_9D8FC5D7438F1E9A54DFC290DF0A40B4 final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPersistenceResult                     Result;                                            // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.ServerBlockedPlayer
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayFab_Instance_C_ServerBlockedPlayer final
{
public:
	int32                                         Player_ID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.ServerKickedPlayer
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayFab_Instance_C_ServerKickedPlayer final
{
public:
	int32                                         PlayerId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Set Up Blank Save
// 0x0158 (0x0158 - 0x0000)
struct BP_PlayFab_Instance_C_Set_Up_Blank_Save final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LastCharacterTag;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        Last_Character_Ref;                                // 0x0010(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyType                          K2Node_MakeStruct_CurrencyType;                    // 0x0040(0x0030)(HasGetValueTypeHash)
	struct FCurrencyOperationResult               CallFunc_SetCurrencyAmount_ReturnValue;            // 0x0070(0x0048)()
	bool                                          CallFunc_SetSelectedCharacter_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FSoftObjectPath> CallFunc_GetAllPlayableCharacterDefinitions_ReturnValue; // 0x00C0(0x0050)()
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0110(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0124(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_Map_Find_Value;                           // 0x0130(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.SetLobbyInviteType
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayFab_Instance_C_SetLobbyInviteType final
{
public:
	E_SquadPermissions                            SquadPermission;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.SetLobbySearchType
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayFab_Instance_C_SetLobbySearchType final
{
public:
	E_LobbyTypes                                  LobbyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayFab_Instance.BP_PlayFab_Instance_C.Travel to Hub
// 0x0080 (0x0080 - 0x0000)
struct BP_PlayFab_Instance_C_Travel_to_Hub final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSessionHostHubTravelOptions_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetSelectedCharacterPawnDefinition_ReturnValue; // 0x0018(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHubWorldMap_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};

}

