#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Player_Shaman

#include "Basic.hpp"

#include "BP_PlayerBase_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Player_Shaman.BP_Player_Shaman_C
// 0x0070 (0x20E0 - 0x2070)
class ABP_Player_Shaman_C final : public ABP_PlayerBase_C
{
public:
	uint8                                         Pad_2061[0x7];                                     // 0x2061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Player_Shaman_C;                 // 0x2068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWSkinChangeComponent*                 FWSkinChangeComponent;                             // 0x2070(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shaman_OTSADS_Socket_Offset;                       // 0x2078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShamanCam;                                         // 0x2090(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 DLC_Shaman_Skin;                                   // 0x2098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                Shaman_OTS_Socket_Offset;                          // 0x20C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Shaman_Using_DLC_Skin_01;                          // 0x20D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Player_Gunhead_FWSkinChangeComponent_K2Node_ComponentBoundEvent_2_FWSkinChangedDelegate__DelegateSignature();
	void ExecuteUbergraph_BP_Player_Shaman(int32 EntryPoint);
	void Physics_Handler();
	void ReceiveBeginPlay();
	void ScanMasterEffect();
	void ShamanCamHandler();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Player_Shaman_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Player_Shaman_C")
	}
	static class ABP_Player_Shaman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Player_Shaman_C>();
	}
};

}

