#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayFab_Instance

#include "Basic.hpp"

#include "E_ServerMigration_structs.hpp"
#include "Engine_structs.hpp"
#include "FWSession_classes.hpp"
#include "E_SquadPermissions_structs.hpp"
#include "E_LobbyTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayFab_Instance.BP_PlayFab_Instance_C
// 0x0070 (0x03B8 - 0x0348)
class UBP_PlayFab_Instance_C : public UFWGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Stream_Level_Name;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LobbyLeveName;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MainLevelName;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Levels;                                            // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(const class FString& Error_Message)> On_Login_With_Backend_Erred;  // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const class FString& Player_ID, const class FString& Session_Ticket)> On_Login_With_Backend_Succeded; // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_Login_With_Backend_Requested;                   // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   MapID;                                             // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoginAttempts;                                     // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbandonSession();
	void Completed_03C81CD44396AE3960822C93D7A3AB33(const struct FOnlineResultInformation& Result);
	void Completed_2BB700D941D9238368C3D28B71B669E8(const struct FOnlineResultInformation& Result);
	void Completed_6AE36D3848F87052938174B4CB3A1403(const struct FOnlineResultInformation& Result);
	void Completed_72C0F0E849C6F2F63656C1ADA190B00A(const struct FOnlineResultInformation& Result);
	void Completed_FA692C4644AA725ADDFAD1B8A327E27C(const struct FOnlineResultInformation& Result);
	void CreateLobby(E_ServerMigration ServerType);
	void DisbandSquad();
	void Execute_Save_Fixups(class UFWPersistenceSubsystem* Subsystem);
	void ExecuteUbergraph_BP_PlayFab_Instance(int32 EntryPoint);
	void FindLobby();
	void FindNewHost__Join();
	void HostStartMission();
	void Inform_Instance_Level_Info(const class FString& Level, bool Using_Tunnel_Save_);
	void InitPlayFab();
	void IsAnyServerSelected(bool* Result);
	void JoinSelectedSession();
	void OnMessageReceived_192D104C4B8E21932FF6DDA8CDAC196C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EF9E914A475CB9D8E362139D809D3016(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnRetryLoad();
	void PromoteToHost(int32 PlayerIndex);
	void Ready_395697214730FFEC5FAED19855810BC7(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Ready_60D066494E18A06AD898FD82D7BB695D(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Ready_9D8FC5D7438F1E9A54DFC290DF0A40B4(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveInit();
	void ReceiveShutdown();
	void RefreshServerList();
	void ServerBlockedPlayer(int32 Player_ID);
	void ServerKickedPlayer(int32 PlayerId);
	void Set_Up_Blank_Save(class UFWPersistenceSubsystem* Subsystem);
	void SetLobbyInviteType(E_SquadPermissions SquadPermission);
	void SetLobbySearchType(E_LobbyTypes LobbyType);
	void Travel_to_Hub(class UFWPersistenceSubsystem* Subsystem);
	void UpdatePlayerList();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayFab_Instance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayFab_Instance_C")
	}
	static class UBP_PlayFab_Instance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayFab_Instance_C>();
	}
};

}

