#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerController

#include "Basic.hpp"

#include "E_ServerMigration_structs.hpp"
#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "ForeverWinter_classes.hpp"
#include "E_LobbyTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FWOnlineServices_structs.hpp"
#include "E_SquadPermissions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerController.BP_PlayerController_C
// 0x0198 (0x0BF0 - 0x0A58)
class ABP_PlayerController_C final : public AFWGamePlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_FOVLookSpeed_C*                    BPC_FOVLookSpeed;                                  // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Backend_Player_Id;                                 // 0x0A68(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Backend_Session_Ticket;                            // 0x0A78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Character_Data_Version;                            // 0x0A88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8C[0x4];                                      // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Character_Id;                                      // 0x0A90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	ECharacterClass                               Character_Class;                                   // 0x0AA0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Character_Type;                                    // 0x0AA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA2[0x6];                                      // 0x0AA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint8, ECharacterClass>                  Temp_Type_To_Class_Map;                            // 0x0AA8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SpeedDashVerbEnabled;                              // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF9[0x7];                                      // 0x0AF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed_Dash_Input_Delay;                            // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Speed_Dash_Button_Press_Count;                     // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Debug_Location;                                    // 0x0B0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_Player_Joined;                                 // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B14[0x4];                                      // 0x0B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MasterPlayerID;                                    // 0x0B18(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UW_Vendor_C*                            VendorWidget;                                      // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MenuMaster_C*                      MenuMaster;                                        // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Weapon_Trace;                                // 0x0B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B39[0x7];                                      // 0x0B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Debug_Weapon_Trace_Timer;                          // 0x0B40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Debug_Weapon_Trace_Color;                          // 0x0B48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CenterScreenDebugOn;                               // 0x0B58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TraceTimerHandle;                                  // 0x0B60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWGameAICharacter*                     TracingEnemy;                                      // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TraceTimer;                                        // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFWEnemyFactionData>            EnemiesData;                                       // 0x0B78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TraceDuration;                                     // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldCreateWidget;                               // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B91[0x7];                                      // 0x0B91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool ShouldCreateWidget)> ShouldCreateWidgetDispatch;              // 0x0B98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bDebugDamage;                                      // 0x0BA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA9[0x7];                                      // 0x0BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_C*                       PauseMenuWidget;                                   // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FOV_Look_Speed_Mod_Timer;                          // 0x0BB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWGamePlayerCharacter*                 Controlled_Pawn;                                   // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Base_Turn_Rate_Pitch;                              // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Base_Turn_Rate_Yaw;                                // 0x0BCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFWGameAICharacter*>             TracedEnemies;                                     // 0x0BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UUserWidget*                            Lift_Menu;                                         // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Used_Tunnel_Save_Extract;                          // 0x0BE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Server_Used_Tunnel_Save_Extract;                   // 0x0BE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Possession_Complete;                               // 0x0BEA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbandonSession();
	void ActivatePuzzleDeath(class AFWLockPuzzleLocation* Puzzle, class AFWCharacter* Victim);
	void AddAllyPlayerHUD();
	void AddLootToCompass(class FName RowName);
	void AddLootToTheCompass(class FName RowName);
	void BannedFromServer();
	void CLIENTS_Hack_Radar_Replicate();
	void ClientSetExtractionPoint(class FName SpawnPoint);
	void ClientShowMenu(int32 Index_0);
	void ClientUseExtractionCamera();
	void CreateLobby(E_ServerMigration ServerType);
	void DamageTaken();
	void DisbandSquad();
	void ExecuteUbergraph_BP_PlayerController(int32 EntryPoint);
	void Find_New_Host___Join();
	void FindLobby();
	void FindNewHost__Join();
	void GetApplyControllerFeedback(bool* FeedbackOn);
	void GetMainMenuMaster(class UUserWidget** MainMenu);
	struct FVector GetSpawnLocation(const struct FVector& PlayerStart);
	void Hack_Radar_Replicate();
	void Handle_Weapon_Trace();
	void HostStartMission();
	void HUBWORLD_Vendor(const struct FDataTableRowHandle& Vendor_Data);
	void Hud_Fade_On_(bool* Is_Using_HUD_fade_);
	void In_Shipping_(bool* Is_Shipping_);
	void Inform_Instance_Level_Info(const class FString& Level, bool Using_Tunnel_Save_);
	void InitPlayFab();
	void InpActEvt_Add_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Add_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_IA_Chat_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_QuitGame_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Talk_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Talk_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Talk_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_zDEBUG_DebugMenu_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Subtract_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Subtract_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void IsAnyServerSelected(bool* Result);
	void JoinSelectedSession();
	void KickedFromServer();
	void MulticastSetSpawnRotation(const struct FRotator& NewRotation);
	void OnFailure_0D9C95C64C8C6B9DB997E7AFE5887FC8();
	void OnFailure_185B00AF40AFA5AAC39C6AB576788DED();
	void OnFailure_2B8E01B841AB25941B986F963779E559();
	void OnFailure_4C0B96944631A1AE70376481C5CCE7A7();
	void OnRep_Character_Class();
	void OnSuccess_0D9C95C64C8C6B9DB997E7AFE5887FC8();
	void OnSuccess_185B00AF40AFA5AAC39C6AB576788DED();
	void OnSuccess_2B8E01B841AB25941B986F963779E559();
	void OnSuccess_4C0B96944631A1AE70376481C5CCE7A7();
	void Promote_To_Host();
	void PromoteToHost(int32 PlayerIndex);
	void ReceiveBeginPlay();
	void ReceivePossess(class APawn* PossessedPawn);
	void ReceiveTick(float DeltaSeconds);
	void RefreshServerList();
	void RemoveAllTheTrackedEnemy(const struct FGameplayTag& FactionTag);
	void RemoveAllTrackedEnemy(const struct FGameplayTag& FactionTag);
	void RemoveDeadTracedEnemies();
	void RemoveLootFromCompass(class FName RowName);
	void RemoveLootFromTheCompass(class FName RowName);
	void RemoveMenu(bool* bRemoved);
	void RemoveWidget();
	void RestartGame();
	void RestartPlayer();
	void RumbleOnHit(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void SERVER_Hack_Radar_Replicate();
	void Server_Restart_Game();
	void ServerAddAllyPlayerHUD();
	void ServerBlockedPlayer(int32 Player_ID);
	void ServerInstigatedDamage(float Damage, const class UDamageType* DamageType, class AActor* DamagedActor, class AActor* DamageCauser);
	void ServerKickedPlayer(int32 PlayerId);
	void ServerSetSpawnLocation();
	void Set_Extraction_Point_Check_For_Tunnels(bool* In_Tunnel_, struct FMapEntryData* Relevant_Map_Entry_Data, class FName* Row_Name);
	void Set_Spawn_Point_Tag_for_Tunnels(bool* In_Tunnel_, struct FMapEntryData* Relevant_Map_Entry_Data, class FName* Spawn_Point);
	void Set_up_hit_feedback();
	void SetExtractionPoint(class FName PointTag);
	void SetLobbyInviteType(E_SquadPermissions SquadPermission);
	void SetLobbySearchType(E_LobbyTypes LobbyType);
	void SetupInputMappings();
	void SetUpPlayerCompass();
	void SetupSpawnLocation();
	void ShouldCreateWidget(bool bShouldCreateWidget_0);
	void HideSquadManagementMenu();
	void ShowLiftMenu();
	void ShowMenu(int32 MenuIndex);
	void SpeedDash();
	void StopUsingUsableActor();
	void TryTracingEnemy(float DeltaTime);
	void Update_Voice_Talking(bool Pressed);
	void UpdatePlayerList();
	void UseExtractionCamera();
	void UserConstructionScript();
	void Vendor_Reset();
	void Weapon_Trace_Toggle(bool On_or_Off);
	void WeaponFired();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerController_C")
	}
	static class ABP_PlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerController_C>();
	}
};

}

