#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Quest_BluePrintInterface_Base

#include "Basic.hpp"

#include "FWQuestSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Quest_BluePrintInterface_Base.BP_Quest_BluePrintInterface_Base_C
// 0x0058 (0x0300 - 0x02A8)
class ABP_Quest_BluePrintInterface_Base_C : public AFWQuestTaskActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWLootableComponent*                   FWLootable;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Marker_Starts_Enabled_;                            // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFWGamePlayerCharacter*>         Players_to_Show_Marker;                            // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   Marker_Quest_Tag_s_;                               // 0x02E0(0x0010)(Edit, BlueprintVisible)
	bool                                          Marker_Requires_All_Quest_Tags_;                   // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Missing_tag_s_;                                    // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Num_Correct_Quests;                                // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Currently_enabled_;                                // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_player_to_array();
	void Should_Local_Player_see_marker_(bool* Local_Player_Valid_for_Marker_);
	void Enable_Disable_Marker(bool Enable_);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void Enable_Disable(bool Enable_);
	void Player_Joined();
	void ExecuteUbergraph_BP_Quest_BluePrintInterface_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Quest_BluePrintInterface_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Quest_BluePrintInterface_Base_C")
	}
	static class ABP_Quest_BluePrintInterface_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Quest_BluePrintInterface_Base_C>();
	}
};

}

