#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Quest_DecDemo

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Quest_DecDemo.BP_Quest_DecDemo_C.ExecuteUbergraph_BP_Quest_DecDemo
// 0x0020 (0x0020 - 0x0000)
struct BP_Quest_DecDemo_C_ExecuteUbergraph_BP_Quest_DecDemo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner;                                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Quest_DecDemo.BP_Quest_DecDemo_C.OnQuestCompleted
// 0x0008 (0x0008 - 0x0000)
struct BP_Quest_DecDemo_C_OnQuestCompleted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Quest_DecDemo.BP_Quest_DecDemo_C.OnQuestFailed
// 0x0008 (0x0008 - 0x0000)
struct BP_Quest_DecDemo_C_OnQuestFailed final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Quest_DecDemo.BP_Quest_DecDemo_C.OnQuestStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_Quest_DecDemo_C_OnQuestStarted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

