#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestStartPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestStartPoint.BP_QuestStartPoint_C.ExecuteUbergraph_BP_QuestStartPoint
// 0x0018 (0x0018 - 0x0000)
struct BP_QuestStartPoint_C_ExecuteUbergraph_BP_QuestStartPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestManager_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_QuestStartPoint.BP_QuestStartPoint_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_QuestStartPoint_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_QuestStartPoint.BP_QuestStartPoint_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_QuestStartPoint_C_UserConstructionScript final
{
public:
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0000(0x0010)()
};

}

