#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Quest_DecDemo_Task_030_LootBags

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Quest_DecDemo_Task_030_LootBags.BP_Quest_DecDemo_Task_030_LootBags_C.ExecuteUbergraph_BP_Quest_DecDemo_Task_030_LootBags
// 0x0038 (0x0038 - 0x0000)
struct BP_Quest_DecDemo_Task_030_LootBags_C_ExecuteUbergraph_BP_Quest_DecDemo_Task_030_LootBags final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     K2Node_Event_ParentQuest_1;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     K2Node_Event_ParentQuest_2;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner;                                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     K2Node_Event_ParentQuest;                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function BP_Quest_DecDemo_Task_030_LootBags.BP_Quest_DecDemo_Task_030_LootBags_C.OnQuestTaskCompleted
// 0x0010 (0x0010 - 0x0000)
struct BP_Quest_DecDemo_Task_030_LootBags_C_OnQuestTaskCompleted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function BP_Quest_DecDemo_Task_030_LootBags.BP_Quest_DecDemo_Task_030_LootBags_C.OnQuestTaskFailed
// 0x0010 (0x0010 - 0x0000)
struct BP_Quest_DecDemo_Task_030_LootBags_C_OnQuestTaskFailed final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function BP_Quest_DecDemo_Task_030_LootBags.BP_Quest_DecDemo_Task_030_LootBags_C.OnQuestTaskStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_Quest_DecDemo_Task_030_LootBags_C_OnQuestTaskStarted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

}

