#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RandomLoot_Corpse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_OwnerFaction_structs.hpp"
#include "BP_LootContainer_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RandomLoot_Corpse.BP_RandomLoot_Corpse_C
// 0x00B0 (0x0640 - 0x0590)
class ABP_RandomLoot_Corpse_C : public ABP_LootContainer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RandomLoot_Corpse_C;             // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_LootAndMovPlat_C*                  BPC_LootAndMovPlat;                                // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ThiswayForward;                                    // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    RandomLoot;                                        // 0x05A8(0x0010)(Edit, BlueprintVisible, Net, NoDestructor, ExposeOnSpawn)
	bool                                          PickedUp;                                          // 0x05B8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Visible_Distance;                                  // 0x05BC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RecievedLootInfo;                                  // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RecieveLootInfoDelay;                              // 0x05C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             LocalPlayer;                                       // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AttemptsToGetPlayer;                               // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreLootLifespan;                                   // 0x05D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Europa_Loot_Mesh;                                  // 0x05E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Eurasia_Loot_Mesh;                                 // 0x05E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_OwnerFaction                                My_Owners_Faction;                                 // 0x05F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckContents;                                     // 0x05F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ParentDeadLifespan;                                // 0x0600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VistDistMulti;                                     // 0x0604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            Random_Loot_Table_Array;                           // 0x0608(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Snap_to_ground_;                                   // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide_Mesh_;                                        // 0x0619(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A[0x6];                                      // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Original_Spawn_Loc;                                // 0x0620(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Nav_Data_Radius_for_Search;                        // 0x0638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Locate_Navmesh_Loc(const struct FVector& Location, struct FVector* Final_Location);
	void Random_Loot_From_Array();
	void MakeSureIdoNotBlock();
	void CleanUpCollision();
	void Set_Visible_Dist_Multi(class ACharacter* Player);
	void NukeTheLid();
	void OnRep_My_Owners_Faction();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ContainerOpenStatusChanged(class AFWGamePlayerCharacter* Player);
	void RecieveLootInfo();
	void Parent_Is_Dead(class AActor* DestroyedActor);
	void MonitorLootMarker();
	void SERVER_Destroy_Marker();
	void CLIENTS_Destroy_Marker();
	void SERVER_Clean_up_Collision();
	void CLIENTS_Clean_up_Collision();
	void ExecuteUbergraph_BP_RandomLoot_Corpse(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RandomLoot_Corpse_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RandomLoot_Corpse_C")
	}
	static class ABP_RandomLoot_Corpse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RandomLoot_Corpse_C>();
	}
};

}

