#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Recruitable_LocationMarker

#include "Basic.hpp"

#include "FWPlayer_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Recruitable_LocationMarker.BP_Recruitable_LocationMarker_C
// 0x0058 (0x0310 - 0x02B8)
class ABP_Recruitable_LocationMarker_C final : public AFWBuddyAIMarkerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   outline;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       OrderMarker;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Closest_Target_Distance;                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Target_Distance;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Target_Type;                                       // 0x02E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 My_Target;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Distance_Check_Timer;                              // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BuddyIconTime;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Alpha;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Analyze_Target(class AActor* Potential_Target, int32 PotentialTargetType);
	void ConfirmTarget(bool* Attached_to_dead_pawn_);
	void ExecuteUbergraph_BP_Recruitable_LocationMarker(int32 EntryPoint);
	void Hide_Everything();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_Attack_Target_Widget_SERVER();
	void Set_Move_Target_Widget_SERVER();
	void Set_Recall_Widget_SERVER();
	void Snap_Circle_To_Ground();
	void TrackDistance();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Recruitable_LocationMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Recruitable_LocationMarker_C")
	}
	static class ABP_Recruitable_LocationMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Recruitable_LocationMarker_C>();
	}
};

}

