#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RADAR_LockPuzzleLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RADAR_LockPuzzleLocation.BP_RADAR_LockPuzzleLocation_C
// 0x0120 (0x0580 - 0x0460)
class ABP_RADAR_LockPuzzleLocation_C final : public AFWLockPuzzleLocation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      TeaBag;                                            // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Radar_Drone;                                    // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFWLootableComponent*                   FWLootable;                                        // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_KB3D_FTW_BldgMdAdminCenter_A_MobileRadarA;      // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Not_Yet_Available_Detect;                          // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Keypad;                                            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Order__;                                           // 0x04A0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unlocked_;                                         // 0x04A4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          COMPLETE;                                          // 0x04A5(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A6[0x2];                                      // 0x04A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Advert_Timer;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          I_m_not_managed_;                                  // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              SB_Alarm_MSS;                                      // 0x04B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Tracker_MSS;                                    // 0x04E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        AC_RadarLoop_MSS;                                  // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Detect_Status_Timer;                               // 0x0510(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_TugOfWar_and_RadarManager_C*        My_Manager;                                        // 0x0518(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_player_has_scanmaster_;                      // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Radar_Event_Bind_Attempts;                         // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 RadarHackEventString;                              // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 RadarHackFailString;                               // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Radar_State;                                       // 0x0548(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_Crouch_;                                     // 0x054C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Detect_Jumper_Timer;                               // 0x0550(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TeaBaggedActors;                                   // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           TeaBagTimer;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Anim_Stance;                               // 0x0570(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Alarm_SFX_Multicast();
	void Alarm_SFX_Server();
	void Anim_Crouch_LOOP();
	void Anim_Crouch_START();
	void Anim_Stand_LOOP();
	void Anim_Stand_START();
	void Audio_Complete_loop_from_PlayerBase();
	void Audio_Complete_loop_Multicast();
	void Audio_Complete_Loop_Server();
	void Audio_Radar_Loop();
	void Audio_Radar_Loop_Multicast();
	void Audio_Unlock_Loop_Multicast();
	void Audio_Unlock_Loop_Server();
	void Bind_to_Radar_Event(bool* Bind_Worked_);
	void BndEvt__BP_RADAR_LockPuzzleLocation_LeftTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_RADAR_LockPuzzleLocation_LeftTrigger_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_RADAR_LockPuzzleLocation_Not_Yet_Available_Detect_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_RADAR_LockPuzzleLocation_Not_Yet_Available_Detect_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_RADAR_LockPuzzleLocation_TeaBag_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_RADAR_LockPuzzleLocation_TeaBag_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Change_TacScan(bool Should_be_Scannable_);
	void CLIENTS_Debug_was_used();
	void CLIENTS_Handle_TacScan(bool Should_be_Scannable_);
	void _Unlock_1(bool Lock_);
	void DEBUG_was_used();
	void DestroyRightTrigger();
	void Detect_if_RadarManager_has_me();
	void Detect_Jumpers();
	void Detect_ScanMaster(bool* Has_ScanMaster_);
	void Detect_Status();
	void Determine_Advert();
	void Determine_Hack_Widget();
	void ExecuteUbergraph_BP_RADAR_LockPuzzleLocation(int32 EntryPoint);
	void Fail_AI_Noise();
	void Flash_Current_(bool Should_be_Scannable_);
	void Get_status();
	class USkeletalMeshComponent* GetSkelMesh();
	void Handle_TacScan(bool Should_be_Scannable_);
	void Inform_Unlock_Status(class AActor* Player);
	void Init_Detect_Jumpers();
	void _Unlock(bool Lock_);
	void _unlock_BEGIN();
	void OnLoaded_9F348A2B4069A681216CB8A0180FA4AE(class UObject* Loaded);
	void OnLoaded_A1F73BEB42F64552A067CE92C5665B87(class UObject* Loaded);
	void OnRep_Radar_State();
	void Play_Tracker();
	void Radar_Dispatch_Received(class AActor* Radar_Object, const class FString& Radar_Event);
	void Radar_Hacked(int32 TerminalIndex);
	void Receive_Order_Info(int32 Order_Value);
	void ReceiveBeginPlay();
	void Retry_Radar_Bind();
	void Send_Radar_Event(const class FString& Radar_Event);
	void SERVER_Debug_was_used();
	void _Unlock_0(bool Lock_);
	void SetTeabaggingMode(bool bEnable);
	void Stop_Tracker();
	void TeaBagVictims();
	void Terminal_Fail(int32 TerminalIndex);
	void Trigger_Stealth_MusicMulticast();
	void Trigger_StealthMusic_Server();
	void Unlock_this_Radar();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RADAR_LockPuzzleLocation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RADAR_LockPuzzleLocation_C")
	}
	static class ABP_RADAR_LockPuzzleLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RADAR_LockPuzzleLocation_C>();
	}
};

}

