#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RigEquipment_20mmTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DangleContainer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RigEquipment_20mmTurret.BP_RigEquipment_20mmTurret_C
// 0x0078 (0x0390 - 0x0318)
class ABP_RigEquipment_20mmTurret_C final : public ABP_DangleContainer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RigEquipment_20mmTurret_C;       // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TurretMesh_02;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TurretMesh_01;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CompassMarkerComponent_C*           BP_QuestDataComponent;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Visible_Distance;                                  // 0x0344(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveTag;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsQuestItem_;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewVar;                                            // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_Picked_Up;                                   // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         DropIgnoreList;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class ADangly* Item_Picked_Up)> Picked_Up;                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class ADangly* Item_Dropped)> Dropped;                             // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CLIENTS_Dangle_was_Dropped();
	void CLIENTS_Dangle_was_Looted();
	void DanglyDropped();
	void ExecuteUbergraph_BP_RigEquipment_20mmTurret(int32 EntryPoint);
	float GetBattlePoint();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RigEquipment_20mmTurret_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RigEquipment_20mmTurret_C")
	}
	static class ABP_RigEquipment_20mmTurret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RigEquipment_20mmTurret_C>();
	}
};

}

