#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnController_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWAICore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpawnController_Base.BP_SpawnController_Base_C
// 0x0050 (0x03F0 - 0x03A0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_SpawnController_Base_C : public AFWAISpawnController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_MarkPlayers_HunterKillers_C*       BPC_MarkPlayers_HunterKillers;                     // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   SpawnText1;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible)
	class FText                                   SpawnText2;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         HKs_to_Destroy;                                    // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void ExecuteUbergraph_BP_SpawnController_Base(int32 EntryPoint);
	void InformHordeActive();
	void OnGlobalWaveSpawned_Event();
	void ReceiveBeginPlay();
	void Trigger_HK_UI();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SpawnController_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SpawnController_Base_C")
	}
	static class ABP_SpawnController_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpawnController_Base_C>();
	}
};
#pragma pack(pop)

}

