#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShootingRangeUpgradeDetect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShootingRangeUpgradeDetect.BP_ShootingRangeUpgradeDetect_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_ShootingRangeUpgradeDetect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Setup_Tries;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shooting_Range_Level;                              // 0x02A4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Shooting_Range_Level)> Shooting_Range_Results;               // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Detect_PQ_and_SR(int32* Shooting_Range_Level_0);
	void ExecuteUbergraph_BP_ShootingRangeUpgradeDetect(int32 EntryPoint);
	void LoadGame(const class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Player_Joined();
	void Query_SRange_level();
	void Ready_1D09C8DC495D7FCCCB9F168E108447AB(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Ready_61AE913F4F122CAC12B14AB1535846FE(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveBeginPlay();
	void SaveGame(const class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Setup(bool* Complete_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ShootingRangeUpgradeDetect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ShootingRangeUpgradeDetect_C")
	}
	static class ABP_ShootingRangeUpgradeDetect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShootingRangeUpgradeDetect_C>();
	}
};

}

