#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnController_HunterKiller_HRF05

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SpawnController_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpawnController_HunterKiller_HRF05.BP_SpawnController_HunterKiller_HRF05_C
// 0x0010 (0x0400 - 0x03F0)
class ABP_SpawnController_HunterKiller_HRF05_C final : public ABP_SpawnController_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SpawnController_HunterKiller_HRF05_C; // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_DisableHKsIfAlreadyActive_C*       BPC_DisableHKsIfAlreadyActive;                     // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          I_am_the_one_;                                     // 0x03F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          I_have_been_activated;                             // 0x03F9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Max_HKs_from_HRF05;                                // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_My_Allies();
	void Client_Triggered_Start_Spawning();
	void ExecuteUbergraph_BP_SpawnController_HunterKiller_HRF05(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Someone_Did_Damage__see_BP_WPN_HRF05_();
	void Spawn_Additional_HK();
	void Spawn_HK_Checker();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SpawnController_HunterKiller_HRF05_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SpawnController_HunterKiller_HRF05_C")
	}
	static class ABP_SpawnController_HunterKiller_HRF05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpawnController_HunterKiller_HRF05_C>();
	}
};

}

