#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillTree_SG

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillTree_SG.BP_SkillTree_SG_C.ExecuteUbergraph_BP_SkillTree_SG
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillTree_SG_C_ExecuteUbergraph_BP_SkillTree_SG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTree_SG.BP_SkillTree_SG_C.GiveExp
// 0x0010 (0x0010 - 0x0000)
struct BP_SkillTree_SG_C_GiveExp final
{
public:
	int32                                         Exp;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTree_SG.BP_SkillTree_SG_C.LearnSkill
// 0x0068 (0x0068 - 0x0000)
struct BP_SkillTree_SG_C_LearnSkill final
{
public:
	struct FSkillData                             Skill;                                             // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function BP_SkillTree_SG.BP_SkillTree_SG_C.Prestige
// 0x000C (0x000C - 0x0000)
struct BP_SkillTree_SG_C_Prestige final
{
public:
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTree_SG.BP_SkillTree_SG_C.SpendExp
// 0x000C (0x000C - 0x0000)
struct BP_SkillTree_SG_C_SpendExp final
{
public:
	int32                                         Exp;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

