#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScenarioSpawner

#include "Basic.hpp"

#include "E_ScenarioTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_ScenarioTriggerType_structs.hpp"
#include "FWAICore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScenarioSpawner.BP_ScenarioSpawner_C
// 0x0240 (0x04D0 - 0x0290)
class ABP_ScenarioSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        GrabberFacing;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GrabberZone;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        EurasianDroneFacing;                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EurasianDroneZone;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        EuropaDroneFacing;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EuropanDroneZone;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        EuropanTurretFacing;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EuropanTurretZone;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Loot_Facing;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Scav_Facing;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Eurasia_Facing;                                    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Europa_Facing;                                     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LootZone;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScavZone;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EurasianZone;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EuropanZone;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       TriggerSphere;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        TriggerRadius;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Scenarios_To_Consider;                             // 0x0330(0x0010)(Edit, BlueprintVisible)
	class FName                                   DataTableRowName;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NavMeshSearchRadius;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Europa_Use_External_Zones_;                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Eurasia_Use_External_Zones_;                       // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Scavs_Use_External_Zones_;                         // 0x0352(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Loot_Use_External_Zones_;                          // 0x0353(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ScenarioZone_C*>             External_Europa_Zones;                             // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_ScenarioZone_C*>             External_Eurasian_Zones;                           // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_ScenarioZone_C*>             External_Scav_Zones;                               // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_ScenarioZone_C*>             External_Loot_Zones;                               // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class UClass*>                         Loot_Objects;                                      // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Player_Team_Battle_Points;                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Time_Limits_;                                  // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Min_Game_Time;                                     // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Game_Time;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Player_Squad_BPs_;                             // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Min_Player_Squad_BPs;                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Player_Squad_BPs;                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Scav_Zone_;                                   // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Eurasian_Zone_;                               // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Europan_Zone_;                                // 0x03E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Loot_Zone_;                                   // 0x03E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Grabber_Zone_;                                // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Eurasian_Drone_Zone_;                         // 0x03E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Europan_Drone_Zone_;                          // 0x03E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Europan_Turret_Zone_;                         // 0x03E7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_ScenarioZone_C*>             External_Europan_Turret_Zones;                     // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Europan_Turrets_Use_External_Zones_;               // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ScenarioZone_C*>             External_European_Drone_Zones;                     // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Europan_Drones_Use_External_Zones_;                // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ScenarioZone_C*>             External_Eurasian_Drone_Zones;                     // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Eurasian_Drones_Use_External_Zones_;               // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ScenarioZone_C*>             External_Grabber_Zones;                            // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Grabbers_Use_External_Zones_;                      // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pick_Random_Scenario_;                             // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         LootZonesAndMarkup;                                // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	E_ScenarioTypes                               Random_Scenario_Type;                              // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Manage_Tank_Squads_;                               // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AI_SquadVolume_Tank_C*>      Tank_Squads;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Spawn_Tanks_on_Scenario_Start_;                    // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Tank_Spawn_Chance;                                 // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ScenarioTriggerType                         Scenario_Trigger_Method;                           // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Max_Game_State_Tries;                              // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tank_Spawn_Chance_PER_SQUAD_;                      // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ScenarioActivated;                                 // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugEnabled;                                      // 0x048A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48B[0x1];                                      // 0x048B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebugCount;                                        // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckHitCounter;                                   // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CleanupTimer;                                      // 0x0498(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         SpawnedAI;                                         // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        CleanupDist;                                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Active_Players;                                    // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Cleanup_ditched_AI_;                               // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ScenarioSpawner_TriggerSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Check_Hit(class AActor* Actor_hit, bool* Hit_an_Actor_);
	void CleanupTimerEvent();
	void Collect_Requested_Scenarios(E_ScenarioTypes Scenario_Type, TArray<class FName>* List_of_Scenarios);
	void Collect_Spawned_AI(class APawn* SpawnedAI_0, EFWAISpawnResultCode ResultCode);
	void DebugReport();
	void ExecuteUbergraph_BP_ScenarioSpawner(int32 EntryPoint);
	void InpActEvt_K_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_K_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_M_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_M_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void NewPlayer();
	void OnLoaded_0372555A43FFA3B62E12BBB5731A312C(TSubclassOf<class UObject> Loaded);
	void OnLoaded_13BC93EF46AC885A1DEB95B64D4AD4A4(TSubclassOf<class UObject> Loaded);
	void OnLoaded_3CFA78114DF6F4EE92F87E8145D4B0AA(TSubclassOf<class UObject> Loaded);
	void OnLoaded_508FB6B846C28913A5A0E0BAF95CD417(TSubclassOf<class UObject> Loaded);
	void OnLoaded_5DDB177F451A06A43A92DAB3F7003045(TSubclassOf<class UObject> Loaded);
	void OnLoaded_6E7C9020420365C4E9298185B82E7A19(TSubclassOf<class UObject> Loaded);
	void OnLoaded_70B839384BE6E53B4C51A185A1695427(TSubclassOf<class UObject> Loaded);
	void OnLoaded_73BE1A2A4BDBF8A25016F5849E97FEED(TSubclassOf<class UObject> Loaded);
	void OnLoaded_CE09F6894AC0C8D36AA028963D5CB5BA(TSubclassOf<class UObject> Loaded);
	void ReceiveBeginPlay();
	void Replicated_Scenario(class FName Selected_Scenario);
	void SERVER_Trigger_Scenario();
	void Spawn_Requested_Elements___Drones(int32 Min_to_spawn, int32 Max_to_spawn, TArray<TSoftClassPtr<class UClass>>& Possible_Drones, class UBoxComponent* Spawn_Volume, bool External_Zones_, TArray<class ABP_ScenarioZone_C*>& External_Zone_Array, bool Distribute_, const class FString& Category);
	void Spawn_Requested_Elements___Grabbers(int32 Min_to_spawn, int32 Max_to_spawn, TArray<TSoftClassPtr<class UClass>>& Possible_types, class UBoxComponent* Spawn_Volume, bool External_Zones_, TArray<class ABP_ScenarioZone_C*>& External_Zone_Array, bool Distribute_, const class FString& Category);
	void Spawn_Requested_Elements___Loot(int32 Min_to_spawn, int32 Max_to_spawn, TArray<TSoftClassPtr<class UClass>>& Possible_Containers, TArray<TSoftClassPtr<class UClass>>& Possible_Dangles, class UBoxComponent* Spawn_Volume, bool External_Zones_, TArray<class ABP_ScenarioZone_C*>& External_Zone_Array, bool Distribute_, const class FString& Category);
	void _Infantry(int32 Min_to_spawn, int32 Max_to_spawn, TArray<TSoftClassPtr<class UClass>>& Possible_types, class UBoxComponent* Spawn_Volume, bool Explicit_Squad_, bool External_Zones_, TArray<class ABP_ScenarioZone_C*>& External_Zone_Array, bool Distribute_, const class FString& Category);
	void Spawn_Requested_Elements___Turrets(int32 Min_to_spawn, int32 Max_to_spawn, TArray<TSoftClassPtr<class UClass>>& Possible_Turrets, class UBoxComponent* Spawn_Volume, bool External_Zones_, TArray<class ABP_ScenarioZone_C*>& External_Zone_Array, bool Distribute_, const class FString& Category);
	void Spawned_AI_Dist(class AActor* AI_to_Check);
	void Trigger_Scenario();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ScenarioSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ScenarioSpawner_C")
	}
	static class ABP_ScenarioSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScenarioSpawner_C>();
	}
};

}

