#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TugOfWar_and_RadarManager

#include "Basic.hpp"

#include "STRUCT_TugOfWar_Keys_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STRUCT_TugOfWar_LevelActions_structs.hpp"
#include "STRUCT_TOWTableRows_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TugOfWar_and_RadarManager.BP_TugOfWar_and_RadarManager_C
// 0x00E0 (0x0370 - 0x0290)
class ABP_TugOfWar_and_RadarManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_MeatManCodexDrop_C*                BPC_MeatManCodexDrop;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_HardpointDetect_C*                 BPC_HardpointDetect;                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_TugOfWar_C*                        BPC_TugOfWar;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_RADAR_LockPuzzleLocation_C*> Radar_LockPuzzles;                                 // 0x02C0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate)
	int32                                         Current_Assignment__;                              // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RADAR_LockPuzzleLocation_C*         Radar_02;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_RADAR_LockPuzzleLocation_C*         Radar_03;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_RADAR_LockPuzzleLocation_C*         Radar_01;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Three_of_3_Radars_Hacked;                          // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              One_of_3_Radars_Hacked;                            // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Two_of_3_Radars_Hacked;                            // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Level_Contains_Radars_;                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_TugOfWar_LevelActions>  Active_Tug_of_War;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(const struct FSTRUCT_TugOfWar_Keys& Active_Tug_of_War_Markers, const struct FSTRUCT_TOWTableRows& Returned_Rows)> Get_Active_Tug_of_War_Markers; // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    Radar_Key;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Radar_01_Hacked;                                   // 0x0358(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Radar_02_Hacked;                                   // 0x0359(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Radar_03_Hacked;                                   // 0x035A(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Random_Radar_Hack_Time_;                       // 0x035B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Random_Radar_Hack_Variance_MIN;                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Radar_Hack_Variance_MAX;                    // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void One_of_3();
	void Two_of_3();
	void Three_of_3();
	void ActivateTOWMarker(class FName NewParam);
	void CLIENTS_All_3_Radars_Unlocked();
	void CLIENTS_Change_Radar_Text(const class FText& Text);
	void CLIENTS_Radar_Hack_XP_Time(class AActor* Radar, class AActor* XP_Earner, double XP);
	void Debug_Hack_Them_All();
	void ExecuteUbergraph_BP_TugOfWar_and_RadarManager(int32 EntryPoint);
	void Find_and_Set_Radar_Tag(class AFWPlayerStateBase* Player);
	void Give_Radar_XP_Find_Out_Who_Game(class AActor* Radar, double XP_to_give);
	void ModF(double float_0, int32* PreDecimal, double* PostDecimal);
	void OnCompleteRadar_Audio_Multicast();
	void OnCompleteRadar_Audio_Server();
	void PlayerJoined();
	void Radar_1_Unlocked(int32 TerminalIndex);
	void Radar_2_Unlocked(int32 TerminalIndex);
	void Radar_3_unlocked(int32 TerminalIndex);
	void Radar_Hack_XP_Time(class AActor* Radar, double XP);
	void ReceiveBeginPlay();
	void RemoveEncountersContainingStrings(const class FString& Faction, const class FString& Unit);
	void SERVER_Change_Radar_Text(const class FText& Text);
	void SERVER_Hack_Them_All();
	void SERVER_Radar_Hack_XP_Time(class AActor* Radar, double XP);
	void SetText(class UTextRenderComponent* Text_Rendor_Component, const class FText& New_Text);
	void ShowRadarDebugText();
	void Shuffle_Radars();
	void TOWLowerEurasia();
	void TOWLowerEuropa();
	void TOWLowerEuruska();
	void TOWQuery();
	void TOWRaiseEurasia();
	void TOWRaiseEuropa();
	void TOWRaiseEuruska();
	void UserConstructionScript();
	void Verify_1_RadarManager(bool* Only_1_);
	void Verify_Radars(bool* All_good_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TugOfWar_and_RadarManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TugOfWar_and_RadarManager_C")
	}
	static class ABP_TugOfWar_and_RadarManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TugOfWar_and_RadarManager_C>();
	}
};

}

