#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TopLarge_2

#include "Basic.hpp"

#include "BP_BasePlayerContainer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TopLarge_2.BP_TopLarge_2_C
// 0x0038 (0x02F8 - 0x02C0)
class ABP_TopLarge_2_C final : public ABP_BasePlayerContainer_C
{
public:
	class UStaticMeshComponent*                   SM_Container_07a;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ammo_Box_02d1;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Large_Crate_01a;                                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CHR_Backpack_Part_12;                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CHR_Backpack_Part_09;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CHR_Backpack_Part_03;                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CHR_Backpack_Part_07;                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TopLarge_2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TopLarge_2_C")
	}
	static class ABP_TopLarge_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TopLarge_2_C>();
	}
};

}

