#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TombStoneRigWeapons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TombStoneRigWeapons.BP_TombStoneRigWeapons_C
// 0x0098 (0x0328 - 0x0290)
class ABP_TombStoneRigWeapons_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Maskman_pose_4;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       UsableMarker;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   Controller_Text;                                   // 0x02C0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Keyboard_Text;                                     // 0x02D0(0x0010)(Edit, BlueprintVisible)
	double                                        Use_Me_Radius;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Additional_Text__if_any_;                          // 0x02E8(0x0010)(Edit, BlueprintVisible)
	struct FTimerHandle                           Usable_Loc_Timer_Handle;                           // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Search_Radius;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Search_Attempts;                                   // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Player_Close;                                      // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Potential_Location;                                // 0x0310(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void After_Teleport();
	void Begin_Proximity_Check();
	void BndEvt__BP_Usable_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Usable_Sphere_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Confirm_viable_location(bool* Location_Viable_);
	void ExecuteUbergraph_BP_TombStoneRigWeapons(int32 EntryPoint);
	void Find_Viable_Location(bool* Placed___viable);
	void In_Tunnels_(bool* In_Tunnels__0);
	void Inform_Potential_Users();
	void LOS_Check(class APawn* Player, bool* LOS_passed_);
	void Proximity_Check(bool* Proximity_Check_Complete, double* Check_Delay);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RequestExtraction(class AActor* Requesting_Pawn);
	void ServerUsed(class AFWGamePlayerCharacter* PlayerUsed);
	void Show_Usable_Loc();
	void Used(class AFWGamePlayerCharacter* User, bool* Used_0, class AActor** UseableActor);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TombStoneRigWeapons_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TombStoneRigWeapons_C")
	}
	static class ABP_TombStoneRigWeapons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TombStoneRigWeapons_C>();
	}
};

}

