#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Usable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ForeverWinter_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Usable.BP_Usable_C
// 0x01D8 (0x0468 - 0x0290)
class ABP_Usable_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       UsableMarker;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AFWGamePlayerCharacter*>         Characters_that_can_Use_Me;                        // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class FText                                   Keyboard_Text;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible)
	double                                        Use_Me_Radius;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled_;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AActor* Player_That_Used_Me, class AActor* Usable)> IWasUsed; // 0x02E0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Max_Num_Uses;                                      // 0x02F0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseHUBWorldRules;                                  // 0x02F4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImBeingUsed;                                       // 0x02F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F6[0x2];                                      // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Additional_Text__if_any_;                          // 0x02F8(0x0010)(Edit, BlueprintVisible)
	TArray<class AFWGamePlayerCharacter*>         Characters_that_ARE_using_me;                      // 0x0308(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Use_in_world_HUD_marker_;                          // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   In_World_Marker_Text;                              // 0x0320(0x0010)(Edit, BlueprintVisible)
	struct FTimerHandle                           Usable_Loc_Timer_Handle;                           // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Min_In_World_Distance;                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Marker_Object;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Relative_Marker_Offset;                            // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TrackWater_;                                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   UseText;                                           // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UseAdditionalText;                                 // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   _Quest_Giver;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Water_Deny_Use_;                                   // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   No_Water_Input_Text;                               // 0x0398(0x0010)(Edit, BlueprintVisible)
	class FText                                   No_Water_Additional_Text_01;                       // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   No_Water_Additional_Text_02;                       // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   No_Water_Additional_Text_03;                       // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   No_Water_Additional_Text_04;                       // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Require_LOS_;                                      // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUseableActorType                             UseMode;                                           // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PromptsToRemove;                                   // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Look_at_Dot_Product_Threshold;                     // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Require_LOS_danger_close_dist;                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Usable_in_Demo_;                                   // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TrackUsedBy;                                       // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePooledCharacters;                               // 0x0412(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RelayThroughServer;                                // 0x0413(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Overlapping_Usable_Count;                          // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFWGamePlayerCharacter*>         Overlapping_Usable_Checker;                        // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           Overlap_Timer;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Usable_C*>                   All_Usables;                                       // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector2D                              CenterScreen;                                      // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Closest_Usable_Dist_from_Center_Screen;            // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           Closest_Usable;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          I_am_closest;                                      // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Overlap_Check_;                                // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Usable_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Usable_Sphere_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CharactersThatCanUse(TArray<class AActor*>* Characters_that_can_Use_Me_0);
	void Check_For_Overlap();
	void Check_Water();
	void ClearTrainingText(class UObject* Target);
	void Compute_Marker_Info(class UFW_WG_UsableMarker_C* Widget);
	void DemoCheck();
	void ExecuteUbergraph_BP_Usable(int32 EntryPoint);
	void ExtraDisplayConditions(bool* Display);
	void ExtraHostUse(class AFWGamePlayerCharacter* Player);
	void ExtraUseConditions(class AFWGamePlayerCharacter* Player, bool ApplyHostUseExtra, bool* CanUse);
	void Hide_or_Show_Usable_Marker(bool Hide_);
	void I_Was_Used(class AFWGamePlayerCharacter* Pawn, bool* Used_0);
	void Inform_Potential_Users();
	void LOS_Check(class AFWGamePlayerCharacter* Player, bool* LOS_passed_);
	void Overlap_Checking();
	void PopulateSphere();
	void ReceiveBeginPlay();
	void RemoveCharacterUsable(const class AFWGamePlayerCharacter*& Item);
	class FText RemovePromptText(const class FText& OriginalText);
	void RequestExtraction(class AActor* Requesting_Pawn);
	void ServerUsed(class AFWGamePlayerCharacter* PlayerUsed);
	void Show_Usable_Loc();
	void UpdateUseMode(EUseableActorType UseMode_0);
	void UsableChecks(class AFWGamePlayerCharacter* Player, bool* Usable);
	void UseAll(class AFWGamePlayerCharacter* PlayerUsed);
	void Used(class AFWGamePlayerCharacter* User, bool* Used_0, class AActor** UseableActor);
	void UserConstructionScript();
	void Water_Allow_Usable();
	void Water_Deny_Usable();
	void Water_Fail_to_find_row();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Usable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Usable_C")
	}
	static class ABP_Usable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Usable_C>();
	}
};

}

