#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Usable_BarTalker_Bartender_InHUB

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Usable_BarTalker_ROOT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Usable_BarTalker_Bartender_InHUB.BP_Usable_BarTalker_Bartender_InHUB_C
// 0x0020 (0x0510 - 0x04F0)
class ABP_Usable_BarTalker_Bartender_InHUB_C final : public ABP_Usable_BarTalker_ROOT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Usable_BarTalker_Bartender_InHUB_C; // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UDialogueWidget>            HUB_Bartender_Dialogue_Class;                      // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Give_Quest_;                                       // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Complete_Quest_;                                   // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWQuest*                               Active_Bar_Quest;                                  // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExpoDump_Closed(class UDialogueWidget* Widget_that_Closed);
	void ExecuteUbergraph_BP_Usable_BarTalker_Bartender_InHUB(int32 EntryPoint);
	void Dialogue_Request(class AActor* Player_That_Used_Me, class AActor* Usable);
	void Determine_Dialogue();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Usable_BarTalker_Bartender_InHUB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Usable_BarTalker_Bartender_InHUB_C")
	}
	static class ABP_Usable_BarTalker_Bartender_InHUB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Usable_BarTalker_Bartender_InHUB_C>();
	}
};

}

