#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponBase_AI

#include "Basic.hpp"

#include "BP_WeaponBase_classes.hpp"
#include "Engine_structs.hpp"
#include "FWAICore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponBase_AI.BP_WeaponBase_AI_C
// 0x0050 (0x0BB0 - 0x0B60)
class ABP_WeaponBase_AI_C : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WeaponBase_AI_C;                 // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Weapon;                                         // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_Track_Fire_Rate_On_;                         // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B69[0x3];                                      // 0x0B69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Shots;                                             // 0x0B6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Start_Time;                                        // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_is_A;                                        // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        End_Time;                                          // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Burst_Start_Time;                                  // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Burst_End_Time;                                    // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Setup_Attempts;                                    // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weapon_s_Free;                                     // 0x0B9C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFWAIAwarenessState                           Current_Awareness_State;                           // 0x0B9D(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E[0x2];                                      // 0x0B9E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           awarenessTimer;                                    // 0x0BA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   BB_Target;                                         // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Get_Awareness(class APawn* Pawn);
	void AwarenessCheck(class AActor* Target, bool* Target_Check_Passed_);
	void Setup_Fire_Anim(bool* Done_);
	const struct FTransform GetMuzzleTransform();
	void FireEvent();
	void DebugAIFireRate();
	void ReceiveBeginPlay();
	void Retry_Fire_Anim_Setup();
	void New_Target_Pot_Shot(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget);
	void Check_Target_on_Timer();
	void ExecuteUbergraph_BP_WeaponBase_AI(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponBase_AI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponBase_AI_C")
	}
	static class ABP_WeaponBase_AI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponBase_AI_C>();
	}
};

}

