#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WPN_GRL00

#include "Basic.hpp"

#include "BP_WeaponBase_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WPN_GRL00.BP_WPN_GRL00_C
// 0x00B0 (0x0C10 - 0x0B60)
class ABP_WPN_GRL00_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WPN_GRL00_C;                     // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Grenade;                                           // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Default_InHand_Grenade_Mesh;                       // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Found_Grenade_Model;                               // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSoftObjectPtr<class UStaticMesh>, struct FVector> Model_to_Scale;                          // 0x0B78(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UStaticMesh>             Requested_Grenade_Static_Mesh;                     // 0x0BC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                Default_Scale;                                     // 0x0BF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CLIENTS_Player_Using(const struct FGameplayTag& GrenadeType);
	void ExecuteUbergraph_BP_WPN_GRL00(int32 EntryPoint);
	void FireEvent();
	const struct FTransform GetMuzzleTransform();
	class UStaticMeshComponent* GetWeaponPart(const class FString& WeaponPartName);
	void OnLoaded_19E7E7094295539457A16593CA767EC6(class UObject* Loaded);
	void Player_Using();
	void ReceiveBeginPlay();
	void SERVER_Player_Using();
	void Set_Grenade_Model(TSoftObjectPtr<class UStaticMesh> Static_Mesh);
	void SetupSockets();
	void UserConstructionScript();
	void WeaponFireEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WPN_GRL00_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WPN_GRL00_C")
	}
	static class ABP_WPN_GRL00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WPN_GRL00_C>();
	}
};

}

