#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WPN_RFL12_WorldProp

#include "Basic.hpp"

#include "BP_WeaponBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WPN_RFL12_WorldProp.BP_WPN_RFL12_WorldProp_C
// 0x0060 (0x0BC0 - 0x0B60)
class ABP_WPN_RFL12_WorldProp_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WPN_RFL12_WorldProp_C;           // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_WPN_RFL12_UPP_01_EPC;                           // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_RCV;                                  // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_RLS;                                  // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_CHG_01;                               // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_FMS;                                  // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_TRG;                                  // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_MAG_556_01;                           // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_BLT;                                  // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_BLR;                                  // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WPN_RFL12_BCG;                                  // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_Container;                              // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WPN_RFL12_WorldProp(int32 EntryPoint);
	void UserConstructionScript();
	void WeaponFireEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WPN_RFL12_WorldProp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WPN_RFL12_WorldProp_C")
	}
	static class ABP_WPN_RFL12_WorldProp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WPN_RFL12_WorldProp_C>();
	}
};

}

