#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WPN_BaseCRW

#include "Basic.hpp"

#include "BP_WeaponBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WPN_BaseCRW.BP_WPN_BaseCRW_C
// 0x00E0 (0x0C40 - 0x0B60)
class ABP_WPN_BaseCRW_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WPN_BaseCRW_C;                   // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor;                                        // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PlayerSnapMarker;                                  // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Weapon_being_used_;                                // 0x0B70(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Deployable_Xhair_Class;                            // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            The_Deployable_Xhair_Object;                       // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Demount_SFX_SC;                                 // 0x0B88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Mount_SFX_SC;                                   // 0x0BB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Demount_SC;                                     // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Mount_SC;                                       // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_Attach_SFX_SC;                                  // 0x0BE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SB_ComepletetionStinger_SFX;                       // 0x0C10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Replicated_Ammo;                                   // 0x0C38(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LevelSpawned_;                                     // 0x0C3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyAmmoMat();
	void Demount_Audio();
	void Demount_Audio_Multicast();
	void Demount_Audio_Server();
	void ExecuteUbergraph_BP_WPN_BaseCRW(int32 EntryPoint);
	void FireEvent();
	const struct FTransform GetMuzzleTransform();
	void GetPlayerSnapTransform(class USceneComponent** Transform);
	void Init_Local_HUD();
	void Interacted(class AActor* Player_That_Used_Me, class AActor* Usable);
	void Mount_Audio(class AActor* PlayerThatUsedMe);
	void Mount_Audio_MultiCast();
	void Mount_Audio_Server();
	void NewPlayer();
	void OnLoaded_0CB9300A4DEE1D24CF255AB2F5D74D7E(class UObject* Loaded);
	void OnLoaded_49F01A6B41C6CC126D5A47ADA7E24AA3(class UObject* Loaded);
	void OnLoaded_A5555859419F7C5565F13D843864267A(class UObject* Loaded);
	void OnLoaded_BE784B5F47D898A8641183A757799A5A(class UObject* Loaded);
	void ReceiveBeginPlay();
	void Remove_currently_using_player(class AFWGamePlayerCharacter* Player);
	void Remove_Local_HUD();
	void UserConstructionScript();
	void WeaponFireEvent();
	void WPN_Constructed_SFX_Multicast();
	void WPN_Constructed_SFX_Server();

	TSubclassOf<class UUserWidget> GetOverrideCrosshairWidget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WPN_BaseCRW_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WPN_BaseCRW_C")
	}
	static class ABP_WPN_BaseCRW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WPN_BaseCRW_C>();
	}
};

}

