#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MechPilot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MechPilot.BPC_MechPilot_C
// 0x0088 (0x0128 - 0x00A0)
class UBPC_MechPilot_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Drop_Pilot_;                                       // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Pilot_Class_Soft;                                  // 0x00B0(0x0028)(Edit, BlueprintVisible, Net, HasGetValueTypeHash)
	class UClass*                                 Pilot_Class;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 My_Owner;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Drop_Pilot_Chance___Normal;                        // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Drop_Pilot_Chance___Quest;                         // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Quest_Tag_for_this_Pilot;                          // 0x00F8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                        Final_Drop_Pilot_Chance;                           // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pilot_Spawn_Radius_Min;                            // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pilot_Spawn_Radius_Max;                            // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pilot_Spawn_Location;                              // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CLIENTS_Force_Pilot_Load();
	void CLIENTS_Load_Pilot();
	void ExecuteUbergraph_BPC_MechPilot(int32 EntryPoint);
	void OnLoaded_CCDDC7F448D21273C9723DBD0E25EF01(TSubclassOf<class UObject> Loaded);
	void Owner_Took_Damage(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void SERVER_Force_Pilot_Load();
	void Spawn_the_Pilot();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_MechPilot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_MechPilot_C")
	}
	static class UBPC_MechPilot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MechPilot_C>();
	}
};

}

