#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Loot_DropLogic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_Loot_DropLogic.BPC_Loot_DropLogic_C
// 0x0070 (0x0110 - 0x00A0)
class UBPC_Loot_DropLogic_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         Ignore4GroundTrace;                                // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 Actor2Trace;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 My_Loot;                                           // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Random_Horizontal_Values;                          // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Box_Trace_Half_Size;                               // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Box_Trace_Orientation;                             // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         LifeSpan;                                          // 0x0108(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _spawned_;                                         // 0x010C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Collect_Size_and_Orientation();
	void Find_Surface();
	void DropLogic(class AActor* Dropped_Item);
	void ExecuteUbergraph_BPC_Loot_DropLogic(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_Loot_DropLogic_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_Loot_DropLogic_C")
	}
	static class UBPC_Loot_DropLogic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_Loot_DropLogic_C>();
	}
};

}

