#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerWeaponADSAccuracy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_PlayerWeaponADSAccuracy.BPC_PlayerWeaponADSAccuracy_C
// 0x0070 (0x0110 - 0x00A0)
class UBPC_PlayerWeaponADSAccuracy_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFWGamePlayerCharacter*                 My_Weapon_s_Owner;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 My_Weapon_Owner_s_FWWeaponUser;                    // 0x00B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFWWeaponBase*                          My_Weapon;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Init_Attempts;                                     // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Am_equipped_timer;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponDefinition*                    My_Weapon_s_Def;                                   // 0x00D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWAbilitySystemComponent*              My_Weapon_Owner_s_GAS;                             // 0x00D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Gameplay_Tag_Container;                            // 0x00E0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Gameplay_Tag;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Gameplay_Effect_Class;                             // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Add_or_remove_effect(bool Add_);
	void Am_I_current_Weapon_(bool* I_am_Current_Weapon);
	void An_I_in_a_player_s_hands_(bool* Weapon_is_Player_s);
	void Check_if_equipped();
	void Check_if_owner_is_turret(bool* Is_Turret_);
	void CLIENTS_Deactivate();
	void Do_Deactivate();
	void ExecuteUbergraph_BPC_PlayerWeaponADSAccuracy(int32 EntryPoint);
	void Init(bool* Init_Complete_);
	void Is_my_owner_valid_(bool* Valid_);
	void ReceiveBeginPlay();
	void Retry_Init();
	void SERVER_Deactivate();
	void _Adjust_Timer_Speed(double Speed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_PlayerWeaponADSAccuracy_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_PlayerWeaponADSAccuracy_C")
	}
	static class UBPC_PlayerWeaponADSAccuracy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_PlayerWeaponADSAccuracy_C>();
	}
};

}

