#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TugOfWar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "STRUCT_TugOfWar_LevelActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_TugOfWar.BPC_TugOfWar_C
// 0x0230 (0x02D0 - 0x00A0)
class UBPC_TugOfWar_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Retry_Attempts;                                    // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TugOfWar_and_RadarManager_C*        My_TugOfWar_Manager;                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TugOfWar_LevelActions          Current_TOW_struct;                                // 0x00B8(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Current_Level_Change__;                            // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UObject*                                Level_Change___Data_Table;                         // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Level_Locations_Data_Table;                        // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   TOW___Map_Tags;                                    // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Current_Level_TOW_Map_Tag;                         // 0x0198(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TOW_Min__;                                         // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TOW_Max__;                                         // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Populate_Active_AI_Timer;                          // 0x01B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Active_AI;                                         // 0x01B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        Damage_RECIEVE_TOW_Factor;                         // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Damage_for_TOW_;                               // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, bool>                     Active_AI_to_Bound_to_Event;                       // 0x01D8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        Damage_DELIVER_TOW_Factor;                         // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Last_Damage;                                       // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HubWorldManager_C*                  My_HUBworldManager;                                // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tug_of_War_Reset__;                                // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TOW_RESET__DAYS;                                   // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TOW_RESET__HOURS;                                  // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TOW_RESET__MINUTES;                                // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TOW_RESET__SECONDS;                                // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_TOW_RESET__;                                 // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Backup_MinMax_Timer;                               // 0x0260(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Backup_Timer_Time;                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, float>              StartingTOW_;                                      // 0x0270(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          RadarHacked;                                       // 0x02C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TOWMapTag;                                         // 0x02C4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TOW_Debug;                                         // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Sent_to_BP_PlayerBase(const struct FSTRUCT_TugOfWar_LevelActions& Struct);
	void InitializePersistentDeltas();
	void UpdatePersistentDeltas();
	void MinMax_Confirm_Specific_Level(const struct FGameplayTag& Counter_Scope, const TMap<struct FGameplayTag, double>& Default_Faction_Control_Weights, bool* Made_Adjustment_);
	void MinMax_Confirmation();
	void Populate_Tow_Map_Tags();
	void Get_Next_Sunday(struct FDateTime* Next_Sunday);
	void Evaluate_Reset_Of__();
	void Get_Map_Faction_Control_Values(bool Current_map_, const struct FGameplayTag& Map_Tag, TMap<struct FGameplayTag, double>* Results);
	void Valid_Faction_(const struct FGameplayTag& Map, const struct FGameplayTag& Faction, bool Output_Debug_on_Invalid_, bool* Valid_);
	void Faction___Adjust_for_the_ATTACKER(const struct FGameplayTag& Attacker_Tag, double Damage);
	void Faction___Adjust_for_the_VICTIM(const struct FGameplayTag& Victim_Tag, double Damage);
	void Manage_Active_AI();
	void Confirm_all_maps_are_within_clamps(bool* Success_);
	void Confirm_Min_and_Max();
	void Enable_Markers_for_this_player(class AFWPlayerStateBase* Player, const TMap<struct FGameplayTag, struct FTimespan>& Markers);
	void Evaluate_Active_TOW_Markers(struct FSTRUCT_TugOfWar_Keys* Active_TOW_Markers, struct FSTRUCT_TOWTableRows* Returned_Rows);
	void Determine_Valid_Players(bool All_Players_, TArray<class AFWPlayerStateBase*>* Valid_Players);
	void Set_Marker_for_Valid_Players(TArray<class AFWPlayerStateBase*>& Players, const TMap<struct FGameplayTag, struct FTimespan>& Makrers_to_Set);
	void INTERNAL_Activate_Marker(const struct FSTRUCT_TugOfWar_LevelActions& Tug_of_War_to_Activate);
	void ReceiveBeginPlay();
	void Player_Has_Joined();
	void Retry_Game_State();
	void SERVER_INTERNAL_Activate_Marker(const struct FSTRUCT_TugOfWar_LevelActions& Tug_Of_War);
	void Activate_Markers(const struct FDataTableRowHandle& DataTable);
	void Change_Level___via_Data_Table(const struct FDataTableRowHandle& Data_Table);
	void INTERNAL_Change_Level___by_Data_Table(const struct FDataTableRowHandle& Data_Table);
	void SERVER_INTERNAL_Change_Level___by_Data_Table(const struct FDataTableRowHandle& Data_Table);
	void Change_Level___MANUAL(const struct FGameplayTag& Map_Tag, const struct FGameplayTag& Faction_Tag, double Percent_Change);
	void SERVER_Change_Level___MANUAL(const struct FGameplayTag& Map_Tag, const struct FGameplayTag& Faction_Tag, double Percent_Change);
	void Tracked_Actor_Took_Damage(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void Re_Enable_Populate_Active_AI();
	void Replicate_Change_Faction__(const struct FGameplayTag& Scope_Map_Tag, const struct FGameplayTag& Faction_Tag, double Delta_Percentage_Points);
	void SERVER_Replicate_Change_Faction__(const struct FGameplayTag& Scope_Map_Tag, const struct FGameplayTag& Faction_Tag, double Delta_Percentage_Points);
	void CLIENTS_Replicate_Change_Faction__(const struct FGameplayTag& Scope_Map_Tag, const struct FGameplayTag& Faction_Tag, double Delta_Percentage_Points);
	void Reset_TOW(class UFWPersistenceSubsystem* Subsystem, const struct FDateTime& ExpectedOccurrence, const struct FTimespan& PastDue, int64 OccurrenceCount);
	void Backup_for_MinMax_Handler(double Time);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void From_BP_PlayerBase_Activate_Marker(const struct FSTRUCT_TugOfWar_LevelActions& Tug_Of_War);
	void DEBUGTOWmarkers();
	void ExecuteUbergraph_BPC_TugOfWar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_TugOfWar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_TugOfWar_C")
	}
	static class UBPC_TugOfWar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_TugOfWar_C>();
	}
};

}

