#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_OctoManager

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_OctoManager.BPC_OctoManager_C
// 0x00B0 (0x0150 - 0x00A0)
class UBPC_OctoManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Manage_Octo;                                       // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWQuest*                               Get_Octo_Quest;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Octo_is_spawned_;                                  // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target_Point_for_Octo_Against_Wall;                // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Possession_Check_Attempts;                         // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target_Point_for_Octo_Near_Chair;                  // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Completed_Lordoss__Quests;                     // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_been_given_final_Lordoss_quest_;               // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Completed_final_Lordoss_quest_;                // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Been_Rewarded_final_Lordoss_quest_;            // 0x00DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Octo_Class_to_Spawn;                               // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Selected_Target_Point;                             // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawned_Near_Wall;                                 // 0x00F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Spawned_Octo;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Checking_Octo;                                     // 0x0100(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Octogirl_Walk_to_Lordoss_Sequence;                 // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Octogirl_Repairs_Lordoss_Sequence;                 // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          On_Lordoss_Back;                                   // 0x0118(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    Octogirl_On_Lordoss__back_Sequence;                // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Orgamech_in_hub_sequence;                          // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Orgamech_missing_bayonett_sequence;                // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Orgamech_v2_sequence;                              // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Delete_Hidden_;                                    // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              SCMM_LS_Mix;                                       // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Check_For_Octo();
	void Cinema_Player(class ALevelSequenceActor* Cinema_to_Play, class ALevelSequenceActor** Cinema_Played, bool* Valid_);
	void Confirm_no_thunderdome(bool* In_Normal_Innards_);
	void Determine_Where_to_Spawn_Octo(bool* Spawned_near_wall_);
	void Evaluate_Cinemas();
	void ExecuteUbergraph_BPC_OctoManager(int32 EntryPoint);
	void Get_Local_Player(class ABP_PlayerBase_C** Local_Player_Base);
	void Handle_Moving_Octo();
	void Hide_all_but_one_LS(class ALevelSequenceActor* Sequence_to_show, bool Loop_Shown_, TArray<class ALevelSequenceActor*>& Sequences_to_hide, bool Delete_Hidden__0);
	void Hide_Show_Octo_Based_on_Lordoss_Back();
	void HideOtherLordoss_for_Octogirl_Walk();
	void Octogirl_Cinema_Ended();
	void Play_Cinema_(bool* Should_play_intro_cinema_);
	void Player_Joined();
	void Re_Evaluate_Cinemas();
	void ReceiveBeginPlay();
	void Repair_Cinema_Done();
	void Repair_Lordoss_Sequence_Hider();
	void Respawn();
	void Retry_Into();
	void Reward_Final_Quest();
	void Reward_repair_quest();
	void Set_cinema_seen();
	void Spawn_Octo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_OctoManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_OctoManager_C")
	}
	static class UBPC_OctoManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_OctoManager_C>();
	}
};

}

