#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_WeaponFireModChecks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_WeaponFireModChecks.BPC_WeaponFireModChecks_C
// 0x0100 (0x01A0 - 0x00A0)
class UBPC_WeaponFireModChecks_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Init_Attempts;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWWeaponBase*                          My_Weapon;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   Weapon_Type_Tags;                                  // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           My_Weapon_Type;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Weapon_Setup_Complete_;                            // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWGamePlayerCharacter*                 My_Player;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWPlayerSkillsComponent*               My_Player_s_Skills_Component;                      // 0x00E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UFWPawnDefinition*                      My_Player_s_Definition;                            // 0x00E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Character_Tag;                                     // 0x00F0(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Collect_Skills_Attempts;                           // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Skill_Value;                                       // 0x0100(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Debug_check_timer;                                 // 0x0108(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWAbilitySystemComponent*              My_Player_s_Ability_Component;                     // 0x0110(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UFWSkillDefinition*>             Rifle_Skills;                                      // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             Shotgun_Skills;                                    // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             GLaunch_Skills;                                    // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             LMG_Skills;                                        // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             SMG_Skills;                                        // 0x0158(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             PST_Skills;                                        // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             HMG_Skills;                                        // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFWSkillDefinition*>             HRF_Skills;                                        // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         New_Player_Setup_Attempts;                         // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_if_owner_is_turret(bool* Is_Turret_);
	void Identify_Player_s_Skills();
	void Identify_Weapon_Type(bool* Weapon_ID_done_);
	void Init_Vars(bool* Is_Player_, bool* Complete_);
	void Ready_D5A4A7584A24A1A195F4A6B805765888(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveBeginPlay();
	void Retry_Init();
	void Collect_Skills();
	void Retry_Collect_Skills();
	void DEBUG_Skill_Check();
	void Check_for_debug_skill_mods();
	void Check_for_new_players();
	void Player_Joined();
	void Report_Gun_Down();
	void ExecuteUbergraph_BPC_WeaponFireModChecks(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_WeaponFireModChecks_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_WeaponFireModChecks_C")
	}
	static class UBPC_WeaponFireModChecks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_WeaponFireModChecks_C>();
	}
};

}

