#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_DisableHKsIfAlreadyActive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_DisableHKsIfAlreadyActive.BPC_DisableHKsIfAlreadyActive_C
// 0x0070 (0x0110 - 0x00A0)
class UBPC_DisableHKsIfAlreadyActive_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Disable_if_HKs_already_active_;                    // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Disable_if_already_HK_d_timer;                     // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HKs_of_my_class;                                   // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         HKs_Bound_to_Event;                                // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          I_started;                                         // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 My_Owner;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   My_Spawned_AI_Class;                               // 0x00E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void Disable_if_HKs_already_active();
	void ExecuteUbergraph_BPC_DisableHKsIfAlreadyActive(int32 EntryPoint);
	void I_spawned_a_unit(class APawn* SpawnedUnit);
	void I_started_my_wave();
	void Other_HK_Spawned(class APawn* SpawnedUnit);
	void Other_HK_Wave_Started();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_DisableHKsIfAlreadyActive_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_DisableHKsIfAlreadyActive_C")
	}
	static class UBPC_DisableHKsIfAlreadyActive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_DisableHKsIfAlreadyActive_C>();
	}
};

}

