#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_DangerCloseDetect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_DangerCloseDetect.BPC_DangerCloseDetect_C
// 0x0030 (0x00D0 - 0x00A0)
class UBPC_DangerCloseDetect_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 My_Owner;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DangerCloseDetect;                                 // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           Classes_that_don_t_use_this;                       // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          WentAgro;                                          // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Can_I_see_(const struct FVector& Look_At_Location, class AActor* Look_At_Actor, bool* I_can_see);
	void Am_I_looking(const struct FVector& Target_Location, bool* I_am_looking);
	void Shut_down();
	void Detect_Danger_Close_Players();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BPC_DangerCloseDetect(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_DangerCloseDetect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_DangerCloseDetect_C")
	}
	static class UBPC_DangerCloseDetect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_DangerCloseDetect_C>();
	}
};

}

