#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_IncomingDamageMod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_IncomingDamageMod.BPC_IncomingDamageMod_C
// 0x0360 (0x0400 - 0x00A0)
class UBPC_IncomingDamageMod_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Collect_Vars_Attempts;                             // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 My_Owner;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Shotgun_Impact_;                               // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_Damages_;                                      // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RANGE__Point_Blank;                                // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RANGE__Max;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     Damage_Curve;                                      // 0x00D0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Use_Deployable_Weapon_Impact_;                     // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Total_Deployable_Damage_Taken;                     // 0x0160(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<TSoftClassPtr<class UClass>, int32>      Codex_AI_to_Type;                                  // 0x0168(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         My_Codex_Type;                                     // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Stalker_Codex_Box;                                 // 0x01C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MedMech_Codex_Box;                                 // 0x01E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Mother_Courage_Codex_Box;                          // 0x0210(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Rat_King_Codex_Box;                                // 0x0238(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Toothy_Codex_Box;                                  // 0x0260(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Find_Codex_Spot_Attempts;                          // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                codex_Spot;                                        // 0x0290(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Code_Box_to_Spawn;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FGameplayTag> Faction_Tag_to_Faction_Scope;                     // 0x02B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TSoftClassPtr<class UClass>, double>     Codex_AI_to_Disable_Health_Threashold;             // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Codex_Health_Ratio;                                // 0x0350(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CODEX_SPAWNED;                                     // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Orga_Codex_Box;                                    // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 AI_or_Player_doing_damage;                         // 0x0388(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SHOULD_STUN_;                                      // 0x0390(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Opal_Codex_Box;                                    // 0x0398(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Shield_Officer_Codex_Box;                          // 0x03C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         Ignore_4_trace;                                    // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Has_Been_Stunned;                                  // 0x03F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tunnel_Level_(bool* In_Tunnel_);
	void Ignore_These_For_Trace();
	void Fallback_Spot_Find(bool* Fallback_Worked_);
	void Post_Codex__Don_t_Block_Looting();
	void Find_Health_Ratio(TSoftClassPtr<class UClass> Actor);
	void Find_where_to_place_codex(const struct FVector& Starting_Loc, const struct FVector& Location_to_Check, bool* Found_place_);
	void Scale_Deployable_Weapon_Damage(class AActor* Damage_Source, double Damage_in, double* Damage_out);
	void Damaging_Impact(double Damage_in, class UObject* damage_type, class AController* Instigator, class AActor* Damage_Causer, double* Damage_out);
	void Collect_Vars(bool* Complete_);
	void OnLoaded_0A4606E04A836C23B3D4EB88761B6619(TSubclassOf<class UObject> Loaded);
	void OnLoaded_335C2E184094054376285D8F6F3A1EBD(TSubclassOf<class UObject> Loaded);
	void OnLoaded_D4D9DFE04E1CA5CA5B4CA18CF34D4353(TSubclassOf<class UObject> Loaded);
	void OnLoaded_AC1BC5D4400E7439B50717A46E8FA655(TSubclassOf<class UObject> Loaded);
	void OnLoaded_C77545D34ECE3B0B8584E2BDAEF1B9E5(TSubclassOf<class UObject> Loaded);
	void OnLoaded_487C7AC845AFDC9D62AF4899AB9F894A(TSubclassOf<class UObject> Loaded);
	void OnLoaded_8B867E5448A74DDF48D61F9B35B990E8(TSubclassOf<class UObject> Loaded);
	void OnLoaded_A1779BB74B03021DAEF6CA97C63BEFEC(TSubclassOf<class UObject> Loaded);
	void OnLoaded_20D8592B42B038B37E78B59178ADFC66(TSubclassOf<class UObject> Loaded);
	void ReceiveBeginPlay();
	void Retry_Collect__Vars();
	void Calculate_Total_Deploy_Weapon_Damage(double Newest_Damage);
	void CLIENTS_Load_Codex_Box(TSoftClassPtr<class UClass> Codex_Box);
	void Retry_Find_Spot();
	void SERVER_Slam_Faction_Rating(const struct FGameplayTag& Faction_Tag);
	void CLIENTS_Slam_Faction_Rating(const struct FGameplayTag& Faction_Tag);
	void Double_Check_Damage();
	void Death_Codex_BCK();
	void SERVER_Post_Codex();
	void CLIENTS_Post_Codex();
	void Restun();
	void ExecuteUbergraph_BPC_IncomingDamageMod(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_IncomingDamageMod_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_IncomingDamageMod_C")
	}
	static class UBPC_IncomingDamageMod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_IncomingDamageMod_C>();
	}
};

}

