#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_SideQuestManager

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_SideQuestManager.BPC_SideQuestManager_C
// 0x00E8 (0x0188 - 0x00A0)
class UBPC_SideQuestManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Init_Retry;                                        // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HubWorldManager_C*                  My_Manager;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Thunder_Dome;                                   // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ABP_Usable_C*, class FText>        SideQuest_Givers;                                  // 0x00C0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class FName, class FText>                SideQuest_Giver_Quests;                            // 0x0110(0x0050)(Edit, BlueprintVisible)
	class UFWQuest*                               Completed_Quest;                                   // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWGamePlayerCharacter*                 Player;                                            // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      Player_Controller;                                 // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UFWQuest*>                       Loaded_Side_Quests;                                // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Cancelled_2DC7FADB48990058129DE599CA356A53(class UFWPopupWidget* NewPopUp);
	void Check_for_quest_dependancies(const struct FQuestData& Quest, bool* Valid_);
	void Confirm_Loaded_quests();
	void Confirmed_2DC7FADB48990058129DE599CA356A53(class UFWPopupWidget* NewPopUp);
	void Created_2DC7FADB48990058129DE599CA356A53(class UFWPopupWidget* NewPopUp);
	void Dialogue_Closed(class UDialogueWidget* Widget_that_Closed);
	void Display_Side_Quest_Progress(const struct FFWQuestTask& Task);
	void Eval_Giving_Quest(const class FText& Quest_Giver, bool* Quest_Completed_, bool* Already_Has_Quest_, struct FGameplayTag* Existing_Quest_Tag, class UFWQuest** Activated_Quest, class FName* Activated_Quest_Row);
	void Event_Check_Quest_Progress(const struct FGameplayTag& Quest_Tag, class UFWQuest* Activated_Quest, class FName Activated_Quest_Row);
	void Event_Complete_Quest(const struct FGameplayTag& Quest_Tag, class UFWQuest* Activated_Quest, class FName Activated_Quest_Row);
	void ExecuteUbergraph_BPC_SideQuestManager(int32 EntryPoint);
	void Init(bool* Success_);
	void Is_skin_intro_playing_(bool* Sequence_Playing_);
	void Load_all_side_quests(bool* Load_Complete_);
	void Local_Player_Used(class AFWGamePlayerCharacter* Player_0, class AActor* Usable);
	void PreRewardClose(class UDialogueWidget* Widget_that_Closed);
	void Ready_CDD2903F4117AB67803811887FB1E781(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Ready_DDAFF6314F4529F09657FA8195D5EED1(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveBeginPlay();
	void RegisterNewSideQuestGiver(const class ABP_Usable_C*& Useable, const class FText& QuestGiver);
	void Retry_Init();
	void Used(class AActor* Player_That_Used_Me, class AActor* Usable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_SideQuestManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_SideQuestManager_C")
	}
	static class UBPC_SideQuestManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_SideQuestManager_C>();
	}
};

}

