#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MeatManCodexDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MeatManCodexDrop.BPC_MeatManCodexDrop_C
// 0x0020 (0x00C0 - 0x00A0)
class UBPC_MeatManCodexDrop_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MeanMan_Codex__;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Attempts;                                          // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARecastNavMesh*                         Search_Nav_to_Use;                                 // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_MeatManCodexDrop(int32 EntryPoint);
	void Find_Spot_for_Meatman_Codex(bool* Spot_Found_, struct FVector* Spot);
	void ReceiveBeginPlay();
	void Retry();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_MeatManCodexDrop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_MeatManCodexDrop_C")
	}
	static class UBPC_MeatManCodexDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MeatManCodexDrop_C>();
	}
};

}

