#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TargetingEnemyTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_TargetingEnemyTracker.BPC_TargetingEnemyTracker_C
// 0x0050 (0x00F0 - 0x00A0)
class UBPC_TargetingEnemyTracker_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Init_Attempts;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Local_Player_;                                  // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerBase_C*                       My_Player;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWidget_Enemy_Indicator_C*              My_Player_s_Enemy_Indicator_Widget;                // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Foes_Targeting_Me;                                 // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        Closest_Targeting_Enemy_Dist;                      // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Targeting_Check_Dist;                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Foe_Targeting_Me;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Foe_Targeting_Timer;                               // 0x00E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Player_valid_(bool* Valid_);
	void _Hide_the_Widget(bool Show_);
	void Init(bool* Local_Player_, bool* Complete_);
	void ReceiveBeginPlay();
	void Retry_Init();
	void Add_or_Remove_Targeting_Enemy(class AActor* Actor, bool Add_);
	void Iterate_on_Targeting_Enemies();
	void Attempt_Shutdown();
	void Iterate_on_Enemies();
	void Show_Closest_Targeting_Enemy();
	void ExecuteUbergraph_BPC_TargetingEnemyTracker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_TargetingEnemyTracker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_TargetingEnemyTracker_C")
	}
	static class UBPC_TargetingEnemyTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_TargetingEnemyTracker_C>();
	}
};

}

