#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PlayerSaveGames

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"
#include "E_WPN_Config_picatinny_structs.hpp"
#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "FWWeapon_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_PlayerSaveGames.BPC_PlayerSaveGames_C
// 0x0128 (0x01C8 - 0x00A0)
class UBPC_PlayerSaveGames_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APawn*                                  Pawn;                                              // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerSavedInventory_C*             PlayerStash;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWKnownItems*                          KnownItems;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            ExtractedItems;                                    // 0x00C0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	bool                                          UseSpecialSaves;                                   // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Host;                                              // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerLoadout_C*                    PlayerLoadout;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            ExtractedDanglies;                                 // 0x00E0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FString                                 TombStoneSave;                                     // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FSavedContainer>                RecoveredContainers;                               // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSavedFrame>                    RecoveredFrames;                                   // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSavedWeapon>                   RecoveredWeapons;                                  // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSavedItem>                     RecoveredWeaponParts;                              // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFWWaterVault*                          PlayerVault;                                       // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            WaterRowHandles;                                   // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_CustomVendorList_C*                 VendorShoppingLists;                               // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, int32>              RebuyList;                                         // 0x0160(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFWTombStoneSave*                       RelativeTombStone;                                 // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 ScavMuleSaveName;                                  // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AddCraftingItem(const struct FGameplayTag& CraftingGroup, const struct FGameplayTag& CraftingRecipy, bool* StartCrafting);
	void AddItem(const struct FSavedItem& NewItem, int32 Slot);
	void AddItemFromTag(const struct FGameplayTag& Tag, int32 Quantity);
	void AddQuestReward(const struct FDataTableRowHandle& RowHandle, int32 Count, const struct FGameplayTag& ItemContext);
	void AddStashBuddy(const struct FSavedBuddy& Buddy);
	void AddStashContainer(const struct FSavedContainer& Container);
	void AddStashCurrency(TArray<struct FCurrencyDetails>& Currencies);
	void AddStashDangly(const struct FSavedDangly& Dangly, bool* ConvertedToWeapon, class FName* Row);
	void AddStashFrame(const struct FSavedFrame& Frame);
	void AddStashItem(const struct FSavedItem& Item);
	void AddStashItems(const TArray<struct FSavedItem>& NewItems);
	void AddStashRig(const struct FDataTableRowHandle& NewRig);
	void AddStashTestData(TArray<struct FSavedItem>& Items, TArray<struct FSavedWeapon>& Weapons, TArray<struct FSavedDangly>& Danglies, TArray<struct FCurrencyDetails>& Currencies);
	void AddStashWeapon(const struct FSavedWeapon& Weapon);
	void AddToVendorRebuy(const struct FGameplayTag& ItemTag, int32 Quantity);
	void AddVaultCurrency(const struct FCurrencyDetails& NewCurrency);
	void AddVaultItem(const struct FGameplayTag& Item, int32 Quantity);
	void Cancelled_9B09E0E24B970ABCFA3C3BBF7E766428(class UFWPopupWidget* NewPopUp);
	void Cheat_Cash(int64 Value);
	void CheatGachas();
	void CheatItems(int32 Quantity);
	void ClearStash(class UFWPersistenceSubsystem* Subsystem);
	void ClearTombStoneSave();
	void ClearTombStoneTimer();
	void ClearTombStoneTrigger(class UFWPersistenceSubsystem* Subsystem, const struct FDateTime& ExpectedOccurrence, const struct FTimespan& PastDue, int64 OccurrenceCount);
	void CollectCraftingItem(const struct FGameplayTag& CraftingGroup, bool* Removed);
	void Confirmed_9B09E0E24B970ABCFA3C3BBF7E766428(class UFWPopupWidget* NewPopUp);
	void ConvertDisabledWeaponRow(class FName DisabledWeaponRow, class FName* WeaponRow);
	void ConvertStashedWater();
	void ConvertWater(TArray<struct FSavedDangly>& WaterDanglies);
	void Created_9B09E0E24B970ABCFA3C3BBF7E766428(class UFWPopupWidget* NewPopUp);
	void CreateInitialSave();
	void DeconflictLoadout(const struct FDataTableRowHandle& Currency, int32 Cost, TArray<struct FDataTableRowHandle>& Containers, TArray<struct FDataTableRowHandle>& Frames, TArray<struct FDataTableRowHandle>& Weapons, TArray<struct FDataTableRowHandle>& WeaponParts, TArray<struct FSavedItem>& Items, TArray<struct FSavedDangly>& Danglies);
	void DeleteList(const class FString& ListName);
	void DeleteScavMuleSave();
	void DetermineContextTag(const struct FDataTableRowHandle& RowHandle, struct FGameplayTag* Tag);
	void DisplayHostLeaveWarning();
	void ExecuteUbergraph_BPC_PlayerSaveGames(int32 EntryPoint);
	void ExtractLoot(bool TunnelsCheckpointSave_, bool Tunnels_Extract, TArray<struct FDataTableRowHandle>* Items, TArray<struct FDataTableRowHandle>* Danglies);
	void Get_Loadout_Save_Name(class FString* LoadoutSaveName);
	void Get_Rig_Parts_Used(struct FBackpackRigDefaults& Backpack_Rig_Defaults, TArray<struct FSavedContainer>* Containers, TArray<struct FSavedFrame>* Frames);
	void GetAmmoCount(const struct FGameplayTag& AmmoType, TMap<struct FGameplayTag, int32>* AmmoCounts, TArray<struct FDataTableRowHandle>* AmmoRowHandles);
	void GetDefaultRig(struct FDataTableRowHandle* DefaultRig);
	void GetDefaultWeapons(TArray<struct FSavedWeapon>* Weapons);
	void GetKnownItems(class UFWKnownItems** KnownItems_0);
	void GetLoadout(class UBP_PlayerLoadout_C** Player_Loadout);
	void GetLoadoutWeight(double* Weight, double* MaxWeight);
	void GetMagCapacity(int32* PrimaryMagCapacity, int32* SecondaryMagCapacity);
	void GetMedsCount(int32* Medkits);
	void GetNextVendorListIndex(const class FString& BaseName, int32* StartingIndex);
	void GetRig(struct FBackpackRigDefaults* BackpackRig);
	void GetRigDanglyCount(class FName Dangly, int32* Count);
	void GetRigItemCount(class FName Item, int32* Count);
	void GetRigRow(class FName* RigRow);
	void GetSavedVendorBuyLists(const class FString& ListName, struct FFWVendorListItems* VendorList, bool* ListFound);
	void GetSavedVendorLists(const class FString& BaseName, TArray<class FString>* VendorLists);
	void GetSaveGame(class UBP_PlayerSavedInventory_C** Stash);
	void GetSpecifiedCounts(TArray<struct FDataTableRowHandle>& TypeRowHandles, TMap<class FName, struct FSavedItem>* ItemsCount, TMap<class FName, struct FSavedDangly>* DangliesCount);
	void GetStashContainerCount(const class FName& Container, int32* Count);
	void GetStashContainers(TArray<struct FSavedContainer>* Containers);
	void GetStashCurrencies(TArray<struct FCurrencyDetails>* Currencies);
	void GetStashCurrencyCount(const class FName& Currency, int64* Currency_Amount);
	void GetStashDanglies(TArray<struct FSavedDangly>* Danglies);
	void GetStashDangly(const class FName& Key, struct FSavedDangly* Dangly);
	void GetStashDanglyCount(const class FName& Dangly, int32* Quantity);
	void GetStashFrameCount(const class FName& Frame, int32* Count);
	void GetStashFrames(TArray<struct FSavedFrame>* Frames);
	void GetStashItemCount(const class FName& Item, int32* Quantity);
	void GetStashItems(TArray<struct FSavedItem>* Items);
	void GetStashRigs(TArray<struct FDataTableRowHandle>* Rigs);
	void GetStashWeaponCount(const class FName& Weapon, int32* Quantity);
	void GetStashWeapons(TArray<struct FSavedWeapon>* Weapons);
	void GetVaultCount(const struct FDataTableRowHandle& RowHandle, int32* Value);
	void GetVaultCurrency(struct FCurrencyDetails* Currency);
	TMap<struct FGameplayTag, int32> GetVaultItems();
	void GetVaultItemTagFromRow(const struct FDataTableRowHandle& RowHandle, struct FGameplayTag* Tag, bool* TagFound);
	void GetVaultSave(class UFWWaterVault** Vault);
	void GetVendorList(class UBP_CustomVendorList_C** VendorShoppingLists_0);
	void GetVendorRebuyItems(TMap<struct FGameplayTag, int32>* RebuyList_0);
	void GetWeapons(struct FDataTableRowHandle* PrimaryWeapon, class FString* PrimaryNickname, class FString* PrimaryFileName, TArray<struct FFWWeaponDefaults>* PrimaryPartsChanged, struct FDataTableRowHandle* SecondaryWeapon, class FString* SecondaryNickname, class FString* SecondaryFileName, TArray<struct FFWWeaponDefaults>* SecondaryPartsChanged, struct FDataTableRowHandle* ThrowWeapon, class FString* ThrowNickname, class FString* ThrowFileName);
	void GetWeaponSpawnData(class FName RowName, TArray<struct FFWWeaponDefaults>& Parts, TArray<struct FFWModifiedPart>* Changed_Parts, struct FFWModifiedStatsPart* StatsChanged, TArray<class FName>* ChangedRows, struct FFWScopeDefinitions* ScopeDARow);
	void GiveExtractedLootXP(TArray<struct FDataTableRowHandle>& LootedDanglies, TArray<struct FDataTableRowHandle>& LootedItems);
	void Handle_Water_Overflow(class UFWPersistenceSubsystem* Subsystem, int32 WaterBarrelCount);
	void HandleUnsafeLeave();
	void Has_Stash_Item(const class FName& Item, bool* HasItem);
	void HasStashContainer(const class FName& Container, bool* HasItem);
	void HasStashDangly(const class FName& Dangly, bool* HasDangly);
	void HasStashFrame(const class FName& Frame, bool* HasItem);
	void HasStashItemByTag(const struct FGameplayTag& Item, int32* Count);
	void HasStashWeapon(const class FName& Weapon, bool* HasItem);
	void HasXStashDangly(const class FName& Dangly, int32 Count, bool* HasDangly);
	void HasXStashItem(const class FName& Item, int32 Count, bool* HasItem);
	void HasXStashWeapon(const class FName& Weapon, int32 Count, bool* HasItem);
	void Is_skin_intro_playing_(bool* Sequence_Playing_);
	void IsCraftingItem(const struct FGameplayTag& CraftingGroup, const struct FGameplayTag& CraftingRecipy, bool* CraftingGroupActive, bool* IsCrafting);
	void ItemsExtracted(const TArray<struct FDataTableRowHandle>& ExtractedItem, const TArray<struct FDataTableRowHandle>& ExtractedDanglies_0);
	void LoadHUBLoadout();
	void LoadPlayerLoadout();
	void LoadScavMuleData(TArray<struct FContainerItem>* Mule_Items, TArray<struct FDataTableRowHandle>* Mule_Danglies);
	void OnMessageReceived_6F470716457878B0DD37B8AD4BDBFAF9(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void PlayerDied();
	void QuestAccepted(class UFWQuest* Quest);
	void Ready_F066582F4AF2534D47AC7391CC92D9E8(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReadyRoomWeapon(const struct FDataTableRowHandle& DanglyRow, class UBP_PlayerLoadout_C* Loadout, int32 Weapon, class APlayerState* PlayerState);
	void ReceiveBeginPlay();
	void RemoveFromVendorRebuy(const struct FGameplayTag& ItemTag, int32 Quantity);
	void RemoveLoadoutDangly(const struct FDataTableRowHandle& Dangly);
	void RemoveLoadoutItem(int32 Socket, const struct FSavedItem& Item);
	void RemoveQuestItems(const struct FSavedItem& Item);
	void RemoveRigParts();
	void RemoveStashBuddy(const struct FSavedBuddy& Buddy);
	void RemoveStashContainer(const struct FSavedContainer& Container);
	void RemoveStashCurrency(TArray<struct FCurrencyDetails>& RemoveCurrencies);
	bool RemoveStashDangly(const struct FSavedDangly& Dangly);
	void RemoveStashFrame(const struct FSavedFrame& Frame);
	bool RemoveStashItem(const struct FSavedItem& Item);
	void RemoveStashItemByTag(const struct FGameplayTag& Item, int32 Count);
	bool RemoveStashWeapon(const struct FSavedWeapon& Weapon);
	void RemoveVaultCurrency(const struct FCurrencyDetails& NewCurrency);
	void RemoveVaultItem(const struct FGameplayTag& Item, int32 Quantity);
	void RemoveVaultQuestItems(const struct FSavedItem& Item);
	void ResetSave(class UFWPersistenceSubsystem* Subsystem);
	void RestoreRigParts(class FName RowName, const struct FBackpackRigDefaults& BackpackRig);
	void RestoreWeaponParts(class FName RowName, TArray<struct FFWWeaponDefaults>& Parts);
	void RetrieveTombstone();
	void RetrieveTombstoneWithBot(int32* NewDroneCount);
	void SaveList(const class FString& ListName, const struct FFWVendorListItems& List);
	void Scav_Mule_Extract(class AFWGamePlayerCharacter* PlayerPawn, bool TunnelsExtract);
	void ScopedRegionDeath(const class FString& Map);
	void ScopedRegionEntry(const class FString& Map);
	void ScopedRegionExtract(const class FString& Map);
	void Set_Loadout_Items(const TMap<int32, struct FBackpackContainerInfo>& ContainerItems);
	void SetCharacterRig(const struct FBackpackRigDefaults& CustomSettings, class FName RigRowFromDataTable);
	void SetCharacterWeapons(const struct FDataTableRowHandle& Primary, const TArray<struct FFWModifiedPart>& PrimayModifiedParts, const struct FFWModifiedStatsPart& PrimaryModifiedStats, const struct FFWScopeDefinitions& PrimaryScopeDA, const struct FDataTableRowHandle& Secondary, const TArray<struct FFWModifiedPart>& SecondaryModifiedParts, const struct FFWModifiedStatsPart& SecondaryModifiedStats, const struct FFWScopeDefinitions& SecondaryScopeDA, const struct FDataTableRowHandle& Throw);
	void SetPawn(class APawn* Pawn_0);
	void SetReadyRoom(class APlayerState* PlayerState, bool* Return);
	void SetRig(const struct FBackpackRigDefaults& BackpackRig, class FName RigRow);
	void SetWeapon(EFWWeaponSlot WeaponSlot, const struct FDataTableRowHandle& Weapon_Weapon_Row_Handle, const class FString& Nickname, const class FString& Filename, TArray<struct FFWWeaponDefaults>& ChangedParts);
	void Spawn_Previous_Run_Items(class UFWTombStoneSave* TombStoneSave_0, bool bHadDied);
	void SpawnPreviousDangly(const struct FVector& Location, class UClass* Class_0);
	void SpawnPreviousItems(const struct FVector& Location, class UClass* Class_0, TArray<struct FSavedItem>& Items);
	void UnloadLoadout(bool* ConvertedToWeapon, TMap<class FName, struct FSavedItem>* Stashed_Ammo, TMap<class FName, struct FSavedWeapon>* StashedWeapons, TMap<class FName, struct FSavedItem>* StashedItems, TMap<class FName, struct FSavedDangly>* StashedDanglies);
	void UnloadWater();
	void UpdateLoadoutDangly(int32 Socket, const struct FSavedDangly& Dangly, bool Loose_);
	void UpdateLoadoutMultiDangly(int32 Socket, int32 SlotIndex, const struct FSavedDangly& Dangly);
	void UpdatePlayerLoadout();
	void UpdateVault();
	void ValidateLoadout(const struct FGameplayTag& CharacterTag, bool* Valid);
	void ValidateQuests();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_PlayerSaveGames_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_PlayerSaveGames_C")
	}
	static class UBPC_PlayerSaveGames_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_PlayerSaveGames_C>();
	}
};

}

