#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PhotoMode

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "S_PostProcessFilter_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_CameraModes_structs.hpp"
#include "E_ColorGradingMode_structs.hpp"
#include "E_PauseGameMethod_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_Logos_structs.hpp"
#include "S_InputKeys_structs.hpp"
#include "InputCore_structs.hpp"
#include "S_PostProcessRendering_structs.hpp"
#include "S_PhotoResolutions_structs.hpp"
#include "E_ScreenshotMethod_structs.hpp"
#include "S_PhotoModeIsOnConfis_structs.hpp"
#include "E_InputMode_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "E_SaveSort_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_PhotoMode.BPC_PhotoMode_C
// 0x23C0 (0x2460 - 0x00A0)
class UBPC_PhotoMode_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_PhotoMode_C*                        PhotoModeWidgetRef;                                // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             PlayerRef;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArmRef;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CameraRef;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsUsingPhotoMode;                                 // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPauseGameInPhotoMode;                             // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bApplyMenuColor;                                   // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            MenuColor;                                         // 0x00CC(0x0014)(Edit, BlueprintVisible)
	bool                                          bPauseGameInGallery;                               // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PauseGameMethod                             PauseGameMethod;                                   // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CameraModes                                 CameraModes;                                       // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PhotoModeViewportZOrder;                           // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowMouseCursorByDefault;                         // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowPhotoResolutionOption;                        // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowMouseCursorOption;                            // 0x00EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFreeCameraOption;                                 // 0x00EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMaximumDistanceLimit;                          // 0x00EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FreeCameraMaximumDistance;                         // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstPersonGame;                                // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowTakePictureOption;                            // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetControlRotationAfterClosingPM;               // 0x00FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxUpDownCameraDistance;                           // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxLeftRightCameraDistance;                        // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_Logos>                       GameLogos;                                         // 0x0110(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_PostProcessFilter>           Filters;                                           // 0x0120(0x0010)(Edit, BlueprintVisible)
	double                                        DefaultFOV;                                        // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultCameraRotation;                             // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FPostProcessSettings                   DefaultPostProcess;                                // 0x0150(0x06F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsUsingGallery;                                   // 0x0840(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_841[0xF];                                      // 0x0841(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   DefaultPhotoModePostProcess;                       // 0x0850(0x06F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPostProcessSettings                   MenuPhotoModePostProcess;                          // 0x0F40(0x06F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         GamepadIconsDTIndex;                               // 0x1630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1634[0x4];                                     // 0x1634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InputKeys                           TakeScreenshotKeys;                                // 0x1638(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           OpenGalleryKeys;                                   // 0x1668(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           HideMenuKeys;                                      // 0x1698(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           ResetValuesKeys;                                   // 0x16C8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           NextTabKeys;                                       // 0x16F8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           PrevTabKeys;                                       // 0x1728(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           OpenClosePhotoModeKeys;                            // 0x1758(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           ClosePhotoModeWithAnotherKey;                      // 0x1788(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           ShowOrHideMouseCursorKeys;                         // 0x17B8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           OpenFreeCameraKeys;                                // 0x17E8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           UpCameraKeys;                                      // 0x1818(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           DownCameraKeys;                                    // 0x1848(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   LastKey;                                           // 0x1878(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        DefaultSpringArmLength;                            // 0x1890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMouseCursor;                                      // 0x1898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1899[0x7];                                     // 0x1899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_PostProcessRendering>        PostProcessMaterials;                              // 0x18A0(0x0010)(Edit, BlueprintVisible)
	struct FVector                                DefaultSocketOffset;                               // 0x18B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ScreenshotMethod                            ScreenshotMethod;                                  // 0x18C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUseCustomScreenshotFolder;                        // 0x18C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_18CA[0x6];                                     // 0x18CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomScreenshotFolderPath;                        // 0x18D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class APlayerController*                      PlayerControllerRef;                               // 0x18E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableGallery;                                    // 0x18E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E9[0x7];                                     // 0x18E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Gallery_C*                          GalleryWidgetRef;                                  // 0x18F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_InputKeys                           NextPageKeys__Gallery_;                            // 0x18F8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           PrevPageKeys__Gallery_;                            // 0x1928(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           FullscreenKeys__Gallery_;                          // 0x1958(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           BackKeys__Gallery_;                                // 0x1988(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           ShowMouseKeys__Gallery_;                           // 0x19B8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bAutoSizePerTab;                                   // 0x19E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocusWhenHoveringOverSlider;                      // 0x19E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19EA[0x6];                                     // 0x19EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PhotoModeIsOnConfis                 PhotoModeIsOnWarning;                              // 0x19F0(0x0060)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	struct FRotator                               DefaultControlRotation;                            // 0x1A50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bExistingPostProcess;                              // 0x1A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A69[0x7];                                     // 0x1A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PostProcessVolumeClass;                            // 0x1A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsUnbound;                                        // 0x1A78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A79[0x7];                                     // 0x1A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   OriginalPostProcess;                               // 0x1A80(0x06F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        GlobalTimeDilationBackup;                          // 0x2170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_InputMode                                   InputModeAfterClosingPhotoMode;                    // 0x2178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowAlbumOption;                                  // 0x2179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_217A[0x6];                                     // 0x217A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentTimeDilation;                               // 0x2180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_InputKeys                           LeftCameraKeys;                                    // 0x2188(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           RightCameraKeys;                                   // 0x21B8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_InputKeys                           OpenPhotoModeKeys__Gallery_;                       // 0x21E8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double CurrentTimeDilation)> PhotoModeOpened;                      // 0x2218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PhotoModeClosed;                                   // 0x2228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bShowCharacterRotationOption;                      // 0x2238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bControllerTickBackup;                             // 0x2239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableControllerInputOnFreeCamera;               // 0x223A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisablePawnInputOnFreeCamera;                     // 0x223B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsYourSpringArmTickableWhenPaused;                // 0x223C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsYourCameraTickableWhenPaused;                   // 0x223D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223E[0x2];                                     // 0x223E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& PhotoPath, const class FString& ThumbPath)> PhotoTaken; // 0x2240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_CustomPostProcess_C*                CustomPostProcessManager;                          // 0x2250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_PhotoResolutions>            PhotoResolutions;                                  // 0x2258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIncludeDefaultScreenResolutionOption;             // 0x2268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIncludePhotoWithUIOption;                         // 0x2269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226A[0x6];                                     // 0x226A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, double>                   Apertures;                                         // 0x2270(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_ColorGradingMode                            ColorGradingMode;                                  // 0x22C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C1[0x7];                                     // 0x22C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultFocalLength;                                // 0x22C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraFocusSettings                   DefaultFocusSettings;                              // 0x22D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DefaultAperture;                                   // 0x2330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, TSoftObjectPtr<class UTexture2D>> Borders;                                   // 0x2338(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_SaveSort                                    SavePhotosSort;                                    // 0x2388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2389[0x7];                                     // 0x2389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ABP_FreeCamera_C* FreeCameraReference)> OnFreeCameraStart;   // 0x2390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFreenCameraEnd;                                  // 0x23A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ETraceTypeQuery                               FocusCollisionType;                                // 0x23B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_23B1[0x7];                                     // 0x23B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InputKeys                           ExtraFunctionDeleteKeys__Gallery_;                 // 0x23B8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        RotationSensitivity;                               // 0x23E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationInterpolationSpeed;                        // 0x23F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSensitivity;                               // 0x23F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementInterpolationSpeed;                        // 0x2400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowCustomMotionBlur;                            // 0x2408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2409[0x7];                                     // 0x2409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UPrimitiveComponent*, bool>        CustomDepthComponents;                             // 0x2410(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Calculate_Weight_by_Ref(class APostProcessVolume* PostProcessVolume, double& PropertyTotal, double& PropertyCount, double PropertyValue, double DistanceWeight);
	void Create_Post_Process();
	void ExecuteUbergraph_BPC_PhotoMode(int32 EntryPoint);
	void Get_Active_Camera(class UCameraComponent** CurrentCamera, class USpringArmComponent** CurrentSpringArm);
	void GetCameraLocation(struct FVector* CameraLocation);
	void GetCameraManager(class APlayerCameraManager** PlayerCameraManager);
	void getScreenshotPath(class FString* FullPath);
	void GetSliderCameraDistance(double* CameraDistance);
	void GetSliderFOV(double* FOV);
	void GetSliderRoll(double* Roll);
	void IconSelector___Gallery(const struct FKey& Key);
	void IconSelector___Photo_Mode_Menu(const struct FKey& Key);
	void InitWidgets();
	void OpenGallery(const struct FKey& LastKey_0);
	void Photo_Mode(const struct FKey& Key);
	void ReceiveBeginPlay();
	void ResetGallery();
	void ResetPhotoMode();
	void UnpausedGameAxisMovementControl(double AxisValueIn, double* AxisValueOut);
	void UpdateOutputFolder(const class FString& Custom_Path);
	void UpdateReferences(bool bCheckWidgets);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_PhotoMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_PhotoMode_C")
	}
	static class UBPC_PhotoMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_PhotoMode_C>();
	}
};

}

