#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MaterialSwap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MaterialSwap.BPC_MaterialSwap_C
// 0x0068 (0x0108 - 0x00A0)
class UBPC_MaterialSwap_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Do_Material_Swap_;                                 // 0x00A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMaterialInterface*, class UMaterialInstance*> MatSwapMap;                            // 0x00B0(0x0050)(Edit, BlueprintVisible)
	class AActor*                                 My_Owner;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CLIENTS_Material_Swap();
	void ExecuteUbergraph_BPC_MaterialSwap(int32 EntryPoint);
	void MaterialSwap();
	void ReceiveBeginPlay();
	void SERVER_Material_Swap();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_MaterialSwap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_MaterialSwap_C")
	}
	static class UBPC_MaterialSwap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MaterialSwap_C>();
	}
};

}

