#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_WeaponLaserFlashlightTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_WeaponLaserFlashlightTracker.BPC_WeaponLaserFlashlightTracker_C
// 0x00B8 (0x0158 - 0x00A0)
class UBPC_WeaponLaserFlashlightTracker_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_ADStracker_C*                      Weapon_s_ADS_Tracker;                              // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          In_ADS_;                                           // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_OTH_;                                           // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Both_ADS_and_OTH_;                                 // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool In_ADS_, bool In_OTH_, bool In_Both_, bool Weapon_Equipped_, bool ADS_Button_Held_)> WeaponAimState; // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UStaticMeshComponent*>           Attached_Flashlights;                              // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          WeaponEquipped_;                                   // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           Attached_Laser_Sights;                             // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ABP_Flashlight_00_C*>            SpawnedFlashlights;                                // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class FName                                   Flashlight_Attachment_Socket;                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Laser_Attachment_Socket;                           // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ADS_Button_;                                       // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool In_ADS_, bool In_OTH_, bool In_Both_, bool Weapon_Equipped_, bool ADS_Button_Held_)> WeaponStateStatusChenged_Dispatch; // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 Laser_Class;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 Weapon_Owner_s_FWWeapon_Component;                 // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Equipped_timer;                                    // 0x0138(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 My_Weapon;                                         // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Spawned_Laser_Objects;                             // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void Collect_Flashlights_and_Lasers();
	void ReceiveBeginPlay();
	void My_Weapon_Entered_ADS(bool In_ADS, bool ADS_Button_Held_);
	void My_Weapon_is_in_OTH(bool In_OTH__0, bool ADS_Button_Held_);
	void Recollect_Parts();
	void Equipped_(bool Equipped__0);
	void Weapon_State_Status_Changed(bool In_ADS__0, bool In_OTH__0, bool In_Both_, bool Weapon_Equipped_, bool ADS_Button_Held_);
	void SERVER_Enable_Flashlight();
	void CLIENTS_Enable_Flashlight();
	void SERVER_Disable_Flashlight();
	void CLIENTS_Disable_Flashlight();
	void Monitor_Equipped();
	void ExecuteUbergraph_BPC_WeaponLaserFlashlightTracker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_WeaponLaserFlashlightTracker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_WeaponLaserFlashlightTracker_C")
	}
	static class UBPC_WeaponLaserFlashlightTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_WeaponLaserFlashlightTracker_C>();
	}
};

}

