#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Explosion_ExplosiveBarrel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_Explosion_ExplosiveBarrel.BPC_Explosion_ExplosiveBarrel_C
// 0x0040 (0x00E0 - 0x00A0)
class UBPC_Explosion_ExplosiveBarrel_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 MyOwner;                                           // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialComp;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SphereCollision;                                   // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Damage;                                        // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor_that_Blew_Me_Up;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_Explosion_SC;                                   // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerToDamage;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CLIENTS_DeathFX();
	void ExecuteUbergraph_BPC_Explosion_ExplosiveBarrel(int32 EntryPoint);
	void Explode();
	void IdentifyActor(class AActor* Actor_that_attacked_me);
	void Init(class URadialForceComponent* RadialComp_0, class USphereComponent* SphereCollision_0, double Max_Damage_0);
	void ReceiveBeginPlay();
	void SERVER_DeathFX();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_Explosion_ExplosiveBarrel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_Explosion_ExplosiveBarrel_C")
	}
	static class UBPC_Explosion_ExplosiveBarrel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_Explosion_ExplosiveBarrel_C>();
	}
};

}

