#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_BarItemManager

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_BarItemManager.BPC_BarItemManager_C
// 0x0100 (0x01A0 - 0x00A0)
class UBPC_BarItemManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWQuest*                               Bar_Quest;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Bartender_Supplies_Spawn_Loc_Soft;                 // 0x00B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 Bartender_Supplies_Spawn_Loc;                      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_SpawnBartenderSupplies_C*           Bartender_Supply_Spawn_Loc;                        // 0x00E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Existing_Supplies_Soft;                            // 0x00E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 Existing_Supplies;                                 // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Booze_Container_Levels;                            // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Booze_Container_Chance_to_spawn;                   // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Booze_Drop_Spawn_Loc_Soft;                         // 0x0130(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 Booze_Drop_Spawn_Loc;                              // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Booze_Container_Soft;                              // 0x0160(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 Booze_Container;                                   // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SpawnUnlockedBooze_C*>       Used_Spawn_Points;                                 // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void Load_Booze_Drop_Containers();
	void Load_Bartender_Supplies();
	void Ready_36223CB14F7022C27CCB929C4C1BC3DC(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveBeginPlay();
	void Spawn_Bartending_Supplies();
	void Retry_Bartending_Supplies();
	void Spawn_();
	void Booze_Container_OnPlayerJoined_Event();
	void Spawn_Booze_Here();
	void Retry_Booze_Container_Logic();
	void Do_spawn_Booze(class AActor* Location_Actor);
	void ExecuteUbergraph_BPC_BarItemManager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_BarItemManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_BarItemManager_C")
	}
	static class UBPC_BarItemManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_BarItemManager_C>();
	}
};

}

