#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ControllerAimAssist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_ControllerAimAssist.BPC_ControllerAimAssist_C
// 0x00A8 (0x0148 - 0x00A0)
class UBPC_ControllerAimAssist_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_PlayerBase_C*                       My_Player;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Controller_Timer;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Analog_stick_;                                     // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Look_X;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Look_Y;                                            // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Look_Deadzone;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Move_X;                                            // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Move_Y;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Move_Deadzone;                                     // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_Speed;                                      // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DEFAULT_PITCH;                                     // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DEFAULT_YAW;                                       // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Collect_Attempts;                                  // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Button_Mash_Count;                                 // 0x0104(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Track_Button_Mash_;                                // 0x0108(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Button_Mash_Count)> Mash_Update;                             // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           Button_Mash_Timer;                                 // 0x0120(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   Button_Mash_Abilities;                             // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Max_Mash;                                          // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count_Per_Mash;                                    // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Alt_Ability_Key_Held;                              // 0x0140(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Always_Use_Analog_Assist_;                         // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Aim_Assist_On_;                                    // 0x0142(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Confirm_Hit(const struct FHitResult& Potential_Target, bool* Hit_Confirmed_);
	void Have_Stamina_(bool* Has_Stamina_);
	void Legal_input_for_mash(const struct FKey& Key, bool* Button_legal_);
	void Confirm_Mash_is_below_Max(bool* Below_Max_);
	void Confirm_Button_Mash(bool* Can_Mash);
	void In_a_valid_Aim_Assist_Mode_(bool* In_valid_mode_);
	void Collect_Look_Defaults(bool* Collected_);
	void Restore_Look_Speed();
	void Slow_Look_Speed(bool Dead_Center_);
	void Is_Trace_Allowed_(bool* Trace_Allowed_);
	void Confirm_Local_Player(bool* Local_Player_);
	void Auto_Aim_Rotation(const struct FHitResult& Trace_hit_result, bool Dead_Center_);
	void Auto_Aim_Trace(double Radius, bool* Hit_illegal_target_, bool* Hit_, struct FHitResult* Out_Hit);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_ThumbMouseButton_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_ThumbMouseButton_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ReceiveBeginPlay();
	void Contoller_Aim_Assist();
	void Using_Look_Stick(bool Using_Controller, double Look_X_0, double Look_Y_0, double Move_X_0, double Move_Y_0);
	void Retry_Collect();
	void SERVER_Button_Mash();
	void SERVER_Button_Mash_Force_Value(int32 Value);
	void Force_Value(int32 Value);
	void Allow_Mash_Toggle(bool Allow_Mash_);
	void SERVER_Allow_Mash_Toggle(bool Allow_Mash_);
	void Mash_Timer();
	void Button_Mash_Update(int32 Mash_Value);
	void ExecuteUbergraph_BPC_ControllerAimAssist(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ControllerAimAssist_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ControllerAimAssist_C")
	}
	static class UBPC_ControllerAimAssist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ControllerAimAssist_C>();
	}
};

}

