#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_RigAnim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_RigAnim.BPI_RigAnim_C.ChangeBoneActiveStatus
// 0x0008 (0x0008 - 0x0000)
struct BPI_RigAnim_C_ChangeBoneActiveStatus final
{
public:
	int32                                         BoneIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewActiveStatus;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_RigAnim.BPI_RigAnim_C.ChangePhysicsEnabled
// 0x0001 (0x0001 - 0x0000)
struct BPI_RigAnim_C_ChangePhysicsEnabled final
{
public:
	bool                                          Enable_;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_RigAnim.BPI_RigAnim_C.SetupBoneTransform
// 0x0038 (0x0038 - 0x0000)
struct BPI_RigAnim_C_SetupBoneTransform final
{
public:
	int32                                         BoneIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneLocation;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BoneRotation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

