#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Playfab

#include "Basic.hpp"

#include "E_SquadPermissions_structs.hpp"
#include "E_LobbyTypes_structs.hpp"
#include "E_ServerMigration_structs.hpp"


namespace SDK::Params
{

// Function BPI_Playfab.BPI_Playfab_C.CreateLobby
// 0x0001 (0x0001 - 0x0000)
struct BPI_Playfab_C_CreateLobby final
{
public:
	E_ServerMigration                             ServerType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_Playfab.BPI_Playfab_C.IsAnyServerSelected
// 0x0001 (0x0001 - 0x0000)
struct BPI_Playfab_C_IsAnyServerSelected final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_Playfab.BPI_Playfab_C.PromoteToHost
// 0x0004 (0x0004 - 0x0000)
struct BPI_Playfab_C_PromoteToHost final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_Playfab.BPI_Playfab_C.ServerBlockedPlayer
// 0x0004 (0x0004 - 0x0000)
struct BPI_Playfab_C_ServerBlockedPlayer final
{
public:
	int32                                         Player_ID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_Playfab.BPI_Playfab_C.ServerKickedPlayer
// 0x0004 (0x0004 - 0x0000)
struct BPI_Playfab_C_ServerKickedPlayer final
{
public:
	int32                                         PlayerId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_Playfab.BPI_Playfab_C.SetLobbyInviteType
// 0x0001 (0x0001 - 0x0000)
struct BPI_Playfab_C_SetLobbyInviteType final
{
public:
	E_SquadPermissions                            SquadPermission;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_Playfab.BPI_Playfab_C.SetLobbySearchType
// 0x0001 (0x0001 - 0x0000)
struct BPI_Playfab_C_SetLobbySearchType final
{
public:
	E_LobbyTypes                                  LobbyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

