#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ClientRestartGame

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BPI_ClientRestartGame.BPI_ClientRestartGame_C.AddLootToCompass
// 0x0008 (0x0008 - 0x0000)
struct BPI_ClientRestartGame_C_AddLootToCompass final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_ClientRestartGame.BPI_ClientRestartGame_C.GetMainMenuMaster
// 0x0008 (0x0008 - 0x0000)
struct BPI_ClientRestartGame_C_GetMainMenuMaster final
{
public:
	class UUserWidget*                            MainMenu;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_ClientRestartGame.BPI_ClientRestartGame_C.RemoveAllTrackedEnemy
// 0x0008 (0x0008 - 0x0000)
struct BPI_ClientRestartGame_C_RemoveAllTrackedEnemy final
{
public:
	struct FGameplayTag                           FactionTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_ClientRestartGame.BPI_ClientRestartGame_C.RemoveLootFromCompass
// 0x0008 (0x0008 - 0x0000)
struct BPI_ClientRestartGame_C_RemoveLootFromCompass final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_ClientRestartGame.BPI_ClientRestartGame_C.RemoveMenu
// 0x0001 (0x0001 - 0x0000)
struct BPI_ClientRestartGame_C_RemoveMenu final
{
public:
	bool                                          bRemoved;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_ClientRestartGame.BPI_ClientRestartGame_C.ShowMenu
// 0x0004 (0x0004 - 0x0000)
struct BPI_ClientRestartGame_C_ShowMenu final
{
public:
	int32                                         MenuIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

