#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PlayerDebug

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_PlayerDebug.BPI_PlayerDebug_C.GetSettings
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerDebug_C_GetSettings final
{
public:
	bool                                          InfinateAmmo;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InfinateHealth;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          YAxisInverted;                                     // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Sensitivity;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_PlayerDebug.BPI_PlayerDebug_C.SetInfinateAmmo
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerDebug_C_SetInfinateAmmo final
{
public:
	bool                                          InfinateAmmo;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_PlayerDebug.BPI_PlayerDebug_C.SetInfinateHealth
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerDebug_C_SetInfinateHealth final
{
public:
	bool                                          InfinateHealth;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_PlayerDebug.BPI_PlayerDebug_C.SetInvertYAxis
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerDebug_C_SetInvertYAxis final
{
public:
	bool                                          InvertYAxis;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_PlayerDebug.BPI_PlayerDebug_C.SetPlayerSensitivity
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerDebug_C_SetPlayerSensitivity final
{
public:
	double                                        Sensitivity;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

