#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_GameInstanceDebug

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.GetMasterSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_GetMasterSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.GetMusicSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_GetMusicSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.GetSFXSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_GetSFXSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.GetVOSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_GetVOSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.SetMasterSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_SetMasterSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.SetMusicSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_SetMusicSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.SetSFXSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_SetSFXSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceDebug.BPI_GameInstanceDebug_C.SetVOSound
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceDebug_C_SetVOSound final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

