#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_UIItemsInterface

#include "Basic.hpp"

#include "FWInventory_structs.hpp"


namespace SDK::Params
{

// Function BPI_UIItemsInterface.BPI_UIItemsInterface_C.GetItemDetails
// 0x0260 (0x0260 - 0x0000)
struct BPI_UIItemsInterface_C_GetItemDetails final
{
public:
	bool                                          Found_;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemDetails                  ItemDetails;                                       // 0x0010(0x0240)(Parm, OutParm)
	int32                                         Count;                                             // 0x0250(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_UIItemsInterface.BPI_UIItemsInterface_C.GetItemIndex
// 0x0004 (0x0004 - 0x0000)
struct BPI_UIItemsInterface_C_GetItemIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_UIItemsInterface.BPI_UIItemsInterface_C.IsCurrency
// 0x0001 (0x0001 - 0x0000)
struct BPI_UIItemsInterface_C_IsCurrency final
{
public:
	bool                                          IsCurrency_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

