#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CustomItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWInventory_structs.hpp"


namespace SDK::Params
{

// Function BPI_CustomItem.BPI_CustomItem_C.AddCount
// 0x0004 (0x0004 - 0x0000)
struct BPI_CustomItem_C_AddCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_CustomItem.BPI_CustomItem_C.GetItemData
// 0x0018 (0x0018 - 0x0000)
struct BPI_CustomItem_C_GetItemData final
{
public:
	struct FSavedItem                             Data;                                              // 0x0000(0x0018)(Parm, OutParm, NoDestructor)
};

// Function BPI_CustomItem.BPI_CustomItem_C.ItemFullyStacked?
// 0x0008 (0x0008 - 0x0000)
struct BPI_CustomItem_C_ItemFullyStacked_ final
{
public:
	bool                                          FullStack;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Missing;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_CustomItem.BPI_CustomItem_C.ItemTypeMatches
// 0x0018 (0x0018 - 0x0000)
struct BPI_CustomItem_C_ItemTypeMatches final
{
public:
	struct FDataTableRowHandle                    ItemRow;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Match;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

