#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_TANK_AimMainGun

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_TANK_AimMainGun.BTS_TANK_AimMainGun_C
// 0x00D0 (0x0168 - 0x0098)
class UBTS_TANK_AimMainGun_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetPawn;                                        // 0x00A0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FBlackboardKeySelector                 TurretRot;                                         // 0x00C8(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FBlackboardKeySelector                 TargetLocation;                                    // 0x00F0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FRotator                               MGRot;                                             // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        Closest_Visible_Dist;                              // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Closest_Visible;                                   // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AAIC_TankBase_C*                        My_Controller;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AI_TankBase_C*                      My_Tank;                                           // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtStart;                                       // 0x0150(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_TANK_AimMainGun(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTS_TANK_AimMainGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTS_TANK_AimMainGun_C")
	}
	static class UBTS_TANK_AimMainGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_TANK_AimMainGun_C>();
	}
};

}

