#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Stalker_Attack

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_Stalker_Attack.BTT_Stalker_Attack_C
// 0x0078 (0x0120 - 0x00A8)
class UBTT_Stalker_Attack_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Target;                                            // 0x00B0(0x0028)(Edit, BlueprintVisible)
	double                                        HeavyAttackChance;                                 // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAITask_MoveTo*                         MoveTask;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  AttackTag;                                         // 0x00E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AttackDistance;                                    // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Attack_Walk_Speed;                             // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_Stalker_Attack(int32 EntryPoint);
	void IsAttackReady(class APawn* Pawn, bool* Ready);
	void IsReadyToMove(bool* Return);
	void OnMoveFinished_6E18640E4E810BA8E8937589B63C2F86(EPathFollowingResult Result, class AAIController* AIController);
	void OnRequestFailed_6E18640E4E810BA8E8937589B63C2F86();
	void PickAttack();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void TriggerAttackAbility(class APawn* Pawn, struct FGameplayTagContainer* AttackTag_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_Stalker_Attack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_Stalker_Attack_C")
	}
	static class UBTT_Stalker_Attack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_Stalker_Attack_C>();
	}
};

}

