#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_TANK_CanGetAGoodShot

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_TANK_CanGetAGoodShot.BTT_TANK_CanGetAGoodShot_C
// 0x0060 (0x0108 - 0x00A8)
class UBTT_TANK_CanGetAGoodShot_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetActor;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class ABP_AI_TankBase_C*                      My_Tank;                                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          Tank_Controller;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Location;                                   // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BBKey_DesiredTargetRange;                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Deny_Main_Gun_Use_on_Players(class UObject* Target, bool* Target_is_player_);
	void ExecuteUbergraph_BTT_TANK_CanGetAGoodShot(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_TANK_CanGetAGoodShot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_TANK_CanGetAGoodShot_C")
	}
	static class UBTT_TANK_CanGetAGoodShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_TANK_CanGetAGoodShot_C>();
	}
};

}

