#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Stalker_FindHidingLoc

#include "Basic.hpp"

#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_StalkerEvalHiding_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_Stalker_FindHidingLoc.BTT_Stalker_FindHidingLoc_C
// 0x0050 (0x00F8 - 0x00A8)
class UBTT_Stalker_FindHidingLoc_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   MoveToLocation;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_StalkerEvalHiding>          HidingSpots;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AIVisibleFromTargets;                              // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrimaryThreadDir;                                  // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Attack;                                            // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_Stalker_FindHidingLoc(int32 EntryPoint);
	void InsertSortedHidingSpot(class AFWAIHidingLocation* Hiding, const struct FVector& Location, class APawn* Pawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ScoreHidingSpot(class APawn* Pawn, const struct FVector& Location, double* Return);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_Stalker_FindHidingLoc_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_Stalker_FindHidingLoc_C")
	}
	static class UBTT_Stalker_FindHidingLoc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_Stalker_FindHidingLoc_C>();
	}
};

}

