#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_ForceFire

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_ForceFire.BTTask_ForceFire_C
// 0x0088 (0x0130 - 0x00A8)
class UBTTask_ForceFire_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Target_Actor;                                      // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class APawn*                                  My_Pawn;                                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          My_Controller;                                     // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Fire_Rate;                                         // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Min_Trigger_Time;                                  // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Trigger_Time;                                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 My_Weapon_Component;                               // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Fire_Timer;                                        // 0x0108(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Pre_fire_delay_MIN;                                // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pre_fire_delay_MAX;                                // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Ammo;                                          // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Ammo_Capacity_;                                // 0x012C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_if_weapon_has_max_magazine_capacity(class UFWWeaponDefinition* Weapon);
	void Decrement_Ammo(bool* Empty_);
	void ExecuteUbergraph_BTTask_ForceFire(int32 EntryPoint);
	void Fail();
	void Fire_();
	void OnBlendOut_F0B61F884D80D1B5271E9FBC89607D84(class FName NotifyName);
	void OnCompleted_F0B61F884D80D1B5271E9FBC89607D84(class FName NotifyName);
	void OnInterrupted_F0B61F884D80D1B5271E9FBC89607D84(class FName NotifyName);
	void OnNotifyBegin_F0B61F884D80D1B5271E9FBC89607D84(class FName NotifyName);
	void OnNotifyEnd_F0B61F884D80D1B5271E9FBC89607D84(class FName NotifyName);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_ForceFire_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_ForceFire_C")
	}
	static class UBTTask_ForceFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_ForceFire_C>();
	}
};

}

