#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CharacterDamage.CharacterDamage_C
// 0x02A8 (0x0348 - 0x00A0)
class UCharacterDamage_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Skeletal_Mesh_Component;                           // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveHits;                                        // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          Tissue_Mesh;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Bones_Mesh;                                        // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Tissue_Mesh_Component;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Bones_Mesh_Component;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Organs_Mesh;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       GoreMaterials;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               TissueMaterial;                                    // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Organs_Mesh_Component;                             // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Organs_Material;                                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Bones_Material;                                    // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GutExploded;                                       // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, double>                     Joints;                                            // 0x0118(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Default_Joint_Health;                              // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ragdoll_Joint_At_Health;                           // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Kill_Joint_At_Health;                              // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Chunks;                                            // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           DismemberedJoints;                                 // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Enable;                                            // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    MaterialSlotList;                                  // 0x01A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class UClass*>              SoftTissueMaterialSlotList;                        // 0x01F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, int32>                    PartsDamageTracker;                                // 0x0248(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HitCheck;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UClass*>              skeletonPartsList;                                 // 0x02A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class AActor*>            MeshPartActorList;                                 // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         Niagara;                                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Gore(const struct FHitResult& HitResult, double Damage, const class UDamageType* DamageType);
	void Damage_Joint(const class FName& Joint_Name, const struct FVector& Impact_Normal, const struct FVector& Impact_Location, double Joint_Damage, bool* Dislocated);
	void DetermineRadiusAndDamage(const struct FHitResult& Hit_Result, double Damage, const class UDamageType* DamageType, double* Radius, double* JointDamage, bool* is_Radial_Damage, struct FHitResult* Out_Hit_Result);
	void DisconnectPart(class AActor* Target);
	void ExecuteUbergraph_CharacterDamage(int32 EntryPoint);
	void GetMaterialSlots(const class FString& TypeCreate);
	bool Is_Colliding_with_Dynamic_Material_At_Component(const struct FHitResult& Hit_Result, class UMaterialInstanceDynamic* Dynamic_Material, class USkeletalMeshComponent* Component, bool* is_Colliding);
	void ReceiveBeginPlay();
	void SoftTissueCast(class AActor* Actor, const class FString& Part);
	void Spawn_Chunk(class FName Joint_Name, const struct FVector& Impact_Normal, const struct FVector& Impact_Point);
	void Spawn_Inner_Layers();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CharacterDamage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterDamage_C")
	}
	static class UCharacterDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterDamage_C>();
	}
};

}

