#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUser

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CommonUser_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CommonUser.AsyncAction_CommonUserInitialize
// 0x0040 (0x0070 - 0x0030)
class UAsyncAction_CommonUserInitialize final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(const class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> OnInitializationComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_CommonUserInitialize* InitializeForLocalPlay(class UCommonUserSubsystem* Target, int32 LocalPlayerIndex, const struct FInputDeviceId& PrimaryInputDevice, bool bCanUseGuestLogin);
	static class UAsyncAction_CommonUserInitialize* LoginForOnlinePlay(class UCommonUserSubsystem* Target, int32 LocalPlayerIndex);

	void HandleInitializationComplete(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_CommonUserInitialize")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_CommonUserInitialize")
	}
	static class UAsyncAction_CommonUserInitialize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_CommonUserInitialize>();
	}
};

// Class CommonUser.CommonUserInfo
// 0x0060 (0x0088 - 0x0028)
class UCommonUserInfo final : public UObject
{
public:
	struct FInputDeviceId                         PrimaryInputDevice;                                // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlatformUserId                        PlatformUser;                                      // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalPlayerIndex;                                  // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeGuest;                                       // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGuest;                                          // 0x0035(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCachedUser;                                     // 0x0036(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonUserInitializationState                InitializationState;                               // 0x0037(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ECommonUserPrivilegeResult GetCachedPrivilegeResult(ECommonUserPrivilege Privilege, ECommonUserOnlineContext Context) const;
	class FString GetDebugString() const;
	struct FUniqueNetIdRepl GetNetId(ECommonUserOnlineContext Context) const;
	class FString GetNickname() const;
	ECommonUserAvailability GetPrivilegeAvailability(ECommonUserPrivilege Privilege) const;
	bool IsDoingLogin() const;
	bool IsLoggedIn() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUserInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUserInfo")
	}
	static class UCommonUserInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUserInfo>();
	}
};

// Class CommonUser.CommonUserSubsystem
// 0x0138 (0x0168 - 0x0030)
class UCommonUserSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(const class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> OnUserInitializeComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MessageType, class FText TitleText, class FText BodyText)> OnHandleSystemMessage; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UCommonUserInfo* UserInfo, ECommonUserPrivilege Privilege, ECommonUserAvailability OldAvailability, ECommonUserAvailability NewAvailability)> OnUserPrivilegeChanged; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bSuccess)> OnNetworkConnectivityCheckComplete;                // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x70];                                      // 0x0070(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UCommonUserInfo*>           LocalUserInfos;                                    // 0x00E0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x38];                                     // 0x0130(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CancelUserInitialization(int32 LocalPlayerIndex);
	void CheckInternetConnectivity();
	void ForceOfflineMode();
	void ListenForLoginKeyInput(const TArray<struct FKey>& AnyUserKeys, const TArray<struct FKey>& NewUserKeys, const struct FCommonUserInitializeParams& Params_0);
	void ResetUserState();
	void SendSystemMessage(const struct FGameplayTag& MessageType, const class FText& TitleText, const class FText& BodyText);
	void SetMaxLocalPlayers(int32 InMaxLocalPLayers);
	bool TryToInitializeForLocalPlay(int32 LocalPlayerIndex, const struct FInputDeviceId& PrimaryInputDevice, bool bCanUseGuestLogin);
	bool TryToInitializeUser(const struct FCommonUserInitializeParams& Params_0);
	bool TryToLoginForOnlinePlay(int32 LocalPlayerIndex);
	bool TryToLogOutUser(int32 LocalPlayerIndex, bool bDestroyPlayer);

	ECommonUserInitializationState GetLocalPlayerInitializationState(int32 LocalPlayerIndex) const;
	int32 GetMaxLocalPlayers() const;
	int32 GetNumLocalPlayers() const;
	const class UCommonUserInfo* GetUserInfoForControllerId(int32 ControllerId) const;
	const class UCommonUserInfo* GetUserInfoForInputDevice(const struct FInputDeviceId& InputDevice) const;
	const class UCommonUserInfo* GetUserInfoForLocalPlayerIndex(int32 LocalPlayerIndex) const;
	const class UCommonUserInfo* GetUserInfoForPlatformUser(const struct FPlatformUserId& PlatformUser) const;
	const class UCommonUserInfo* GetUserInfoForPlatformUserIndex(int32 PlatformUserIndex) const;
	const class UCommonUserInfo* GetUserInfoForUniqueNetId(const struct FUniqueNetIdRepl& NetId) const;
	bool HasOfflineUserReady() const;
	bool HasOnlineConnection(ECommonUserOnlineContext Context) const;
	bool HasTraitTag(const struct FGameplayTag& TraitTag) const;
	bool ShouldWaitForStartInput() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUserSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUserSubsystem")
	}
	static class UCommonUserSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUserSubsystem>();
	}
};

// Class CommonUser.CachedCommonUserInfo
// 0x0070 (0x0098 - 0x0028)
class UCachedCommonUserInfo final : public USaveGame
{
public:
	struct FUniqueNetIdRepl                       ServiceNetId;                                      // 0x0028(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlatformNetId;                                     // 0x0058(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CachedCommonUserInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CachedCommonUserInfo")
	}
	static class UCachedCommonUserInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCachedCommonUserInfo>();
	}
};

}

