#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonLoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonLoadingScreen.LoadingScreenManager.GetDebugReasonForShowingOrHidingLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CommonLoadingScreen.LoadingScreenManager.IsLoadingAudioPlaying
// 0x0001 (0x0001 - 0x0000)
struct LoadingScreenManager_IsLoadingAudioPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CommonLoadingScreen.LoadingScreenManager.IsLoadingScreenVisible
// 0x0001 (0x0001 - 0x0000)
struct LoadingScreenManager_IsLoadingScreenVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CommonLoadingScreen.LoadingProcessTask.CreateLoadingScreenProcessTask
// 0x0020 (0x0020 - 0x0000)
struct LoadingProcessTask_CreateLoadingScreenProcessTask final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowLoadingScreenReason;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULoadingProcessTask*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CommonLoadingScreen.LoadingProcessTask.SetShowLoadingScreenReason
// 0x0010 (0x0010 - 0x0000)
struct LoadingProcessTask_SetShowLoadingScreenReason final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

