#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DAQuest_Fetch_Lordoss_2_DialogueEnd

#include "Basic.hpp"


namespace SDK::Params
{

// Function DAQuest_Fetch_Lordoss_2_DialogueEnd.DAQuest_Fetch_Lordoss_2_DialogueEnd_C.ExecuteUbergraph_DAQuest_Fetch_Lordoss_2_DialogueEnd
// 0x0028 (0x0028 - 0x0000)
struct DAQuest_Fetch_Lordoss_2_DialogueEnd_C_ExecuteUbergraph_DAQuest_Fetch_Lordoss_2_DialogueEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDialogueWidget* Widget_that_Closed)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDialogueWidget*                        K2Node_CustomEvent_Widget_that_Closed;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function DAQuest_Fetch_Lordoss_2_DialogueEnd.DAQuest_Fetch_Lordoss_2_DialogueEnd_C.OnClosed
// 0x0008 (0x0008 - 0x0000)
struct DAQuest_Fetch_Lordoss_2_DialogueEnd_C_OnClosed final
{
public:
	class UDialogueWidget*                        Widget_that_Closed;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

