#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct DataflowCore.DataflowConnection
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FDataflowConnection
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowCore.DataflowInput
// 0x0008 (0x0048 - 0x0040)
struct FDataflowInput final : public FDataflowConnection
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowCore.DataflowOutput
// 0x0028 (0x0068 - 0x0040)
struct FDataflowOutput final : public FDataflowConnection
{
public:
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowCore.DataflowNode
// 0x00E8 (0x00E8 - 0x0000)
struct alignas(0x08) FDataflowNode
{
public:
	uint8                                         Pad_0[0xC8];                                       // 0x0000(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActive;                                           // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x1F];                                      // 0x00C9(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowCore.DataflowOverrideNode
// 0x0020 (0x0108 - 0x00E8)
struct FDataflowOverrideNode : public FDataflowNode
{
public:
	class FName                                   Key;                                               // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Default;                                           // 0x00F0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverriden;                                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowCore.DataflowSelection
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FDataflowSelection
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowCore.DataflowTransformSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowTransformSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowVertexSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowVertexSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.DataflowFaceSelection
// 0x0000 (0x0020 - 0x0020)
struct FDataflowFaceSelection final : public FDataflowSelection
{
};

// ScriptStruct DataflowCore.NodeColors
// 0x0020 (0x0020 - 0x0000)
struct FNodeColors final
{
public:
	struct FLinearColor                           NodeTitleColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeBodyTintColor;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowCore.DataflowTerminalNode
// 0x0000 (0x00E8 - 0x00E8)
struct FDataflowTerminalNode : public FDataflowNode
{
};

}

