#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugSkinButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DebugSkinButton.DebugSkinButton_C
// 0x0060 (0x0340 - 0x02E0)
class UDebugSkinButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_33;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_57;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(TSoftObjectPtr<class USkeletalMesh> Skin)> OnClicked;              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class USkeletalMesh>           Skin;                                              // 0x0318(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__DebugSkinButton_Button_33_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_DebugSkinButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DebugSkinButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DebugSkinButton_C")
	}
	static class UDebugSkinButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugSkinButton_C>();
	}
};

}

