#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvolveDialogue

#include "Basic.hpp"


namespace SDK::Params
{

// Function EvolveDialogue.DialogueSubsystem.OpenDialogue
// 0x0030 (0x0030 - 0x0000)
struct DialogueSubsystem_OpenDialogue final
{
public:
	TSubclassOf<class UDialogueWidget>            dialogueClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZOrder;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Param)>         onFinishDelegate;                                  // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Param;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogueWidget*                        ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveDialogue.DialogueWidget.GetCurrentPageText
// 0x0010 (0x0010 - 0x0000)
struct DialogueWidget_GetCurrentPageText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function EvolveDialogue.DialogueWidget.IsOnLastPage
// 0x0001 (0x0001 - 0x0000)
struct DialogueWidget_IsOnLastPage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveDialogue.DialogueWidget.SetNewDialgueText
// 0x0010 (0x0010 - 0x0000)
struct DialogueWidget_SetNewDialgueText final
{
public:
	TArray<class FText>                           NewText;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

