#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvolveDungeon

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EvolveDungeon_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class EvolveDungeon.DungeonActor
// 0x0048 (0x02D8 - 0x0290)
class ADungeonActor final : public AActor
{
public:
	class UDungeonLevel*                          DungeonLevel;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             ConnectorDT;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             AreaDT;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ULevel* Level)> OnDungeonLevelLoaded;                        // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UDungeonLevelInstance*>          DungeonLevelInstances;                             // 0x02B8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         RandomSeed;                                        // 0x02C8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0xC];                                      // 0x02CC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnableMapVariants();
	void ShowDungeonInfo();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonActor")
	}
	static class ADungeonActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonActor>();
	}
};

// Class EvolveDungeon.DungeonBarrierInterface
// 0x0000 (0x0000 - 0x0000)
class IDungeonBarrierInterface final
{
public:
	void Lock();
	void Unlock();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonBarrierInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonBarrierInterface")
	}
	static class IDungeonBarrierInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDungeonBarrierInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class EvolveDungeon.DungeonConnectionActor
// 0x00B0 (0x0340 - 0x0290)
class ADungeonConnectionActor final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDungeonConnectionInfo                 ConnectionInfo;                                    // 0x02A0(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bOpenOnConnect;                                    // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDungeonConnectionBrowser              DungeonConnectionBrowser;                          // 0x0321(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   DoorMeshComp;                                      // 0x0328(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   DoorFrameMeshComp;                                 // 0x0330(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseConnection();
	void CloseDoor();
	void ConnectArea();
	void ConnectConnector();
	void OnCloseDoor();
	void OnOpenDoor();
	void OpenDoor();
	void RotateConnection();
	void SwapWithArea();
	void SwapWithConnector();

	bool IsConnected() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonConnectionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonConnectionActor")
	}
	static class ADungeonConnectionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonConnectionActor>();
	}
};

// Class EvolveDungeon.DungeonLevel
// 0x0048 (0x0070 - 0x0028)
class UDungeonLevel final : public UObject
{
public:
	TSoftObjectPtr<class UWorld>                  LevelMap;                                          // 0x0028(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Net, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDungeonAreaSettings                   AreaSettings;                                      // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Net, NativeAccessSpecifierPublic)

public:
	bool AddConnection(class ADungeonConnectionActor* connectionActor);
	void UpdateLevel();

	bool GetConnection(const class FString& ConnectionName, struct FDungeonConnectionInfo* ConnectionInfo) const;
	TArray<struct FDungeonConnectionInfo> GetConnections(EDungeonConnectionType ConnectionType) const;
	bool HasConnection(const class FString& ConnectionName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonLevel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonLevel")
	}
	static class UDungeonLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLevel>();
	}
};

// Class EvolveDungeon.DungeonLevelInstance
// 0x00A8 (0x00D0 - 0x0028)
class UDungeonLevelInstance final : public UObject
{
public:
	class UDungeonLevel*                          DungeonLevel;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             WorldTransform;                                    // 0x0030(0x0060)(BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapVariantPackageName;                             // 0x0090(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDistance*                PersistentStreamingLevel;                          // 0x00A0(0x0008)(ZeroConstructor, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ULevelStreaming*>                StreamingSubLevels;                                // 0x00A8(0x0010)(ZeroConstructor, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FDungeonLevelConnection>        ConnectedLevels;                                   // 0x00B8(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FTransform GetWorldTransform();
	bool InLevelBounds(class AActor* Actor);
	void LoadLevel();
	void OnMapLoaded();
	void SetWorldTransform(const struct FTransform& NewTransform);
	void UnloadLevel(bool shouldUnloadPersistent);
	void UpdateWorldTransform(const struct FTransform& connectorTransformWS, const struct FTransform& destConnectorTransformLS);

	bool CollidesWithAvoidVolume(const struct FDungeonRegionVolumeInfo& regionVolume) const;
	bool CollidesWithLevelInstance(class UDungeonLevelInstance* LevelInstance) const;
	bool GetConnection(const class FString& ConnectionName, struct FDungeonLevelConnection* ConnectionInfo) const;
	TArray<struct FDungeonRegionVolumeInfo> GetWorldRegionVolumes() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonLevelInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonLevelInstance")
	}
	static class UDungeonLevelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLevelInstance>();
	}
};

// Class EvolveDungeon.DungeonRegionVolume
// 0x0000 (0x02C8 - 0x02C8)
class ADungeonRegionVolume final : public AVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonRegionVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonRegionVolume")
	}
	static class ADungeonRegionVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonRegionVolume>();
	}
};

// Class EvolveDungeon.EvolveDungeonSettings
// 0x0050 (0x0088 - 0x0038)
class UEvolveDungeonSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UDataTable>              DungeonAreas;                                      // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              DungeonConnectors;                                 // 0x0060(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EvolveDungeonSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EvolveDungeonSettings")
	}
	static class UEvolveDungeonSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEvolveDungeonSettings>();
	}
};

// Class EvolveDungeon.EvolveDungeonSubsystem
// 0x0048 (0x0078 - 0x0030)
class UEvolveDungeonSubsystem final : public UEngineSubsystem
{
public:
	TSoftObjectPtr<class ADungeonActor>           DungeonActor;                                      // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UDungeonLevel*>                  AllConnectorMaps;                                  // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UDungeonLevel*>                  AllAreaMaps;                                       // 0x0068(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EvolveDungeonSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EvolveDungeonSubsystem")
	}
	static class UEvolveDungeonSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEvolveDungeonSubsystem>();
	}
};

// Class EvolveDungeon.LevelStreamingDevelopment
// 0x0000 (0x01A0 - 0x01A0)
class ULevelStreamingDevelopment final : public ULevelStreaming
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelStreamingDevelopment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelStreamingDevelopment")
	}
	static class ULevelStreamingDevelopment* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelStreamingDevelopment>();
	}
};

// Class EvolveDungeon.LevelStreamingDistance
// 0x0030 (0x01D0 - 0x01A0)
#pragma pack(push, 0x1)
class alignas(0x10) ULevelStreamingDistance : public ULevelStreaming
{
public:
	float                                         VisibleDistance;                                   // 0x0198(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HideDistance;                                      // 0x019C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamInDistance;                                  // 0x01A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamOutDistance;                                 // 0x01A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelCenter;                                       // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LevelExtent;                                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHidden();
	void OnLoaded();
	void OnShown();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelStreamingDistance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelStreamingDistance")
	}
	static class ULevelStreamingDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelStreamingDistance>();
	}
};
#pragma pack(pop)

// Class EvolveDungeon.LevelStreamingDistanceMapVariant
// 0x0000 (0x01D0 - 0x01D0)
class ULevelStreamingDistanceMapVariant final : public ULevelStreamingDistance
{
public:
	bool                                          bEnabled;                                          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelStreamingDistanceMapVariant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelStreamingDistanceMapVariant")
	}
	static class ULevelStreamingDistanceMapVariant* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelStreamingDistanceMapVariant>();
	}
};

// Class EvolveDungeon.LevelStreamingSubsystem
// 0x0028 (0x0068 - 0x0040)
class ULevelStreamingSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<class AActor*>                         StreamingSources;                                  // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        LastStreamingLocations;                            // 0x0050(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelStreamingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelStreamingSubsystem")
	}
	static class ULevelStreamingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelStreamingSubsystem>();
	}
};

}

