#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvolveTickThrottle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EvolveTickThrottle.TickThrottleSubsystem
// 0x0090 (0x00D0 - 0x0040)
class UTickThrottleSubsystem final : public UTickableWorldSubsystem
{
public:
	struct FVector2D                              TickDistance;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              TickInterval;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxVelocityToThrottleMovement;                     // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         TickThrottledActors;                               // 0x0068(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, float>                      DefaultIntervals;                                  // 0x0078(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TickThrottleSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TickThrottleSubsystem")
	}
	static class UTickThrottleSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTickThrottleSubsystem>();
	}
};

}

