#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvolveScenario

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EvolveScenario_structs.hpp"


namespace SDK::Params
{

// Function EvolveScenario.NpcSpawnerBaseComponent.Despawn
// 0x0001 (0x0001 - 0x0000)
struct NpcSpawnerBaseComponent_Despawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.GetFirstSpawnedNPC
// 0x0008 (0x0008 - 0x0000)
struct NpcSpawnerBaseComponent_GetFirstSpawnedNPC final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.HasSpawnedNPC
// 0x0001 (0x0001 - 0x0000)
struct NpcSpawnerBaseComponent_HasSpawnedNPC final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.IsSequenceSpawner
// 0x0001 (0x0001 - 0x0000)
struct NpcSpawnerBaseComponent_IsSequenceSpawner final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.OnNpcEndPlay
// 0x0010 (0x0010 - 0x0000)
struct NpcSpawnerBaseComponent_OnNpcEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EvolveScenario.NpcSpawnerBaseComponent.OnRepNpcSpawned
// 0x0010 (0x0010 - 0x0000)
struct NpcSpawnerBaseComponent_OnRepNpcSpawned final
{
public:
	TArray<class APawn*>                          oldNpcSpawned;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.SetSpawnerEnabled
// 0x0001 (0x0001 - 0x0000)
struct NpcSpawnerBaseComponent_SetSpawnerEnabled final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.Spawn
// 0x0001 (0x0001 - 0x0000)
struct NpcSpawnerBaseComponent_Spawn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.NpcSpawnerBaseComponent.IsSpawnerEnabled
// 0x0001 (0x0001 - 0x0000)
struct NpcSpawnerBaseComponent_IsSpawnerEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.EndPawnSequence
// 0x0010 (0x0010 - 0x0000)
struct ScenarioEncounter_EndPawnSequence final
{
public:
	class ACharacter*                             Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          wasAttacked;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EvolveScenario.ScenarioEncounter.FinishedPlayingSequence
// 0x0001 (0x0001 - 0x0000)
struct ScenarioEncounter_FinishedPlayingSequence final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.GetKilledCount
// 0x0004 (0x0004 - 0x0000)
struct ScenarioEncounter_GetKilledCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.GetSpawnedCount
// 0x0004 (0x0004 - 0x0000)
struct ScenarioEncounter_GetSpawnedCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.OnPawnSequenceEndedOnAttacked
// 0x0010 (0x0010 - 0x0000)
struct ScenarioEncounter_OnPawnSequenceEndedOnAttacked final
{
public:
	class UNpcSpawnerBaseComponent*               Spawner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  npcPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.OnPawnSequenceEndedOnCollision
// 0x0010 (0x0010 - 0x0000)
struct ScenarioEncounter_OnPawnSequenceEndedOnCollision final
{
public:
	class UNpcSpawnerBaseComponent*               Spawner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  npcPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.PlayingSequence
// 0x0001 (0x0001 - 0x0000)
struct ScenarioEncounter_PlayingSequence final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioEncounter.PlaySequence
// 0x0010 (0x0010 - 0x0000)
struct ScenarioEncounter_PlaySequence final
{
public:
	TArray<struct FScenarioSequenceCharacterInfo> sequenceCharacters_0;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioSpawner.SetActivated
// 0x0001 (0x0001 - 0x0000)
struct ScenarioSpawner_SetActivated final
{
public:
	bool                                          activated;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioSpawner.SpawnReinforcementEncounter
// 0x0004 (0x0004 - 0x0000)
struct ScenarioSpawner_SpawnReinforcementEncounter final
{
public:
	int32                                         reinforcementIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EvolveScenario.ScenarioSpawner.GetEncounterDropDown
// 0x0010 (0x0010 - 0x0000)
struct ScenarioSpawner_GetEncounterDropDown final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

