#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvolveScenario

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum EvolveScenario.ELoadingRangeDelayOverride
// NumValues: 0x0004
enum class ELoadingRangeDelayOverride : uint8
{
	Ignore                                   = 0,
	DelayIfOutsideLoadingRange               = 1,
	SpawnImmediately                         = 2,
	ELoadingRangeDelayOverride_MAX           = 3,
};

// ScriptStruct EvolveScenario.EncounterComponentBuffer
// 0x0018 (0x0018 - 0x0000)
struct FEncounterComponentBuffer final
{
public:
	uint32                                        FileVersion;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Buffer;                                            // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EvolveScenario.ScenarioEncounterInfo
// 0x00F0 (0x00F0 - 0x0000)
struct FScenarioEncounterInfo final
{
public:
	TSoftClassPtr<class UClass>                   EncounterClass;                                    // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InventoryItemTags;                                 // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  QuestTags;                                         // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  MarkerTags;                                        // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FEncounterComponentBuffer> ComponentNameToBuffer;                       // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct EvolveScenario.ScenarioSequenceCharacterInfo
// 0x0020 (0x0020 - 0x0000)
struct FScenarioSequenceCharacterInfo final
{
public:
	class FName                                   BindingTag;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharacter*                             Character;                                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNpcSpawnerBaseComponent*               Spawner;                                           // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EvolveScenario.NpcSpawnTableRow
// 0x0038 (0x0040 - 0x0008)
struct FNpcSpawnTableRow final : public FTableRowBase
{
public:
	TSoftClassPtr<class UClass>                   NpcClass;                                          // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   NpcTags;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

