#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvolveDungeon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum EvolveDungeon.EDungeonConnectionType
// NumValues: 0x0006
enum class EDungeonConnectionType : uint8
{
	Entrance_5m                              = 0,
	Entrance_10m                             = 1,
	Entrance_20m                             = 2,
	Entrance_Pipe                            = 3,
	NumConnectionTypes                       = 4,
	EDungeonConnectionType_MAX               = 5,
};

// ScriptStruct EvolveDungeon.DungeonConnectionBrowser
// 0x0001 (0x0001 - 0x0000)
struct FDungeonConnectionBrowser final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EvolveDungeon.DungeonLevelConnection
// 0x0028 (0x0028 - 0x0000)
struct FDungeonLevelConnection final
{
public:
	class FString                                 SourceConnectionName;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonLevelInstance*                  DestLevelInstance;                                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DestConnectionName;                                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EvolveDungeon.DungeonTags
// 0x0040 (0x0040 - 0x0000)
struct FDungeonTags final
{
public:
	TArray<struct FGameplayTag>                   AllRequiredTags;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   AnyRequiredTags;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   ExcludeAnyTags;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   PreferredTags;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EvolveDungeon.DungeonRegionVolumeInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FDungeonRegionVolumeInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Extent;                                            // 0x0060(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EvolveDungeon.DungeonConnectionInfo
// 0x0080 (0x0080 - 0x0000)
struct FDungeonConnectionInfo final
{
public:
	EDungeonConnectionType                        ConnectionType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ConnectionName;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformLS;                                       // 0x0020(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EvolveDungeon.DungeonAreaSettings
// 0x0020 (0x0020 - 0x0000)
struct FDungeonAreaSettings final
{
public:
	TArray<struct FDungeonConnectionInfo>         Connections;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FDungeonRegionVolumeInfo>       RegionVolumes;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct EvolveDungeon.DungeonLevelTableRow
// 0x0030 (0x0038 - 0x0008)
struct FDungeonLevelTableRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UDungeonLevel>           DungeonLevel;                                      // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLevel;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

