#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ForeverWinter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FWAnimation_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "FWPersistence_structs.hpp"
#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "FWAICore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MotionSymphony_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum ForeverWinter.EMeleeLimb
// NumValues: 0x0008
enum class EMeleeLimb : uint8
{
	NONE                                     = 0,
	LeftHand                                 = 1,
	RightHand                                = 2,
	LeftLeg                                  = 4,
	RightLeg                                 = 8,
	WeaponStock                              = 16,
	WeaponBayonette                          = 32,
	EMeleeLimb_MAX                           = 33,
};

// Enum ForeverWinter.ELootFailerReason
// NumValues: 0x000B
enum class ELootFailerReason : uint8
{
	Unknown                                  = 0,
	NotFound                                 = 1,
	TooFar                                   = 2,
	AlreadyTaken                             = 3,
	CantFit                                  = 4,
	LootRequestedTooSoon                     = 5,
	StartedLootingNewItemTooSoon             = 6,
	ContainerAlreadyOpened                   = 7,
	ContainerEmpty                           = 8,
	ContainerLocked                          = 9,
	ELootFailerReason_MAX                    = 10,
};

// Enum ForeverWinter.EStoreCategory
// NumValues: 0x0009
enum class EStoreCategory : uint8
{
	Item                                     = 0,
	QuestItem                                = 1,
	Weapon                                   = 2,
	Container                                = 3,
	Rig                                      = 4,
	Dangly                                   = 5,
	Frame                                    = 6,
	Buddy                                    = 7,
	EStoreCategory_MAX                       = 8,
};

// Enum ForeverWinter.EMinigameFaction
// NumValues: 0x0004
enum class EMinigameFaction : uint8
{
	None                                     = 0,
	Player                                   = 1,
	Enemy                                    = 2,
	EMinigameFaction_MAX                     = 3,
};

// Enum ForeverWinter.EObjectiveID
// NumValues: 0x000B
enum class EObjectiveID : uint8
{
	None                                     = 0,
	RaidConvoy                               = 1,
	OpenTruckDoor                            = 2,
	ProtectTruckDoor                         = 3,
	CollectLoot                              = 4,
	ExtractionZone                           = 5,
	DropLoot                                 = 6,
	TriggerExtraction                        = 7,
	WaitForExtraction                        = 8,
	EnterExtractionVehicle                   = 9,
	EObjectiveID_MAX                         = 10,
};

// Enum ForeverWinter.EYesNo
// NumValues: 0x0003
enum class EYesNo : uint8
{
	Yes                                      = 0,
	No                                       = 1,
	EYesNo_MAX                               = 2,
};

// Enum ForeverWinter.EFWCombatRole
// NumValues: 0x0004
enum class EFWCombatRole : uint8
{
	None                                     = 0,
	Range                                    = 1,
	Melee                                    = 2,
	EFWCombatRole_MAX                        = 3,
};

// Enum ForeverWinter.EFWAIEncounterDifficulty
// NumValues: 0x0006
enum class EFWAIEncounterDifficulty : uint8
{
	VeryEasy                                 = 0,
	Easy                                     = 1,
	Medium                                   = 2,
	Hard                                     = 3,
	VeryHard                                 = 4,
	Max                                      = 5,
};

// Enum ForeverWinter.EFWAIMeleeQueriesOpType
// NumValues: 0x0003
enum class EFWAIMeleeQueriesOpType : uint8
{
	And                                      = 0,
	Or                                       = 1,
	EFWAIMeleeQueriesOpType_MAX              = 2,
};

// Enum ForeverWinter.EBarActorSize
// NumValues: 0x0004
enum class EBarActorSize : uint8
{
	Small                                    = 0,
	Medium                                   = 1,
	Large                                    = 2,
	EBarActorSize_MAX                        = 3,
};

// Enum ForeverWinter.EBarActorState
// NumValues: 0x0004
enum class EBarActorState : uint8
{
	Any                                      = 0,
	Stand                                    = 1,
	Sit                                      = 2,
	EBarActorState_MAX                       = 3,
};

// Enum ForeverWinter.EDialogueType
// NumValues: 0x0005
enum class EDialogueType : uint8
{
	End                                      = 0,
	RandomReply                              = 1,
	Branching                                = 2,
	Donating                                 = 3,
	EDialogueType_MAX                        = 4,
};

// Enum ForeverWinter.ETraceShape
// NumValues: 0x0004
enum class ETraceShape : uint8
{
	Sphere                                   = 0,
	Box                                      = 1,
	Capsule                                  = 2,
	ETraceShape_MAX                          = 3,
};

// Enum ForeverWinter.EDeployableFailReason
// NumValues: 0x0006
enum class EDeployableFailReason : uint8
{
	None                                     = 0,
	TraceObstructed                          = 1,
	TraceFloating                            = 2,
	ShapeTraceObstructed                     = 3,
	PartialElevator                          = 4,
	EDeployableFailReason_MAX                = 5,
};

// Enum ForeverWinter.EUpscalingMethod
// NumValues: 0x0006
enum class EUpscalingMethod : uint8
{
	TAAU                                     = 0,
	TSR                                      = 1,
	FSR                                      = 2,
	DLSS                                     = 3,
	Off                                      = 4,
	EUpscalingMethod_MAX                     = 5,
};

// Enum ForeverWinter.EUpscalingQualityPreset
// NumValues: 0x0004
enum class EUpscalingQualityPreset : uint8
{
	Quality                                  = 0,
	Balanced                                 = 1,
	Performance                              = 2,
	EUpscalingQualityPreset_MAX              = 3,
};

// Enum ForeverWinter.EFrameGeneration
// NumValues: 0x0004
enum class EFrameGeneration : uint8
{
	None                                     = 0,
	AMD                                      = 1,
	Nvidia                                   = 2,
	EFrameGeneration_MAX                     = 3,
};

// Enum ForeverWinter.CoverPose
// NumValues: 0x0005
enum class ECoverPose : uint8
{
	None                                     = 0,
	Prone                                    = 1,
	Crouch                                   = 2,
	Stand                                    = 4,
	CoverPose_MAX                            = 5,
};

// Enum ForeverWinter.CoverProneActions
// NumValues: 0x0004
enum class ECoverProneActions : uint8
{
	None                                     = 0,
	ProneLeanLeft                            = 1,
	ProneLeanRight                           = 2,
	CoverProneActions_MAX                    = 3,
};

// Enum ForeverWinter.CoverCrouchActions
// NumValues: 0x0006
enum class ECoverCrouchActions : uint8
{
	None                                     = 0,
	CrouchLeanLeft                           = 1,
	CrouchLeanRight                          = 2,
	CrouchOver                               = 4,
	Stand                                    = 8,
	CoverCrouchActions_MAX                   = 9,
};

// Enum ForeverWinter.CoverStandActions
// NumValues: 0x0006
enum class ECoverStandActions : uint8
{
	None                                     = 0,
	StandLeanLeft                            = 1,
	StandLeanRight                           = 2,
	StepOutLeft                              = 4,
	StepOutRight                             = 8,
	CoverStandActions_MAX                    = 9,
};

// Enum ForeverWinter.EInventorySlot
// NumValues: 0x0008
enum class EInventorySlot : uint8
{
	Hands                                    = 0,
	Secondary                                = 1,
	Primary                                  = 2,
	Heavy                                    = 3,
	Utility1                                 = 4,
	Utility2                                 = 5,
	LeftHand                                 = 6,
	EInventorySlot_MAX                       = 7,
};

// Enum ForeverWinter.UseableActorType
// NumValues: 0x0006
enum class EUseableActorType : uint8
{
	ClientUse                                = 0,
	HostUse                                  = 1,
	ClientAndHostUse                         = 2,
	AllUse                                   = 3,
	ClientUseHostNotify                      = 4,
	UseableActorType_MAX                     = 5,
};

// Enum ForeverWinter.EDeployableUseType
// NumValues: 0x0006
enum class EDeployableUseType : uint8
{
	None                                     = 0,
	Item                                     = 1,
	Dangly                                   = 2,
	Ammo                                     = 3,
	Repack                                   = 4,
	EDeployableUseType_MAX                   = 5,
};

// Enum ForeverWinter.EWeaponType
// NumValues: 0x0006
enum class EWeaponType : uint8
{
	Assault                                  = 0,
	Heavy                                    = 1,
	Launcher                                 = 2,
	Sniper                                   = 3,
	Experimental                             = 4,
	EWeaponType_MAX                          = 5,
};

// Enum ForeverWinter.EAmmoType
// NumValues: 0x0006
enum class EAmmoType : uint8
{
	Pistol                                   = 0,
	Rifle                                    = 1,
	Shotgun                                  = 2,
	Submachine                               = 3,
	Support                                  = 4,
	EAmmoType_MAX                            = 5,
};

// Enum ForeverWinter.ECrosshairType
// NumValues: 0x0004
enum class ECrosshairType : uint8
{
	Reticule                                 = 0,
	Dot                                      = 1,
	Circle                                   = 2,
	ECrosshairType_MAX                       = 3,
};

// Enum ForeverWinter.ECardinalDirection
// NumValues: 0x0005
enum class ECardinalDirection : uint8
{
	NORTH                                    = 0,
	EAST                                     = 1,
	WEST                                     = 2,
	SOUTH                                    = 3,
	ECardinalDirection_MAX                   = 4,
};

// Enum ForeverWinter.EQuestPriority
// NumValues: 0x0003
enum class EQuestPriority : uint8
{
	Priority                                 = 0,
	Optional                                 = 1,
	EQuestPriority_MAX                       = 2,
};

// Enum ForeverWinter.EQuestProgress
// NumValues: 0x0005
enum class EQuestProgress : uint8
{
	NotActive                                = 0,
	CurrentlyActive                          = 1,
	Completed                                = 2,
	Unavalable                               = 3,
	EQuestProgress_MAX                       = 4,
};

// Enum ForeverWinter.EQuestGiver
// NumValues: 0x0006
enum class EQuestGiver : uint8
{
	Europa                                   = 0,
	Euruska                                  = 1,
	Eurasia                                  = 2,
	Scavenger                                = 3,
	Bunco                                    = 4,
	EQuestGiver_MAX                          = 5,
};

// Enum ForeverWinter.ECharacterClass
// NumValues: 0x0009
enum class ECharacterClass : uint8
{
	BagMan                                   = 0,
	PackMaster                               = 1,
	DroneMaster                              = 2,
	ResistanceLeader                         = 3,
	ServoSurgeon                             = 4,
	GunHead                                  = 5,
	Shaman                                   = 6,
	COUNT_OF                                 = 7,
	ECharacterClass_MAX                      = 8,
};

// Enum ForeverWinter.ESkillType
// NumValues: 0x0003
enum class ESkillType : uint8
{
	Passive                                  = 0,
	Active                                   = 1,
	ESkillType_MAX                           = 2,
};

// Enum ForeverWinter.EMapDevStatus
// NumValues: 0x0004
enum class EMapDevStatus : uint8
{
	DeveloperOnly                            = 0,
	ComingSoon                               = 1,
	Active                                   = 2,
	EMapDevStatus_MAX                        = 3,
};

// Enum ForeverWinter.ECustomizationType
// NumValues: 0x0034
enum class ECustomizationType : uint8
{
	Preset                                   = 0,
	BaseWeapon                               = 1,
	RCV                                      = 2,
	AMO                                      = 3,
	BCG                                      = 4,
	BLR                                      = 5,
	BLT                                      = 6,
	BPD                                      = 7,
	BPDFLD                                   = 8,
	BRL                                      = 9,
	BYT                                      = 10,
	CAR                                      = 11,
	CHG                                      = 12,
	CHGEND                                   = 13,
	FMS                                      = 14,
	FRS                                      = 15,
	GAS                                      = 16,
	HDL                                      = 17,
	HGD                                      = 18,
	HGDCHG                                   = 19,
	HMR                                      = 20,
	MAG                                      = 21,
	PGR                                      = 22,
	RES                                      = 23,
	RLS                                      = 24,
	ROD                                      = 25,
	SLR                                      = 26,
	STK                                      = 27,
	STKEND                                   = 28,
	STKFLD                                   = 29,
	TRG                                      = 30,
	UPP                                      = 31,
	UPPEPC                                   = 32,
	UPPLENS                                  = 33,
	ATTMD                                    = 34,
	PICFGR                                   = 35,
	PICFLL                                   = 36,
	PICLAM                                   = 37,
	PICMGN                                   = 38,
	PICOPT                                   = 39,
	PICFRS                                   = 40,
	PICRES                                   = 41,
	PICSCP                                   = 42,
	PIC0                                     = 43,
	PIC45                                    = 44,
	PIC90                                    = 45,
	PIC135                                   = 46,
	PIC180                                   = 47,
	PIC225                                   = 48,
	PIC270                                   = 49,
	PIC315                                   = 50,
	ECustomizationType_MAX                   = 51,
};

// Enum ForeverWinter.EMuzzleDeviceType
// NumValues: 0x0006
enum class EMuzzleDeviceType : uint8
{
	MD1                                      = 0,
	MD2                                      = 1,
	MD3                                      = 2,
	MD4                                      = 3,
	MD5                                      = 4,
	EMuzzleDeviceType_MAX                    = 5,
};

// Enum ForeverWinter.EFWWPNMZD
// NumValues: 0x0007
enum class EFWWPNMZD : uint8
{
	MZD1                                     = 0,
	MZD2                                     = 1,
	MZD3                                     = 2,
	MZD4                                     = 3,
	MZD5                                     = 4,
	MZDNONE                                  = 5,
	EFWWPNMZD_MAX                            = 6,
};

// Enum ForeverWinter.EWPNCaliber
// NumValues: 0x0013
enum class EWPNCaliber : uint8
{
	MD1_919                                  = 0,
	MD1_45                                   = 1,
	MD1_357                                  = 2,
	MD1_5AE                                  = 3,
	MD1_57                                   = 4,
	MD2_12G                                  = 5,
	MD3_545                                  = 6,
	MD3_556                                  = 7,
	MD3_762                                  = 8,
	MD4_308                                  = 9,
	MD4_306                                  = 10,
	MD4_54R                                  = 11,
	MD5_57M                                  = 12,
	MD5_50                                   = 13,
	_40m                                     = 14,
	_473                                     = 15,
	MD5_130                                  = 16,
	MD4_300                                  = 17,
	EWPNCaliber_MAX                          = 18,
};

// Enum ForeverWinter.EFWWPNPICSlot
// NumValues: 0x0009
enum class EFWWPNPICSlot : uint8
{
	PIC0                                     = 0,
	PIC45                                    = 1,
	PIC90                                    = 2,
	PIC135                                   = 3,
	PIC180                                   = 4,
	PIC225                                   = 5,
	PIC270                                   = 6,
	PIC315                                   = 7,
	EFWWPNPICSlot_MAX                        = 8,
};

// Enum ForeverWinter.EFWWPNPICType
// NumValues: 0x0004
enum class EFWWPNPICType : uint8
{
	None                                     = 0,
	PICFLL                                   = 1,
	PICLAM                                   = 2,
	EFWWPNPICType_MAX                        = 3,
};

// Enum ForeverWinter.EFWWPNSight
// NumValues: 0x0005
enum class EFWWPNSight : uint8
{
	None                                     = 0,
	RESFRS                                   = 1,
	OPT                                      = 2,
	SCP                                      = 3,
	EFWWPNSight_MAX                          = 4,
};

// ScriptStruct ForeverWinter.BattlePointDamageData
// 0x0008 (0x0008 - 0x0000)
struct FBattlePointDamageData final
{
public:
	float                                         BattlePointDamagePerHP;                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BattlePointDamagePerKill;                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.BattlePointData
// 0x001C (0x001C - 0x0000)
struct FBattlePointData final
{
public:
	float                                         CurrentBattlePoint;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBattlePoint;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BattlePointThreshold;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BattlePointDecay;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BattlePointDecayDelay;                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBattlePointDamageData                 BattlePointDamageData;                             // 0x0014(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FactionColors
// 0x0014 (0x0014 - 0x0000)
struct FFactionColors final
{
public:
	struct FLinearColor                           FillColor;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinFactionScore;                                   // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FWFactionUIConfig
// 0x0050 (0x0050 - 0x0000)
struct FFWFactionUIConfig final
{
public:
	struct FGameplayTag                           FactionTag;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   FactionName;                                       // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              FactionIcon;                                       // 0x0018(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFactionColors>                 FactionColors;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.TraversalData
// 0x0030 (0x0030 - 0x0000)
struct FTraversalData final
{
public:
	uint8                                         bVaulting : 1;                                     // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCoverVaulting : 1;                                // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMantling : 1;                                     // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialLocation;                                   // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraversalHeight;                                   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraversalDistance;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraversalYaw;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.MeleeAttackInfo
// 0x0008 (0x0008 - 0x0000)
struct FMeleeAttackInfo final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.HitReactionData
// 0x0040 (0x0040 - 0x0000)
struct FHitReactionData final
{
public:
	struct FVector                                ImpactLocation;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpactDirection;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              ImpactSurface;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EImpactArea                                   ImpactArea;                                        // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastImpactTime;                                    // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastImpactDamage;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHitStrength                                  HitStrength;                                       // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.TakeHitInfo
// 0x01B0 (0x01B0 - 0x0000)
struct FTakeHitInfo final
{
public:
	float                                         ActualDamage;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DamageTypeClass;                                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFWGameCharacter>        PawnInstigator;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  DamageCauser;                                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DamageEventClassID;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKilled;                                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EnsureReplicationByte;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEvent                           GeneralDamageEvent;                                // 0x0028(0x0010)(NativeAccessSpecifierPrivate)
	struct FPointDamageEvent                      PointDamageEvent;                                  // 0x0038(0x0128)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FRadialDamageEvent                     RadialDamageEvent;                                 // 0x0160(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// ScriptStruct ForeverWinter.FWAIEncounterDifficultyFactionControl
// 0x0058 (0x0058 - 0x0000)
struct FFWAIEncounterDifficultyFactionControl final
{
public:
	float                                         MaxRange;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EFWAIEncounterDifficulty, float>         DifficultyMultiplier;                              // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.CurrencyDetails
// 0x0018 (0x0018 - 0x0000)
struct FCurrencyDetails final
{
public:
	struct FDataTableRowHandle                    CurrencyRow;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int64                                         CurrencyAmount;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.Const
// 0x0001 (0x0001 - 0x0000)
struct FConst final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.CharacterProfile
// 0x0018 (0x0018 - 0x0000)
struct FCharacterProfile final
{
public:
	class UTexture2D*                             CharacterImage;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CharacterColor;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.InventoryItem
// 0x0018 (0x0018 - 0x0000)
struct FInventoryItem final
{
public:
	TSubclassOf<class AActor>                     ItemClass;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ItemVolume;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.FWDebriefStatToSave
// 0x0018 (0x0018 - 0x0000)
struct FFWDebriefStatToSave final
{
public:
	struct FGameplayTag                           WindowTag;                                         // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ScopeTag;                                          // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StatTag;                                           // 0x0010(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.SavedSpecialItem
// 0x0008 (0x0008 - 0x0000)
struct FSavedSpecialItem final
{
public:
	TSubclassOf<class AActor>                     SpecialItem;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.BackpackContainerInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FBackpackContainerInfo final
{
public:
	class FString                                 ContainerSlot;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             SocketLocation;                                    // 0x0010(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    DefaultContainerRow;                               // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntPoint                              SocketSize;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SocketNum;                                         // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSavedItem>                     CustomItems;                                       // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSavedSpecialItem>              SpecialItems;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.RigContainerDetails
// 0x00D0 (0x00D0 - 0x0000)
struct FRigContainerDetails final
{
public:
	struct FBackpackContainerInfo                 ContainerInfo;                                     // 0x0000(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	ERigSlot                                      Slot;                                              // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigSlotSize                                  Size;                                              // 0x00B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              UIPos;                                             // 0x00B4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              UISize;                                            // 0x00BC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.BackpackDangleInfo
// 0x0050 (0x0050 - 0x0000)
struct FBackpackDangleInfo final
{
public:
	class FString                                 DangleSlot;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     SocketLocation;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          ExtraDangles;                                      // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SocketNumber;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SocketSize;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UILocation;                                        // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedDangly                           DefaultDangly;                                     // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsDestroyed;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.RigDangleDetails
// 0x0080 (0x0080 - 0x0000)
struct FRigDangleDetails final
{
public:
	struct FBackpackDangleInfo                    DangleInfo;                                        // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          OuterDangly;                                       // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FrameClassRow;                                     // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	ERigSlot                                      Slot;                                              // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigSlotSize                                  Size;                                              // 0x0069(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              UIPos;                                             // 0x006C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              UISize;                                            // 0x0074(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.BackpackRigDefaults
// 0x01A8 (0x01B0 - 0x0008)
struct FBackpackRigDefaults final : public FTableRowBase
{
public:
	struct FVector                                RigViewerPosOffset;                                // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              RigViewerSize;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              RigviewerContainerSize;                            // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FRigContainerDetails>           ExtraContainerData;                                // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FRigDangleDetails>              ExtraDangleData;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FBackpackMultiDangleInfo>       MultiRigDanglySlots;                               // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FTransform                             MeshOffset;                                        // 0x0080(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             RigMesh;                                           // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RigName;                                           // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 RigNickname;                                       // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RigValue;                                          // 0x0150(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ValueOverride;                                     // 0x0154(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ValueRow;                                          // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AllowTags;                                         // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredGameplayTags;                              // 0x0190(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FWDamageTotalizer
// 0x001C (0x001C - 0x0000)
struct FFWDamageTotalizer final
{
public:
	TWeakObjectPtr<class AActor>                  DamagedActor;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FactionTag;                                        // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageInstigated;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageCredited;                                    // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHealth;                                         // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.BarNPC
// 0x00B0 (0x00B0 - 0x0000)
struct FBarNPC final
{
public:
	TSoftClassPtr<class UClass>                   NPCActorClass;                                     // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredBarRank;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBarActorSize                                 NPCSize;                                           // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EBarActorState>                        NPCPossibleStates;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Faction;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RepRequired;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           QuestRequirement;                                  // 0x004C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, float>              Preferences;                                       // 0x0058(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         BaseSpawnChance;                                   // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.FWFactionMapControlTableRow
// 0x0080 (0x0088 - 0x0008)
struct FFWFactionMapControlTableRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0008(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CounterScope;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>              DefaultFactionControlWeights;                      // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FWAIWeaponTargetFilter
// 0x0040 (0x0040 - 0x0000)
struct FFWAIWeaponTargetFilter final
{
public:
	struct FGameplayTagContainer                  IncludeAnyTags;                                    // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ExcludeAnyTags;                                    // 0x0020(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FWPartRows
// 0x0010 (0x0010 - 0x0000)
struct FFWPartRows final
{
public:
	TArray<struct FDataTableRowHandle>            PartRows;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FWWeaponPartsNewStatusFilter
// 0x00B8 (0x00C0 - 0x0008)
struct FFWWeaponPartsNewStatusFilter final : public FTableRowBase
{
public:
	class FName                                   WeaponRowName;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ECustomizationType, struct FFWPartRows>  CompatibleParts;                                   // 0x0010(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<ECustomizationType>                    DefaultAttachmentSlots;                            // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<ECustomizationType, struct FFWPartRows>  PartsWithAttachmentSlots;                          // 0x0070(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.DeployableUseData
// 0x0020 (0x0020 - 0x0000)
struct FDeployableUseData final
{
public:
	EDeployableUseType                            UseType;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            ItemTypes;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CompatibleAmmoTag;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.FWAIMeleeAttack
// 0x000C (0x000C - 0x0000)
struct FFWAIMeleeAttack final
{
public:
	struct FGameplayTag                           MeleeTag;                                          // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Weight;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ForeverWinter.SavedWeapon
// 0x0018 (0x0018 - 0x0000)
struct FSavedWeapon final
{
public:
	struct FDataTableRowHandle                    WeaponRowHandle;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.RigUIDetails
// 0x0030 (0x0030 - 0x0000)
struct FRigUIDetails final
{
public:
	bool                                          Dangly;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OuterDangly;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DangleSlot;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigSlot                                      Slot;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              UIPos;                                             // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              UISize;                                            // 0x0024(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.DecalEffect
// 0x0018 (0x0018 - 0x0000)
struct FDecalEffect final
{
public:
	class UMaterial*                              DecalMaterial;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDecalSize;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDecalSize;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecalLifeSpan;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.RigFrameDetails
// 0x0090 (0x0090 - 0x0000)
struct FRigFrameDetails final
{
public:
	struct FTransform                             Location;                                          // 0x0000(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   FrameClass;                                        // 0x0060(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ForeverWinter.FWRareLoot
// 0x0040 (0x0040 - 0x0000)
struct FFWRareLoot final
{
public:
	struct FDataTableRowHandle                    RandomLootRow;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
