#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FW_BattlePointSystem

#include "Basic.hpp"


namespace SDK::Params
{

// Function FW_BattlePointSystem.BattlePointInterface.GetBattlePoint
// 0x0004 (0x0004 - 0x0000)
struct BattlePointInterface_GetBattlePoint final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FW_BattlePointSystem.BattlePointInterface.GetBattlePointDamagePerHP
// 0x0004 (0x0004 - 0x0000)
struct BattlePointInterface_GetBattlePointDamagePerHP final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FW_BattlePointSystem.BattlePointInterface.GetBattlePointDamagePerKill
// 0x0004 (0x0004 - 0x0000)
struct BattlePointInterface_GetBattlePointDamagePerKill final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FW_BattlePointSystem.BattlePointInterface.ModifyBattlePoint
// 0x000C (0x000C - 0x0000)
struct BattlePointInterface_ModifyBattlePoint final
{
public:
	float                                         CurrentBattlePoint;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBattlePoint;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BattlePointThreshold;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FW_BattlePointSystem.ItemBattlePointInterface.GetBattlePoint
// 0x0004 (0x0004 - 0x0000)
struct ItemBattlePointInterface_GetBattlePoint final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

