#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FW_WG_UsableMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FW_WG_UsableMarker.FW_WG_UsableMarker_C
// 0x0038 (0x0318 - 0x02E0)
class UFW_WG_UsableMarker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DistanceTextBlock;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LootIcon;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TextAlpha;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Font_Shadow;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FW_WG_UsableMarker(int32 EntryPoint);
	void Fade_in_Font_Shadow();
	void Marker_Info(int32 Distance, const class FText& Marker_Name, bool Visible_);
	void SetMarkerInformation(const class FText& Distance, int32 NumDist, int32 MaxVisDist);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FW_WG_UsableMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FW_WG_UsableMarker_C")
	}
	static class UFW_WG_UsableMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFW_WG_UsableMarker_C>();
	}
};

}

