#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWAI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FWAI_structs.hpp"


namespace SDK::Params
{

// Function FWAI.AIGlobalSubsystem.GetProjectileObjectChannel
// 0x0001 (0x0001 - 0x0000)
struct AIGlobalSubsystem_GetProjectileObjectChannel final
{
public:
	ECollisionChannel                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.AIGlobalSubsystem.GetProjectileTraceChannel
// 0x0001 (0x0001 - 0x0000)
struct AIGlobalSubsystem_GetProjectileTraceChannel final
{
public:
	ECollisionChannel                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverSubsystem.EvaluateCover
// 0x0090 (0x0090 - 0x0000)
struct CoverSubsystem_EvaluateCover final
{
public:
	struct FCoverDescription                      Description;                                       // 0x0000(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0060(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ForwardVector;                                     // 0x0078(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverSubsystem.EvaluateTraversal
// 0x0088 (0x0088 - 0x0000)
struct CoverSubsystem_EvaluateTraversal final
{
public:
	struct FTraversalDescription                  Description;                                       // 0x0000(0x0050)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0050(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ForwardVector;                                     // 0x0068(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPassData;                                         // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWAI.CoverSubsystem.QueryAllCover
// 0x0020 (0x0020 - 0x0000)
struct CoverSubsystem_QueryAllCover final
{
public:
	TArray<TScriptInterface<class ICoverLocation>> Locations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TScriptInterface<class ICoverAware>           ForWhom;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverSubsystem.QueryCover
// 0x0040 (0x0040 - 0x0000)
struct CoverSubsystem_QueryCover final
{
public:
	TArray<TScriptInterface<class ICoverLocation>> Locations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class ICoverAware>           ForWhom;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWAI.CoverAware.OnArriveAtCover
// 0x0010 (0x0010 - 0x0000)
struct CoverAware_OnArriveAtCover final
{
public:
	TScriptInterface<class ICoverLocation>        Cover;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverAware.OnDepartCover
// 0x0001 (0x0001 - 0x0000)
struct CoverAware_OnDepartCover final
{
public:
	bool                                          bRemainInCover;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverAware.OnMoveToCover
// 0x0010 (0x0010 - 0x0000)
struct CoverAware_OnMoveToCover final
{
public:
	TScriptInterface<class ICoverLocation>        Cover;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverAware.GetCover
// 0x0010 (0x0010 - 0x0000)
struct CoverAware_GetCover final
{
public:
	TScriptInterface<class ICoverLocation>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWAI.CoverAwareBPL.FromCoverAwareActor
// 0x0020 (0x0020 - 0x0000)
struct CoverAwareBPL_FromCoverAwareActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECoverAwareBPLResult                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICoverAware>           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

