#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWAICore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FWGameCore_structs.hpp"
#include "FWGameCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FWAICore_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "StructUtils_structs.hpp"
#include "EvolveScenario_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class FWAICore.EnvQueryContext_FWPlayers
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWPlayers final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWPlayers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWPlayers")
	}
	static class UEnvQueryContext_FWPlayers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWPlayers>();
	}
};

// Class FWAICore.EnvQueryContext_FWSquadPosition
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWSquadPosition final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWSquadPosition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWSquadPosition")
	}
	static class UEnvQueryContext_FWSquadPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWSquadPosition>();
	}
};

// Class FWAICore.EnvQueryContext_FWSquadMembersPosition
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWSquadMembersPosition final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWSquadMembersPosition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWSquadMembersPosition")
	}
	static class UEnvQueryContext_FWSquadMembersPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWSquadMembersPosition>();
	}
};

// Class FWAICore.EnvQueryContext_FWSquadCentroid
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWSquadCentroid final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWSquadCentroid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWSquadCentroid")
	}
	static class UEnvQueryContext_FWSquadCentroid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWSquadCentroid>();
	}
};

// Class FWAICore.EnvQueryContext_FWTargetActor
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWTargetActor final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWTargetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWTargetActor")
	}
	static class UEnvQueryContext_FWTargetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWTargetActor>();
	}
};

// Class FWAICore.EnvQueryContext_FWDefendTargetActor
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWDefendTargetActor final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWDefendTargetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWDefendTargetActor")
	}
	static class UEnvQueryContext_FWDefendTargetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWDefendTargetActor>();
	}
};

// Class FWAICore.EnvQueryContext_FWAIInRange
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWAIInRange final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWAIInRange")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWAIInRange")
	}
	static class UEnvQueryContext_FWAIInRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWAIInRange>();
	}
};

// Class FWAICore.EnvQueryContext_FWAIMoveLocations
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWAIMoveLocations final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWAIMoveLocations")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWAIMoveLocations")
	}
	static class UEnvQueryContext_FWAIMoveLocations* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWAIMoveLocations>();
	}
};

// Class FWAICore.EnvQueryContext_FWTargetLastKnownCategory
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWTargetLastKnownCategory final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWTargetLastKnownCategory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWTargetLastKnownCategory")
	}
	static class UEnvQueryContext_FWTargetLastKnownCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWTargetLastKnownCategory>();
	}
};

// Class FWAICore.EnvQueryContext_FWTargetLastKnownFacingDirection
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWTargetLastKnownFacingDirection final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWTargetLastKnownFacingDirection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWTargetLastKnownFacingDirection")
	}
	static class UEnvQueryContext_FWTargetLastKnownFacingDirection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWTargetLastKnownFacingDirection>();
	}
};

// Class FWAICore.EnvQueryContext_FWTargetLastKnownLocation
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWTargetLastKnownLocation final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWTargetLastKnownLocation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWTargetLastKnownLocation")
	}
	static class UEnvQueryContext_FWTargetLastKnownLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWTargetLastKnownLocation>();
	}
};

// Class FWAICore.EnvQueryContext_FWQuerierNavLocation
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_FWQuerierNavLocation final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_FWQuerierNavLocation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_FWQuerierNavLocation")
	}
	static class UEnvQueryContext_FWQuerierNavLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_FWQuerierNavLocation>();
	}
};

// Class FWAICore.EnvQueryContext_Test
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_Test final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_Test")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_Test")
	}
	static class UEnvQueryContext_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_Test>();
	}
};

// Class FWAICore.EnvQueryTest_FWLineOfSight
// 0x0100 (0x02F8 - 0x01F8)
class UEnvQueryTest_FWLineOfSight final : public UEnvQueryTest
{
public:
	struct FEnvTraceData                          TraceData;                                         // 0x01F8(0x0040)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               TraceFromContext;                                  // 0x0238(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              ItemHeightOffset;                                  // 0x0270(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              ContextHeightOffset;                               // 0x02A8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x02E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseIgnoreContext;                                 // 0x02E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEnvQueryContext>           IgnoreContext;                                     // 0x02F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_FWLineOfSight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_FWLineOfSight")
	}
	static class UEnvQueryTest_FWLineOfSight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_FWLineOfSight>();
	}
};

// Class FWAICore.EnvQueryTest_FWNextArcAngle
// 0x0010 (0x0208 - 0x01F8)
class UEnvQueryTest_FWNextArcAngle final : public UEnvQueryTest
{
public:
	TSubclassOf<class UEnvQueryContext>           ArcLocationContext;                                // 0x01F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           CenterLocationContext;                             // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_FWNextArcAngle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_FWNextArcAngle")
	}
	static class UEnvQueryTest_FWNextArcAngle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_FWNextArcAngle>();
	}
};

// Class FWAICore.EnvQueryTest_FWSquadCohesion
// 0x0000 (0x01F8 - 0x01F8)
class UEnvQueryTest_FWSquadCohesion final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_FWSquadCohesion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_FWSquadCohesion")
	}
	static class UEnvQueryTest_FWSquadCohesion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_FWSquadCohesion>();
	}
};

// Class FWAICore.EnvQueryTest_FWTargetVulnerability
// 0x0018 (0x0210 - 0x01F8)
class UEnvQueryTest_FWTargetVulnerability final : public UEnvQueryTest
{
public:
	TSubclassOf<class UEnvQueryContext_FWTargetLastKnownCategory> TargetLastKnownCategory;           // 0x01F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext_FWTargetLastKnownLocation> TargetLastKnownLocationContext;    // 0x0200(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext_FWTargetLastKnownFacingDirection> TargetLastKnownFacingDirectionContext; // 0x0208(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_FWTargetVulnerability")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_FWTargetVulnerability")
	}
	static class UEnvQueryTest_FWTargetVulnerability* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_FWTargetVulnerability>();
	}
};

// Class FWAICore.FWAIOrderSolver
// 0x0018 (0x0040 - 0x0028)
class UFWAIOrderSolver : public UObject
{
public:
	class UFWAISquadController*                   Squad;                                             // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIOrderSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIOrderSolver")
	}
	static class UFWAIOrderSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIOrderSolver>();
	}
};

// Class FWAICore.FWAIAdvanceSolver
// 0x0058 (0x0098 - 0x0040)
class UFWAIAdvanceSolver final : public UFWAIOrderSolver
{
public:
	uint8                                         Pad_40[0x58];                                      // 0x0040(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAdvanceSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAdvanceSolver")
	}
	static class UFWAIAdvanceSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAdvanceSolver>();
	}
};

// Class FWAICore.FWAIAnim_MeleeData
// 0x0018 (0x0040 - 0x0028)
class UFWAIAnim_MeleeData final : public UAnimMetaData
{
public:
	float                                         DamageRadius;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DamageSocketStart;                                 // 0x002C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DamageSocketEnd;                                   // 0x0034(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAnim_MeleeData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAnim_MeleeData")
	}
	static class UFWAIAnim_MeleeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAnim_MeleeData>();
	}
};

// Class FWAICore.FWAIAsyncTaskBlueprintProxy
// 0x0048 (0x0070 - 0x0028)
class UFWAIAsyncTaskBlueprintProxy final : public UObject
{
public:
	TMulticastInlineDelegate<void(EPathFollowingResult MovementResult)> OnSuccess;                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EPathFollowingResult MovementResult)> OnFail;                      // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAIAsyncTaskBlueprintProxy* CreateMoveToProxyObject(class UObject* WorldContextObject, class APawn* Pawn, const struct FVector& Destination, class AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap, bool bAllowStrafe);

	void OnMoveCompleted(EPathFollowingResult Result, class AAIController* PassAIController);
	void OnRequestFailed();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAsyncTaskBlueprintProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAsyncTaskBlueprintProxy")
	}
	static class UFWAIAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAsyncTaskBlueprintProxy>();
	}
};

// Class FWAICore.FWAITask_MoveTo
// 0x0000 (0x0120 - 0x0120)
class UFWAITask_MoveTo final : public UAITask_MoveTo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAITask_MoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAITask_MoveTo")
	}
	static class UFWAITask_MoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAITask_MoveTo>();
	}
};

// Class FWAICore.FWAIAttackSolver
// 0x0000 (0x0040 - 0x0040)
class UFWAIAttackSolver final : public UFWAIOrderSolver
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAttackSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAttackSolver")
	}
	static class UFWAIAttackSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAttackSolver>();
	}
};

// Class FWAICore.FWAITacticalAttackSolver
// 0x0000 (0x0040 - 0x0040)
class UFWAITacticalAttackSolver final : public UFWAIOrderSolver
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAITacticalAttackSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAITacticalAttackSolver")
	}
	static class UFWAITacticalAttackSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAITacticalAttackSolver>();
	}
};

// Class FWAICore.FWAIAwarenessComponent
// 0x0018 (0x00B8 - 0x00A0)
class UFWAIAwarenessComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bHasAIStartedPlay : 1;                             // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOwnerDestroyed(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAwarenessComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAwarenessComponent")
	}
	static class UFWAIAwarenessComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAwarenessComponent>();
	}
};

// Class FWAICore.FWAIAwarenessComponent_NPC
// 0x0150 (0x0208 - 0x00B8)
class UFWAIAwarenessComponent_NPC final : public UFWAIAwarenessComponent
{
public:
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_NPC* AwarenessComponent, EFWAIAwarenessState NewAwarenessState, EFWAIAwarenessState PreviousAwarenessState)> OnAwarenessStateChanged; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class AActor* NewTarget, class AActor* PreviousTarget)> OnSelectedTargetChanged; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class APlayerController* PlayerController)> OnPlayerDetected; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_NPC* AwarenessComponent, class APlayerController* PlayerController)> OnPlayerLost; // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFWInterestEvaluatorDefinition*         InterestEvaluator;                                 // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAIThreatEvaluatorDefinition*         ThreatEvaluator;                                   // 0x0100(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAITargetEvaluatorDefinition*         TargetEvaluator;                                   // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0xD0];                                     // 0x0110(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	EFWAIAwarenessState                           AwarenessState;                                    // 0x01E0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E1[0x27];                                     // 0x01E1(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AActor* GetNearestTarget();
	void HandleThreatDestroyed(class AActor* DestroyedActor);
	void OnDamageTaken(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAwarenessComponent_NPC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAwarenessComponent_NPC")
	}
	static class UFWAIAwarenessComponent_NPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAwarenessComponent_NPC>();
	}
};

// Class FWAICore.FWAIAwarenessComponent_Player
// 0x00D0 (0x0188 - 0x00B8)
class UFWAIAwarenessComponent_Player final : public UFWAIAwarenessComponent
{
public:
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_Player* AwarenessComponent, class AActor* AIActor)> OnTargetedByAI; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_Player* AwarenessComponent, class AActor* AIActor)> OnUntargetedByAI; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWAIAwarenessComponent_Player* AwarenessComponent, class AActor* AIActor)> OnTargetedByAICountChanged; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         MaxViewTargetDistance;                             // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bViewTargetMustBeInViewFrustum : 1;                // 0x00EC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FocusTargetSelectionConeHalfAngle;                 // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxTimeSinceLastFullySensedToBeFocusTarget;        // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFWAIPlayerFocusTargetSelectionWeights FocusTargetSelectionWeights;                       // 0x00F8(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bCalculateVisibleEnemies;                          // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWCharacter*                           PlayerOwnerPrivate;                                // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x40];                                     // 0x0110(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         AITargetingThisPlayer;                             // 0x0150(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AActor>>          AIThatKnowThisPlayer;                              // 0x0160(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class APawn>>           AIVisibleToThisPlayer;                             // 0x0170(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartTrackingAIKnowledgeOfPlayer();
	void StopTrackingAIKnowledgeOfPlayer();

	class AActor* FindNearestAITargetingPlayer() const;
	TArray<class AActor*> GetAITargetingPlayer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAwarenessComponent_Player")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAwarenessComponent_Player")
	}
	static class UFWAIAwarenessComponent_Player* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAwarenessComponent_Player>();
	}
};

// Class FWAICore.FWAIAwarenessEvaluatorDefinition
// 0x0000 (0x0048 - 0x0048)
class UFWAIAwarenessEvaluatorDefinition : public UFWDataDefinition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAwarenessEvaluatorDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAwarenessEvaluatorDefinition")
	}
	static class UFWAIAwarenessEvaluatorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAwarenessEvaluatorDefinition>();
	}
};

// Class FWAICore.FWInterestEvaluatorDefinition
// 0x0018 (0x0060 - 0x0048)
class UFWInterestEvaluatorDefinition final : public UFWAIAwarenessEvaluatorDefinition
{
public:
	struct FFWAIInterestEvaluatorWeights          Weights;                                           // 0x0048(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InnerThreatDistance;                               // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterThreatDistance;                               // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWInterestEvaluatorDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWInterestEvaluatorDefinition")
	}
	static class UFWInterestEvaluatorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWInterestEvaluatorDefinition>();
	}
};

// Class FWAICore.FWAIThreatEvaluatorDefinition
// 0x0000 (0x0048 - 0x0048)
class UFWAIThreatEvaluatorDefinition : public UFWAIAwarenessEvaluatorDefinition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIThreatEvaluatorDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIThreatEvaluatorDefinition")
	}
	static class UFWAIThreatEvaluatorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIThreatEvaluatorDefinition>();
	}
};

// Class FWAICore.FWAITargetEvaluatorDefinition
// 0x0000 (0x0048 - 0x0048)
class UFWAITargetEvaluatorDefinition : public UFWAIAwarenessEvaluatorDefinition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAITargetEvaluatorDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAITargetEvaluatorDefinition")
	}
	static class UFWAITargetEvaluatorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAITargetEvaluatorDefinition>();
	}
};

// Class FWAICore.FWAISystem
// 0x0578 (0x0718 - 0x01A0)
class UFWAISystem final : public UAISystem
{
public:
	uint8                                         Pad_1A0[0x88];                                     // 0x01A0(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFWAISubsystem*>                 Subsystems;                                        // 0x0228(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSet<class UObject*>                          ProxyObjects;                                      // 0x0238(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x490];                                    // 0x0288(0x0490)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAISystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAISystem")
	}
	static class UFWAISystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAISystem>();
	}
};

// Class FWAICore.FWAISubsystem
// 0x0220 (0x0248 - 0x0028)
class UFWAISubsystem : public UBlueprintFunctionLibrary
{
public:
	uint8                                         Pad_28[0x220];                                     // 0x0028(0x0220)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAISubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAISubsystem")
	}
	static class UFWAISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAISubsystem>();
	}
};

// Class FWAICore.FWAIRootSubsystem
// 0x0000 (0x0248 - 0x0248)
class UFWAIRootSubsystem : public UFWAISubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIRootSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIRootSubsystem")
	}
	static class UFWAIRootSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIRootSubsystem>();
	}
};

// Class FWAICore.FWAIAwarenessSystem
// 0x0028 (0x0270 - 0x0248)
class UFWAIAwarenessSystem final : public UFWAIRootSubsystem
{
public:
	uint8                                         Pad_248[0x18];                                     // 0x0248(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFWAISensor*>                    Sensors;                                           // 0x0260(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static void DisableAllSenses(class AActor* Actor);
	static void DisableSense(class AActor* Actor, const struct FGameplayTagContainer& Senses);
	static void EnableAllSenses(class AActor* Actor);
	static void EnableSense(class AActor* Actor, const struct FGameplayTagContainer& Senses);
	static class UFWAIAwarenessComponent_NPC* GetAIAwarenessComponentForNPC(class AActor* Actor);
	static class UFWAIAwarenessComponent_Player* GetAIAwarenessComponentForPlayer(class APlayerController* PlayerController);
	static float GetAIAwarenessValueForActor(class AActor* Owner, const class AActor* Actor);
	static struct FVector GetAILastKnownFacingDirectionOfTargetForActor(class AActor* Actor);
	static struct FVector GetAILastKnownLocationOfTargetForActor(class AActor* Actor);
	static struct FVector GetAILastKnownNavLocationOfTargetForActor(class AActor* Actor);
	static class AActor* GetAIPrimaryThreatForActor(class AActor* Actor);
	static class AActor* GetAIPrimaryThreatForActorWithFilter(class AActor* Actor, const struct FGameplayTagContainer& UnitTypeFilter);
	static float GetAIPrimaryThreatLevelForActor(class AActor* Actor);
	static class AActor* GetAITargetForActor(class AActor* Actor);
	static class AActor* GetAITargetOrPrimaryThreatForActor(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIAwarenessSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIAwarenessSystem")
	}
	static class UFWAIAwarenessSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIAwarenessSystem>();
	}
};

// Class FWAICore.FWAIController
// 0x0098 (0x0450 - 0x03B8)
class AFWAIController : public AAIController
{
public:
	uint8                                         Pad_3B8[0x40];                                     // 0x03B8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAIGoalComponent*                     GoalComponentPrivate;                              // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAIBehaviorTreeComponent*             BehaviorTreeComponentPrivate;                      // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0x30];                                     // 0x0408(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ControlRotationSpeed;                              // 0x0438(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseControlRotationSpeed : 1;                      // 0x043C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_43D[0xB];                                      // 0x043D(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StunnedBlackboadKey;                               // 0x0448(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class AActor* GetClosestActor(class AActor* ActorA, class AActor* ActorB);
	void ReceiveAIStartPlay();
	void ReceiveAIStopPlay();

	struct FRotator GetFocalPointTargetRotator() const;
	struct FVector GetMoveFocalPointTarget() const;
	struct FRotator GetMoveFocalPointTargetRotator() const;
	bool IsGroupMember() const;
	bool IsLeader() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIController")
	}
	static class AFWAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAIController>();
	}
};

// Class FWAICore.FWAIBehaviorTreeComponent
// 0x0078 (0x0308 - 0x0290)
class UFWAIBehaviorTreeComponent final : public UBehaviorTreeComponent
{
public:
	uint8                                         Pad_290[0x78];                                     // 0x0290(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIBehaviorTreeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIBehaviorTreeComponent")
	}
	static class UFWAIBehaviorTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIBehaviorTreeComponent>();
	}
};

// Class FWAICore.FWAIBlueprintAction_SpawnAIBase
// 0x0028 (0x0058 - 0x0030)
class UFWAIBlueprintAction_SpawnAIBase : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class APawn* SpawnedAI, EFWAISpawnResultCode ResultCode)> OnSpawned; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APawn* SpawnedAI, EFWAISpawnResultCode ResultCode)> OnFailed; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAISpawnResult(class APawn* SpawnedAI, EFWAISpawnResultCode ResultCode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIBlueprintAction_SpawnAIBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIBlueprintAction_SpawnAIBase")
	}
	static class UFWAIBlueprintAction_SpawnAIBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIBlueprintAction_SpawnAIBase>();
	}
};

// Class FWAICore.FWAIBlueprintAction_SpawnPersistentAIBase
// 0x0040 (0x0098 - 0x0058)
class UFWAIBlueprintAction_SpawnPersistentAIBase : public UFWAIBlueprintAction_SpawnAIBase
{
public:
	uint8                                         Pad_58[0x40];                                      // 0x0058(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIBlueprintAction_SpawnPersistentAIBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIBlueprintAction_SpawnPersistentAIBase")
	}
	static class UFWAIBlueprintAction_SpawnPersistentAIBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIBlueprintAction_SpawnPersistentAIBase>();
	}
};

// Class FWAICore.FWAIBlueprintAction_SpawnAI
// 0x0008 (0x0060 - 0x0058)
class UFWAIBlueprintAction_SpawnAI final : public UFWAIBlueprintAction_SpawnAIBase
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAIBlueprintAction_SpawnAI* SpawnAIFromActorAndWait(class AFWAISpawner* Spawner, class AActor* SpawnInstigator);
	static class UFWAIBlueprintAction_SpawnAI* SpawnAIFromComponentAndWait(class UFWAISpawnerComponent* SpawnerComponent, class AActor* SpawnInstigator);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIBlueprintAction_SpawnAI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIBlueprintAction_SpawnAI")
	}
	static class UFWAIBlueprintAction_SpawnAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIBlueprintAction_SpawnAI>();
	}
};

// Class FWAICore.FWAIBlueprintAction_SpawnPersistentAIFromClass
// 0x0008 (0x00A0 - 0x0098)
class UFWAIBlueprintAction_SpawnPersistentAIFromClass final : public UFWAIBlueprintAction_SpawnPersistentAIBase
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAIBlueprintAction_SpawnPersistentAIFromClass* SpawnPersistentAIFromClassAndWait(class UObject* WorldContextObject, TSubclassOf<class APawn> PawnClass, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation, class AActor* SpawnInstigator, const struct FFWAISpawnOptions& SpawnOptions);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIBlueprintAction_SpawnPersistentAIFromClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIBlueprintAction_SpawnPersistentAIFromClass")
	}
	static class UFWAIBlueprintAction_SpawnPersistentAIFromClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIBlueprintAction_SpawnPersistentAIFromClass>();
	}
};

// Class FWAICore.FWAIBlueprintAction_SpawnPersistentAIFromDefinition
// 0x0008 (0x00A0 - 0x0098)
class UFWAIBlueprintAction_SpawnPersistentAIFromDefinition final : public UFWAIBlueprintAction_SpawnPersistentAIBase
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAIBlueprintAction_SpawnPersistentAIFromDefinition* SpawnPersistentAIFromDefinitionAndWait(class UObject* WorldContextObject, class UFWAISpawnDefinition* SpawnDefinition, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation, class AActor* SpawnInstigator, const struct FFWAISpawnOptions& SpawnOptions);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIBlueprintAction_SpawnPersistentAIFromDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIBlueprintAction_SpawnPersistentAIFromDefinition")
	}
	static class UFWAIBlueprintAction_SpawnPersistentAIFromDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIBlueprintAction_SpawnPersistentAIFromDefinition>();
	}
};

// Class FWAICore.FWAICharacterMovementComponent
// 0x0000 (0x0FC0 - 0x0FC0)
class UFWAICharacterMovementComponent final : public UFWCharacterMovementComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAICharacterMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAICharacterMovementComponent")
	}
	static class UFWAICharacterMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAICharacterMovementComponent>();
	}
};

// Class FWAICore.FWAIService
// 0x0008 (0x0030 - 0x0028)
class UFWAIService : public UObject
{
public:
	class UFWAIServiceComponent*                  ServiceComponent;                                  // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIService")
	}
	static class UFWAIService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIService>();
	}
};

// Class FWAICore.FWAICombatRangeService
// 0x0018 (0x0048 - 0x0030)
class UFWAICombatRangeService final : public UFWAIService
{
public:
	struct FFWAIBlackboardKey                     TriggerKey;                                        // 0x0030(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFWAIBlackboardKey                     TargetActorDistance;                               // 0x003C(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAICombatRangeService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAICombatRangeService")
	}
	static class UFWAICombatRangeService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAICombatRangeService>();
	}
};

// Class FWAICore.FWAIDamageService
// 0x0038 (0x0068 - 0x0030)
class UFWAIDamageService final : public UFWAIService
{
public:
	struct FFWAIBlackboardKey                     RecentDamageKey;                                   // 0x0030(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFWAIBlackboardKey                     DamageEventKey;                                    // 0x003C(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DamageEventTime;                                   // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RecentDamageTime;                                  // 0x0050(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDamageTaken(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIDamageService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIDamageService")
	}
	static class UFWAIDamageService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIDamageService>();
	}
};

// Class FWAICore.FWAIFleeDamageService
// 0x0010 (0x0040 - 0x0030)
class UFWAIFleeDamageService final : public UFWAIService
{
public:
	struct FFWAIBlackboardKey                     FleeKey;                                           // 0x0030(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDamageTaken(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFleeDamageService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFleeDamageService")
	}
	static class UFWAIFleeDamageService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIFleeDamageService>();
	}
};

// Class FWAICore.FWAIDebugger
// 0x0000 (0x0290 - 0x0290)
class AFWAIDebugger final : public AActor
{
public:
	void AIIgnoreAll();
	void AIIgnorePlayer();
	void DespawnAllAI(EFWAIDespawnReason Reason);
	void DespawnPlayerFocusAI(EFWAIDespawnReason Reason);
	void HandleOwnerDestroyed(class AActor* DestroyedActor);
	void SpawnAIAtLookAt(class APlayerController* PlayerController, const TSoftClassPtr<class UClass>& PawnClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIDebugger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIDebugger")
	}
	static class AFWAIDebugger* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAIDebugger>();
	}
};

// Class FWAICore.FWAIDebuggerManager
// 0x0010 (0x02A0 - 0x0290)
class AFWAIDebuggerManager final : public AActor
{
public:
	TArray<class AFWAIDebugger*>                  RegisteredDebuggerPtrs;                            // 0x0290(0x0010)(Net, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIDebuggerManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIDebuggerManager")
	}
	static class AFWAIDebuggerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAIDebuggerManager>();
	}
};

// Class FWAICore.FWAIDebugSystem
// 0x0000 (0x0248 - 0x0248)
class UFWAIDebugSystem final : public UFWAIRootSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIDebugSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIDebugSystem")
	}
	static class UFWAIDebugSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIDebugSystem>();
	}
};

// Class FWAICore.FWAIFactionComponent
// 0x0018 (0x00B8 - 0x00A0)
class UFWAIFactionComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FactionTag;                                        // 0x00A8(0x0008)(Edit, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         FactionId;                                         // 0x00B0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bHasAIStartedPlay : 1;                             // 0x00B4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFactionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFactionComponent")
	}
	static class UFWAIFactionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIFactionComponent>();
	}
};

// Class FWAICore.FWAIFactionSystem
// 0x0090 (0x02D8 - 0x0248)
class UFWAIFactionSystem final : public UFWAIRootSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnAIFactionRelationshipsReset;                     // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag, const struct FGameplayTag& RelationshipTag)> OnAIFactionRelationshipChanged; // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag, const struct FGameplayTag& RelationshipTag)> OnAIFactionRelationshipChangedToHostile; // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag, const struct FGameplayTag& RelationshipTag)> OnAIFactionRelationshipChangedToFriendly; // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag)> OnAIFactionRelationshipChangedToNeutral; // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x40];                                     // 0x0298(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAIFactionSystem* GetAIFactionSystem(class UObject* WorldContextObject);
	static struct FGameplayTag GetAIFactionTag(class UObject* WorldContextObject, const class AActor* Actor, bool bCheckOwner);
	static bool IsAIFactionFriendlyTo(class UObject* WorldContextObject, const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag);
	static bool IsAIFactionHostileTo(class UObject* WorldContextObject, const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag);
	static bool IsAIFactionNeutralTo(class UObject* WorldContextObject, const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag);
	static bool IsAIFriendlyTo(class UObject* WorldContextObject, class AActor* FromActor, class AActor* ToActor);
	static bool IsAIHostileTo(class UObject* WorldContextObject, class AActor* FromActor, class AActor* ToActor);
	static bool IsAINeutralTo(class UObject* WorldContextObject, class AActor* FromActor, class AActor* ToActor);
	static bool IsSameAIFaction(class UObject* WorldContextObject, class AActor* FirstActor, class AActor* SecondActor);
	static void ResetAIRelationshipTableToDefault(class UObject* WorldContextObject);
	static void SetAIRelationshipTo(class UObject* WorldContextObject, const struct FGameplayTag& FromFactionTag, const struct FGameplayTag& ToFactionTag, const struct FGameplayTag& RelationshipTag);
	static void SetMutualAIRelationship(class UObject* WorldContextObject, const struct FGameplayTag& FirstFactionTag, const struct FGameplayTag& SecondFactionTag, const struct FGameplayTag& RelationshipTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFactionSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFactionSystem")
	}
	static class UFWAIFactionSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIFactionSystem>();
	}
};

// Class FWAICore.FWAIFlyingAgentController
// 0x0020 (0x0470 - 0x0450)
class AFWAIFlyingAgentController : public AFWAIController
{
public:
	bool                                          bFocusOnMovement;                                  // 0x0450(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMovePitchDown;                                    // 0x0451(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_452[0x2];                                      // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PitchedNose;                                       // 0x0454(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PitchControlSpeed;                                 // 0x0458(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAIFlyingPathingComponent*            FlyingPathComp;                                    // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFlyingAgentController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFlyingAgentController")
	}
	static class AFWAIFlyingAgentController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAIFlyingAgentController>();
	}
};

// Class FWAICore.FWPathFollowingComponent
// 0x0020 (0x0300 - 0x02E0)
class UFWPathFollowingComponent : public UPathFollowingComponent
{
public:
	uint8                                         Pad_2E0[0x20];                                     // 0x02E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPathFollowingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPathFollowingComponent")
	}
	static class UFWPathFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPathFollowingComponent>();
	}
};

// Class FWAICore.FWAIFlyingPathingComponent
// 0x0088 (0x0388 - 0x0300)
class UFWAIFlyingPathingComponent final : public UFWPathFollowingComponent
{
public:
	class UFWAIFlyingMovementComponent*           FlyingComp;                                        // 0x0300(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseCollisionRadius;                               // 0x0308(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AgentRadiusAcceptance;                             // 0x030C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldCheckOffPath;                               // 0x0310(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_311[0x77];                                     // 0x0311(0x0077)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFlyingPathingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFlyingPathingComponent")
	}
	static class UFWAIFlyingPathingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIFlyingPathingComponent>();
	}
};

// Class FWAICore.FWAIFormationSolver
// 0x0000 (0x0040 - 0x0040)
class UFWAIFormationSolver final : public UFWAIOrderSolver
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFormationSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFormationSolver")
	}
	static class UFWAIFormationSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIFormationSolver>();
	}
};

// Class FWAICore.FWAIGameplayAbility_Dead
// 0x0110 (0x04C8 - 0x03B8)
class UFWAIGameplayAbility_Dead : public UFWGameplayAbility
{
public:
	class FName                                   HitBoneName;                                       // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DirectionName;                                     // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x03C8(0x00F8)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AFWCharacter*                           Character;                                         // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UAbilityTask_PlayMontageAndWait* CreatePlayMontageAndWaitProxy(class USkeletalMeshComponent* InSkelMeshComp, class FName TaskInstanceName, class UAnimMontage* InMontageToPlay, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, float StartTimeSeconds);
	void OnBlendOut();
	void OnCancelled();
	void OnCompleted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIGameplayAbility_Dead")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIGameplayAbility_Dead")
	}
	static class UFWAIGameplayAbility_Dead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIGameplayAbility_Dead>();
	}
};

// Class FWAICore.FWAIGameplayAbility_HitReaction
// 0x0110 (0x04C8 - 0x03B8)
class UFWAIGameplayAbility_HitReaction : public UFWGameplayAbility
{
public:
	class FName                                   HitBoneName;                                       // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DirectionName;                                     // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x03C8(0x00F8)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
