#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWAICore

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "NetCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum FWAICore.EFWAIAwarenessState
// NumValues: 0x0005
enum class EFWAIAwarenessState : uint8
{
	None                                     = 0,
	Ambient                                  = 1,
	Alert                                    = 2,
	Aggro                                    = 3,
	EFWAIAwarenessState_MAX                  = 4,
};

// Enum FWAICore.EFWAISpawnResultCode
// NumValues: 0x0010
enum class EFWAISpawnResultCode : uint8
{
	Succeeded                                = 0,
	SpawnerDisabled                          = 1,
	NullWorldContext                         = 2,
	NullSpawningSystem                       = 3,
	CannotSpawnOnClient                      = 4,
	NullSpawningActor                        = 5,
	NullSpawnDefinition                      = 6,
	NullPawnClass                            = 7,
	InvalidSpawnTransform                    = 8,
	OffNavmesh                               = 9,
	MaxAISpawned                             = 10,
	FailedToSpawnPawn                        = 11,
	FailedToSpawnController                  = 12,
	NoHealthComponent                        = 13,
	Failed                                   = 14,
	EFWAISpawnResultCode_MAX                 = 15,
};

// Enum FWAICore.EFWAIPatrolPathUsage
// NumValues: 0x0004
enum class EFWAIPatrolPathUsage : uint8
{
	Once                                     = 0,
	PingPong                                 = 1,
	Loop                                     = 2,
	EFWAIPatrolPathUsage_MAX                 = 3,
};

// Enum FWAICore.EFWVisionRange
// NumValues: 0x0006
enum class EFWVisionRange : uint8
{
	None                                     = 0,
	Far                                      = 1,
	Near                                     = 2,
	VeryNear                                 = 3,
	VeryFar                                  = 4,
	EFWVisionRange_MAX                       = 5,
};

// Enum FWAICore.EFWAIAwarenessLevel
// NumValues: 0x0004
enum class EFWAIAwarenessLevel : uint8
{
	Unaware                                  = 0,
	Partial                                  = 1,
	Full                                     = 2,
	EFWAIAwarenessLevel_MAX                  = 3,
};

// Enum FWAICore.EFWAIDespawnReason
// NumValues: 0x0003
enum class EFWAIDespawnReason : uint8
{
	Destroyed                                = 0,
	Killed                                   = 1,
	EFWAIDespawnReason_MAX                   = 2,
};

// Enum FWAICore.EFWAISquadStanceSolver
// NumValues: 0x0004
enum class EFWAISquadStanceSolver : uint8
{
	None                                     = 0,
	Random                                   = 1,
	Flanks                                   = 2,
	EFWAISquadStanceSolver_MAX               = 3,
};

// Enum FWAICore.EFWAISquadFormation
// NumValues: 0x0006
enum class EFWAISquadFormation : uint8
{
	None                                     = 0,
	Wedge                                    = 1,
	Diamond                                  = 2,
	Line                                     = 3,
	File                                     = 4,
	EFWAISquadFormation_MAX                  = 5,
};

// Enum FWAICore.EFWAIAxis
// NumValues: 0x0005
enum class EFWAIAxis : uint8
{
	Forward                                  = 0,
	Back                                     = 1,
	Left                                     = 2,
	Right                                    = 3,
	EFWAIAxis_MAX                            = 4,
};

// Enum FWAICore.EFWAIComparisionOperation
// NumValues: 0x0005
enum class EFWAIComparisionOperation : uint8
{
	Greater                                  = 0,
	Less                                     = 1,
	GreaterOrEqual                           = 2,
	LessOrEqual                              = 3,
	EFWAIComparisionOperation_MAX            = 4,
};

// Enum FWAICore.EGlobalReinforcementDifficulty
// NumValues: 0x0005
enum class EGlobalReinforcementDifficulty : uint8
{
	Easy                                     = 0,
	Medium                                   = 1,
	Hard                                     = 2,
	Any                                      = 3,
	EGlobalReinforcementDifficulty_MAX       = 4,
};

// Enum FWAICore.EFWTraversalType
// NumValues: 0x0006
enum class EFWTraversalType : uint8
{
	None                                     = 0,
	Vault                                    = 1,
	Climb                                    = 2,
	Fall                                     = 3,
	Jump                                     = 4,
	EFWTraversalType_MAX                     = 5,
};

// ScriptStruct FWAICore.FWAIAwarenessCurve
// 0x0018 (0x0018 - 0x0000)
struct FFWAIAwarenessCurve final
{
public:
	float                                         LowerBound;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperBound;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PartialAwarenessThreshold;                         // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PartialAwarenessDecayTime;                         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FullAwarenessDecayTime;                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialFullAwarenessDecayDelay;                    // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIStanceInfo
// 0x0008 (0x0008 - 0x0000)
struct FFWAIStanceInfo final
{
public:
	EFWAISquadStanceSolver                        SolverType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Probability;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWRelationshipState
// 0x0018 (0x0024 - 0x000C)
struct FFWRelationshipState final : public FFastArraySerializerItem
{
public:
	struct FGameplayTag                           FromFactionTag;                                    // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ToFactionTag;                                      // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           RelationshipTag;                                   // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWFactionRelationships
// 0x0010 (0x0118 - 0x0108)
struct FFWFactionRelationships final : public FFastArraySerializer
{
public:
	TArray<struct FFWRelationshipState>           Items;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIFormationInfo
// 0x0020 (0x0020 - 0x0000)
struct FFWAIFormationInfo final
{
public:
	struct FGameplayTag                           Descriptor;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWAISquadFormation                           Formation;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Spacing;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ScaleFormation;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIInterestEvaluatorWeights
// 0x000C (0x000C - 0x0000)
struct FFWAIInterestEvaluatorWeights final
{
public:
	float                                         TheirAwareness;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OurAwareness;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Proximity;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIVisionCone
// 0x0020 (0x0020 - 0x0000)
struct FFWAIVisionCone final
{
public:
	float                                         VisionRange;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisionConeHorizontalHalfAngle;                     // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisionAgroRangeMultiplier;                         // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWVisionRange                                VisionRangeType;                                   // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x13];                                       // 0x000D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISolverState
// 0x0010 (0x0010 - 0x0000)
struct FFWAISolverState final
{
public:
	class UFWAIOrderSolver*                       Solver;                                            // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIDefinitionData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FFWAIDefinitionData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISquadExceptionSettings
// 0x0000 (0x0008 - 0x0008)
struct FFWAISquadExceptionSettings final : public FFWAIDefinitionData
{
};

// ScriptStruct FWAICore.FWAITargetData
// 0x0018 (0x0020 - 0x0008)
struct FFWAITargetData final : public FFWAIDefinitionData
{
public:
	float                                         CurrentTargetTimer;                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageThreshold;                                   // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerDamageThreshold;                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageThresholdBottom;                             // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerScoreModifier;                               // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrokeThresholdRetainTime;                          // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAITargetState
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FFWAITargetState final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIVisionDefinition
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FFWAIVisionDefinition
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAITagVisionData
// 0x0000 (0x0008 - 0x0008)
struct FFWAITagVisionData final : public FFWAIVisionDefinition
{
};

// ScriptStruct FWAICore.FWAIPlayerFocusTargetSelectionWeights
// 0x0008 (0x0008 - 0x0000)
struct FFWAIPlayerFocusTargetSelectionWeights final
{
public:
	float                                         DistanceWeight;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFocusConeWeight;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWRangeData
// 0x000C (0x000C - 0x0000)
struct FFWRangeData final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggerTime;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggerTimeRandomDeviation;                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIDatas
// 0x0010 (0x0010 - 0x0000)
struct FFWAIDatas final
{
public:
	TArray<struct FInstancedStruct>               DefinitionData;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWCombatRangeData
// 0x0010 (0x0018 - 0x0008)
struct FFWCombatRangeData final : public FFWAIDefinitionData
{
public:
	TArray<struct FFWRangeData>                   RangeValues;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIHearingModifiers
// 0x0008 (0x0008 - 0x0000)
struct FFWAIHearingModifiers final
{
public:
	float                                         HearingRadiusModifier;                             // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulationTimeModifier;                          // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIFleeSettings
// 0x0008 (0x0010 - 0x0008)
struct FFWAIFleeSettings final : public FFWAIDefinitionData
{
public:
	bool                                          bCanFleeOnDamage;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISquadSettings
// 0x0030 (0x0038 - 0x0008)
struct FFWAISquadSettings final : public FFWAIDefinitionData
{
public:
	struct FFWAIFormationInfo                     DefaultFormation;                                  // 0x0008(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FFWAIFormationInfo>             Formations;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIDebugSpawnHotkey
// 0x0048 (0x0048 - 0x0000)
struct FFWAIDebugSpawnHotkey final
{
public:
	struct FInputChord                            Hotkey;                                            // 0x0000(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AIPawnPtr;                                         // 0x0020(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIDebugHotkeySettings
// 0x00C0 (0x00C0 - 0x0000)
struct FFWAIDebugHotkeySettings final
{
public:
	struct FInputChord                            KillAllAIHotkey;                                   // 0x0000(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            KillPlayerFocusAIHotkey;                           // 0x0020(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            DestroyAllAIHotkey;                                // 0x0040(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            DestroyPlayerFocusAIHotkey;                        // 0x0060(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            AIIgnoreAllHotkey;                                 // 0x0080(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            AIIgnorePlayerHotkey;                              // 0x00A0(0x0020)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWDashData
// 0x0028 (0x0030 - 0x0008)
struct FFWDashData final : public FFWAIDefinitionData
{
public:
	class UAnimMontage*                           AIDashMontage;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DashRange;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DashCoolDown;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIManeuver
// 0x0020 (0x0020 - 0x0000)
struct FFWAIManeuver final
{
public:
	TSubclassOf<class ASplineManeuver>            Maneuver;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockOnTarget;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Damage;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWManeuverData
// 0x0050 (0x0058 - 0x0008)
struct FFWManeuverData final : public FFWAIDefinitionData
{
public:
	TMap<struct FGameplayTag, struct FFWAIManeuver> Maneuvers;                                       // 0x0008(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWStunData
// 0x0008 (0x0010 - 0x0008)
struct FFWStunData final : public FFWAIDefinitionData
{
public:
	class UAnimMontage*                           AIStunMontage;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAISyncKillAIInfo
// 0x0030 (0x0030 - 0x0000)
struct FFWAISyncKillAIInfo final
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  OpponentTags;                                      // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
	float                                         Probability;                                       // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIGoalBehaviorDescriptor
// 0x0018 (0x0018 - 0x0000)
struct FFWAIGoalBehaviorDescriptor final
{
public:
	TSubclassOf<class UFWAIGoal>                  GoalClass;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBehaviorTree*                          Behavior;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBehavior;                                      // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIBehaviorData
// 0x0020 (0x0020 - 0x0000)
struct FFWAIBehaviorData final
{
public:
	class UBlackboardData*                        Blackboard;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFWAIGoalBehaviorDescriptor>    GoalBehaviors;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UBehaviorTree*                          OverrideRootBehavior;                              // 0x0018(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIPlayerVisionData
// 0x0000 (0x0008 - 0x0008)
struct FFWAIPlayerVisionData final : public FFWAIVisionDefinition
{
};

// ScriptStruct FWAICore.FWAIRelationshipDescriptor
// 0x000C (0x000C - 0x0000)
struct FFWAIRelationshipDescriptor final
{
public:
	struct FGameplayTag                           RelationshipTag;                                   // 0x0000(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alignment;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWFactionData
// 0x0048 (0x0048 - 0x0000)
struct FFWFactionData final
{
public:
	struct FGameplayTag                           FactionName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FactionEnemies;                                    // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FactionAllies;                                     // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIHearingData
// 0x0028 (0x0028 - 0x0000)
struct FFWAIHearingData final
{
public:
	float                                         HearingRadius;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HearingHalfHeight;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DefiningTypes;                                     // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIIntuitionFactionData
// 0x001C (0x001C - 0x0000)
struct FFWAIIntuitionFactionData final
{
public:
	struct FGameplayTag                           FactionTag;                                        // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulationTime;                                  // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AwarenessValue;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecayTime;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x4];                                       // 0x0018(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIVisionModifiers
// 0x0030 (0x0030 - 0x0000)
struct FFWAIVisionModifiers final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bApplyAccumulation;                                // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccumulationMultiplier;                            // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyDecay;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecayMultiplier;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIVisionData
// 0x0040 (0x0040 - 0x0000)
struct FFWAIVisionData final
{
public:
	struct FFWAIVisionCone                        VisionCone;                                        // 0x0000(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DefiningTypes;                                     // 0x0020(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIVisionFaction
// 0x0008 (0x0008 - 0x0000)
struct FFWAIVisionFaction final
{
public:
	float                                         Hate;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friendly;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIVisionInfo
// 0x0010 (0x0018 - 0x0008)
struct FFWAIVisionInfo final : public FFWAIDefinitionData
{
public:
	TArray<struct FInstancedStruct>               Definitions;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIBlackboardKey
// 0x000C (0x000C - 0x0000)
struct FFWAIBlackboardKey final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIServiceData
// 0x0010 (0x0010 - 0x0000)
struct FFWAIServiceData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAIService*                           Service;                                           // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAISpawningSettings
// 0x000C (0x000C - 0x0000)
struct FFWAISpawningSettings final
{
public:
	int32                                         MaxAliveAI;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDeadAI;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAISpawnedPerFrame;                              // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIFactionSettings
// 0x0028 (0x0028 - 0x0000)
struct FFWAIFactionSettings final
{
public:
	TSoftObjectPtr<class UFWAIRelationshipsDefinition> RelationshipsDefinitionPtr;                   // 0x0000(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct FWAICore.FWAIBehaviorSettings
// 0x01E0 (0x01E0 - 0x0000)
struct FFWAIBehaviorSettings final
{
public:
	TSoftObjectPtr<class UBlackboardData>         BaseBlackboardPtr;                                 // 0x0000(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultRootBehaviorTreePtr;                        // 0x0028(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultSuspendBehaviorTreePtr;                     // 0x0050(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultPostSpawnBehaviorTreePtr;                   // 0x0078(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultAggroBehaviorTreePtr;                       // 0x00A0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultAlertBehaviorTreePtr;                       // 0x00C8(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultAmbientBehaviorTreePtr;                     // 0x00F0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultPatrolBehaviorTreePtr;                      // 0x0118(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultSquadBehaviorTreePtr;                       // 0x0140(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UBehaviorTree>           DefaultGoHomeBehaviorTreePtr;                      // 0x0168(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UFWAIGoal>, TSoftObjectPtr<class UBehaviorTree>> DefaultGoalBehaviors;    // 0x0190(0x0050)(Edit, Config, UObjectWrapper, NativeAccessSpecifierPrivate)
};

// ScriptStruct FWAICore.FWAIPairingData
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FFWAIPairingData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAITestDistances
// 0x000C (0x000C - 0x0000)
struct FFWAITestDistances final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance2D;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZOffset;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAITraversalData
// 0x0010 (0x0010 - 0x0000)
struct FFWAITraversalData final
{
public:
	float                                         MinWallThickness;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWallThickness;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinWallHeight;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWallHeight;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAITraversalSettings
// 0x0030 (0x0038 - 0x0008)
struct FFWAITraversalSettings final : public FFWAIDefinitionData
{
public:
	struct FFWAITraversalData                     Vault;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFWAITraversalData                     MantleMid;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFWAITraversalData                     MantleHigh;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWSpawnData
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FFWSpawnData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISpawnSettings_Patrol
// 0x0018 (0x0018 - 0x0000)
struct FFWAISpawnSettings_Patrol final
{
public:
	class AFWAIPatrolPath*                        PatrolPath;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWAIPatrolPathUsage                          PatrolPathUsage;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PatrolPointToleranceFactor;                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartingPatrolPointSenseRadius;                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISpawnSettings
// 0x0028 (0x0028 - 0x0000)
struct FFWAISpawnSettings final
{
public:
	struct FFWAISpawnSettings_Patrol              PatrolSettings;                                    // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class AFWAISquadActor*                        SquadActor;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SquadRank;                                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRandomWalkIdle;                              // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowDefend;                                      // 0x0025(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISpawnDescriptor
// 0x0090 (0x0090 - 0x0000)
struct FFWAISpawnDescriptor final
{
public:
	TSoftClassPtr<class UClass>                   PawnClassPtr;                                      // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             SpawnDT;                                           // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   AllRequiredTags;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   AnyRequiredTags;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   ExcludeAnyTags;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FFWAISpawnSettings                     SpawnSettings;                                     // 0x0060(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         SpawnCount;                                        // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIDebugInfo
// 0x0018 (0x0018 - 0x0000)
struct FFWAIDebugInfo final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Other;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherCount;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherKill;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAISpawnOptions
// 0x0001 (0x0001 - 0x0000)
struct FFWAISpawnOptions final
{
public:
	bool                                          bCanSpawnOffNavmesh;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAISquadMember
// 0x0010 (0x0010 - 0x0000)
struct FFWAISquadMember final
{
public:
	class APawn*                                  AIPawn;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISquadTransformInfo
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FFWAISquadTransformInfo final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISquadState
// 0x00A8 (0x00A8 - 0x0000)
struct FFWAISquadState final
{
public:
	TArray<struct FFWAISolverState>               Solvers;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x98];                                      // 0x0010(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAIOrderInfo
// 0x0010 (0x0010 - 0x0000)
struct FFWAIOrderInfo final
{
public:
	struct FGameplayTag                           Descriptor;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnvQuery*                              MemberQuery;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIGlobalSquadSettings
// 0x0060 (0x0068 - 0x0008)
struct FFWAIGlobalSquadSettings final : public FFWAIDefinitionData
{
public:
	float                                         CombatMaxCohesionDistance;                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCohesionDistance;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFWAIStanceInfo                        Stance;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFWAIOrderInfo                         DefaultOrderInfo;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FFWAIOrderInfo>                 Orders;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           Solvers;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  IntermediateOrder;                                 // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIMemberState
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FFWAIMemberState final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISquadMemberData
// 0x0068 (0x0068 - 0x0000)
struct alignas(0x08) FFWAISquadMemberData final
{
public:
	uint8                                         Pad_0[0x68];                                       // 0x0000(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWAISquadOrderItem
// 0x0020 (0x0020 - 0x0000)
struct FFWAISquadOrderItem final
{
public:
	struct FVector                                Target;                                            // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAISquadOrder
// 0x0068 (0x0068 - 0x0000)
struct FFWAISquadOrder final
{
public:
	struct FGameplayTag                           OrderType;                                         // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFWAISquadOrderItem                    Target;                                            // 0x0008(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFWAISquadOrderItem                    SecondaryTarget;                                   // 0x0028(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tactics;                                           // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAITargetEvaluatorWeights_Default
// 0x0014 (0x0014 - 0x0000)
struct FFWAITargetEvaluatorWeights_Default final
{
public:
	float                                         TheirThreat;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Validity;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Proximity;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentTarget;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Player;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIEvaluatorWeights
// 0x0020 (0x0020 - 0x0000)
struct FFWAIEvaluatorWeights final
{
public:
	float                                         HasPathTo;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DangerClose;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Proximity;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCurrentTarget;                                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentTarget;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SquadDamage;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineOfSight;                                       // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIFiringSetting
// 0x0018 (0x0020 - 0x0008)
struct FFWAIFiringSetting final : public FFWAIDefinitionData
{
public:
	float                                         MuzzleAngleCheck;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckHardpointForFiring;                          // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatInterval                         NewTargetFireDelay;                                // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         StandardFireDelay;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAIThreatEvaluatorWeights_Default
// 0x0010 (0x0010 - 0x0000)
struct FFWAIThreatEvaluatorWeights_Default final
{
public:
	float                                         TheirAwareness;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OurAwareness;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Proximity;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastDamageInstigator;                              // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWAICore.FWAITimeInterval
// 0x000C (0x000C - 0x0000)
struct FFWAITimeInterval final
{
public:
	float                                         BaseTime;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RandomDeviation;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.FWPatrolSpeedModifier
// 0x0008 (0x0010 - 0x0008)
struct FFWPatrolSpeedModifier final : public FFWAIDefinitionData
{
public:
	float                                         SpeedModifier;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWAICore.GlobalReinforcementEncounter
// 0x0078 (0x0078 - 0x0000)
struct FGlobalReinforcementEncounter final
{
public:
	TSoftClassPtr<class UClass>                   EncounterClass;                                    // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGlobalReinforcementDifficulty                Difficulty;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
