#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWEntitlement

#include "Basic.hpp"

#include "CommonUser_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FWPersistence_structs.hpp"


namespace SDK::Params
{

// Function FWEntitlement.FWEntitlementSubsystem.BindPersistenceListeners
// 0x0020 (0x0020 - 0x0000)
struct FWEntitlementSubsystem_BindPersistenceListeners final
{
public:
	const class UFWPersistenceSubsystem*          Subsystem;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPersistenceResult                     Result;                                            // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWEntitlement.FWEntitlementSubsystem.GetEntitlements
// 0x0020 (0x0020 - 0x0000)
struct FWEntitlementSubsystem_GetEntitlements final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWEntitlement.FWEntitlementSubsystem.GetNewEntitlementsBySource
// 0x0050 (0x0050 - 0x0000)
struct FWEntitlementSubsystem_GetNewEntitlementsBySource final
{
public:
	TMap<class FName, struct FGameplayTagContainer> ReturnValue;                                     // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWEntitlement.FWEntitlementSubsystem.HandleCommonUserOnUserInitializeComplete
// 0x0028 (0x0028 - 0x0000)
struct FWEntitlementSubsystem_HandleCommonUserOnUserInitializeComplete final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWEntitlement.FWEntitlementSubsystem.SetEntitlementSeen
// 0x0008 (0x0008 - 0x0000)
struct FWEntitlementSubsystem_SetEntitlementSeen final
{
public:
	struct FGameplayTag                           EntitlementTag;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

