#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWEntitlement

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "CommonUser_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FWEntitlement.FWEntitlementSettings
// 0x0028 (0x0060 - 0x0038)
class UFWEntitlementSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UDataTable>              EntitlementInfoTable;                              // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWEntitlementSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWEntitlementSettings")
	}
	static class UFWEntitlementSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWEntitlementSettings>();
	}
};

// Class FWEntitlement.FWEntitlementEditorSettings
// 0x0040 (0x0078 - 0x0038)
class UFWEntitlementEditorSettings final : public UDeveloperSettings
{
public:
	struct FGameplayTagContainer                  EntitlementEnableOverrides;                        // 0x0038(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  EntitlementDisableOverrides;                       // 0x0058(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWEntitlementEditorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWEntitlementEditorSettings")
	}
	static class UFWEntitlementEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWEntitlementEditorSettings>();
	}
};

// Class FWEntitlement.FWEntitlementSubsystem
// 0x0108 (0x0138 - 0x0030)
class UFWEntitlementSubsystem final : public ULocalPlayerSubsystem
{
public:
	TMulticastInlineDelegate<void(const class UFWEntitlementSubsystem* Subsystem, const struct FGameplayTagContainer& NewEntitlementTags)> OnEntitlementsAdded; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UFWEntitlementSubsystem* Subsystem, const struct FGameplayTagContainer& RemovedEntitlementTags)> OnEntitlementsRemoved; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserInfo*                        AuthenticatedUserInfo;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayMessageSubsystem*              MessageRouter;                                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0xC0];                                      // 0x0078(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindPersistenceListeners(const class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	const struct FGameplayTagContainer GetEntitlements();
	const TMap<class FName, struct FGameplayTagContainer> GetNewEntitlementsBySource();
	void HandleCommonUserOnUserInitializeComplete(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void SetEntitlementSeen(const struct FGameplayTag& EntitlementTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWEntitlementSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWEntitlementSubsystem")
	}
	static class UFWEntitlementSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWEntitlementSubsystem>();
	}
};

}

