#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWGameCore

#include "Basic.hpp"

#include "ChaosVehicles_classes.hpp"
#include "FWPersistence_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "FWGameCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CommonUI_classes.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class FWGameCore.FWLocalPlayerControllerDependee
// 0x0000 (0x0000 - 0x0000)
class IFWLocalPlayerControllerDependee final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWLocalPlayerControllerDependee")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWLocalPlayerControllerDependee")
	}
	static class IFWLocalPlayerControllerDependee* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWLocalPlayerControllerDependee>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWGameCore.FWAbilitySystemActor
// 0x0020 (0x02B0 - 0x0290)
class AFWAbilitySystemActor : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWGameplayAbilitySetDefinition*        DefaultAbilitySetDefinition;                       // 0x0298(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWGameplayEffectSetDefinition*         DefaultEffectSetDefinition;                        // 0x02A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAbilitySystemComponent*              AbilitySystemComponentPrivate;                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilitySystemActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilitySystemActor")
	}
	static class AFWAbilitySystemActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAbilitySystemActor>();
	}
};

// Class FWGameCore.FWAbilitySystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UFWAbilitySystemBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FActiveGameplayEffectHandle ApplyGameplayEffectToActor(TSubclassOf<class UFWGameplayEffect> EffectClass, class AActor* Target, class AActor* Source, float Level);
	static const class UFWGameplayAbility* FindGameplayAbilityFromTag(class AActor* Actor, const struct FGameplayTag& EventTag);
	static class UFWAbilitySystemComponent* GetAbilitySystemComponentForActor(class AActor* Actor);
	static bool SendGameplayEventToActor(class AActor* Target, const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilitySystemBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilitySystemBlueprintLibrary")
	}
	static class UFWAbilitySystemBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAbilitySystemBlueprintLibrary>();
	}
};

// Class FWGameCore.FWAbilitySystemComponent
// 0x0030 (0x1278 - 0x1248)
class UFWAbilitySystemComponent final : public UAbilitySystemComponent
{
public:
	uint8                                         Pad_1248[0x30];                                    // 0x1248(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasActiveAbilityWithTag(const struct FGameplayTag& Tag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilitySystemComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilitySystemComponent")
	}
	static class UFWAbilitySystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAbilitySystemComponent>();
	}
};

// Class FWGameCore.FWAbilityTask_PlayMontageAndWait
// 0x0000 (0x0108 - 0x0108)
class UFWAbilityTask_PlayMontageAndWait final : public UAbilityTask_PlayMontageAndWait
{
public:
	static class UFWAbilityTask_PlayMontageAndWait* PlayMontageAndWait(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimMontage* Montage, float PlayRate, class FName StartSectionName, bool bStopOnAbilityEnd, float RootMotionTranslationScale, float StartTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilityTask_PlayMontageAndWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilityTask_PlayMontageAndWait")
	}
	static class UFWAbilityTask_PlayMontageAndWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAbilityTask_PlayMontageAndWait>();
	}
};

// Class FWGameCore.FWAbilityTask_TaskOnTick
// 0x0018 (0x0098 - 0x0080)
class UFWAbilityTask_TaskOnTick final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float DeltaTime)> OnTick;                                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAbilityTask_TaskOnTick* AbilityTaskOnTick(class UGameplayAbility* OwningAbility, class FName TaskInstanceName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilityTask_TaskOnTick")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilityTask_TaskOnTick")
	}
	static class UFWAbilityTask_TaskOnTick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAbilityTask_TaskOnTick>();
	}
};

// Class FWGameCore.FWAbilityTask_WaitInputHeld
// 0x0028 (0x00A8 - 0x0080)
class UFWAbilityTask_WaitInputHeld final : public UAbilityTask
{
public:
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilityTask_WaitInputHeld")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilityTask_WaitInputHeld")
	}
	static class UFWAbilityTask_WaitInputHeld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAbilityTask_WaitInputHeld>();
	}
};

// Class FWGameCore.FWAIFlyingMovementComponent
// 0x0098 (0x0208 - 0x0170)
class UFWAIFlyingMovementComponent final : public UFloatingPawnMovement
{
public:
	TMulticastInlineDelegate<void()>              OnSprintingStart;                                  // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSprintingStop;                                   // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bIsSprinting;                                      // 0x0190(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSprintSpeed;                                    // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintAcceleration;                                // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTurningBoost;                                // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAvoidance;                                     // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x3F];                                     // 0x01A1(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              HeightRange;                                       // 0x01E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F0[0x18];                                     // 0x01F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MoveTo(const struct FVector& Location);
	void OnRep_SprintState();
	void SetSprinting();
	void StopSprinting();

	struct FVector2D GetHeightRange() const;
	float GetVelocityAlpha() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAIFlyingMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAIFlyingMovementComponent")
	}
	static class UFWAIFlyingMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAIFlyingMovementComponent>();
	}
};

// Class FWGameCore.FWArmorContainerInterface
// 0x0000 (0x0000 - 0x0000)
class IFWArmorContainerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWArmorContainerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWArmorContainerInterface")
	}
	static class IFWArmorContainerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWArmorContainerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWGameCore.FWAssetManager
// 0x0000 (0x04D0 - 0x04D0)
class UFWAssetManager final : public UAssetManager
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAssetManager")
	}
	static class UFWAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAssetManager>();
	}
};

// Class FWGameCore.FWAsyncAction_CreatePopup
// 0x0050 (0x0080 - 0x0030)
class UFWAsyncAction_CreatePopup final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UFWPopupWidget* NewPopUp)> Created;                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWPopupWidget* NewPopUp)> Confirmed;                        // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFWPopupWidget* NewPopUp)> Cancelled;                        // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContext;                                      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFWPopupWidget*                         PopupWidget;                                       // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    TableRowHandle;                                    // 0x0070(0x0010)(NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UFWAsyncAction_CreatePopup* AsyncCreatePopup(class UObject* InWorldContext, const struct FDataTableRowHandle& InTableRowHandle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsyncAction_CreatePopup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsyncAction_CreatePopup")
	}
	static class UFWAsyncAction_CreatePopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsyncAction_CreatePopup>();
	}
};

// Class FWGameCore.FWAttributeSet
// 0x0020 (0x0050 - 0x0030)
class UFWAttributeSet : public UAttributeSet
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAttributeSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAttributeSet")
	}
	static class UFWAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAttributeSet>();
	}
};

// Class FWGameCore.FWAttributeSet_Health
// 0x0030 (0x0080 - 0x0050)
class UFWAttributeSet_Health final : public UFWAttributeSet
{
public:
	struct FGameplayAttributeData                 Health;                                            // 0x0050(0x0010)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FGameplayAttributeData                 MaxHealth;                                         // 0x0060(0x0010)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FGameplayAttributeData                 IncomingDamageModifier;                            // 0x0070(0x0010)(Net, RepNotify, NativeAccessSpecifierPrivate)

public:
	void OnRep_Health(const struct FGameplayAttributeData& OldValue);
	void OnRep_IncomingDamageModifier(const struct FGameplayAttributeData& OldValue);
	void OnRep_MaxHealth(const struct FGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAttributeSet_Health")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAttributeSet_Health")
	}
	static class UFWAttributeSet_Health* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAttributeSet_Health>();
	}
};

// Class FWGameCore.FWAudioAmbientManager
// 0x0000 (0x0290 - 0x0290)
class AFWAudioAmbientManager final : public AActor
{
public:
	static class AFWAudioAmbientManager* GetAudioAmbientManager(class UObject* WorldContextObject);

	void PlayerInfo(float Velocity, float ImpactVelocity);
	void TriggerAudioZone(int32 AmbientZone, float AmbientZoneSize, bool IsInside, float WindIntensity, float FilterCutOff, float FilterInterpTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAudioAmbientManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAudioAmbientManager")
	}
	static class AFWAudioAmbientManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWAudioAmbientManager>();
	}
};

// Class FWGameCore.FWAudioSubsystem
// 0x0050 (0x0090 - 0x0040)
class UFWAudioSubsystem final : public UTickableWorldSubsystem
{
public:
	class AFWAudioAmbientManager*                 AmbientManager;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBeginInsideAudio;                                // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnEndInsideAudio;                                  // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 NewIntensityHint)> OnAudioIntensityHint;                     // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetAudioIntensityHint() const;
	bool GetIsAudioInside() const;
	ELastMissionResult GetMissionResultHint() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAudioSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAudioSubsystem")
	}
	static class UFWAudioSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAudioSubsystem>();
	}
};

// Class FWGameCore.FWBaseButton
// 0x0000 (0x02E0 - 0x02E0)
class UFWBaseButton : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWBaseButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWBaseButton")
	}
	static class UFWBaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWBaseButton>();
	}
};

// Class FWGameCore.FWCharacter
// 0x01B0 (0x0820 - 0x0670)
class AFWCharacter : public ACharacter
{
public:
	uint8                                         Pad_668[0x50];                                     // 0x0668(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CharacterId;                                       // 0x06B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             AIHitResult;                                       // 0x06C0(0x00F8)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bEnableTickThrottle;                               // 0x07B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPawnDefinition*                      PawnDefinition;                                    // 0x07C0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasSavedPawnDefinition;                           // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWPawnComponent*                       PawnComponentPrivate;                              // 0x07D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAbilitySystemComponent*              AbilitySystemComponentPrivate;                     // 0x07D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWHealthComponent*                     HealthComponentPrivate;                            // 0x07E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E8[0x38];                                     // 0x07E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FRotator GetCurrentControlRotation();
	bool GetIsGesturing();
	bool GetIsHellDiving();
	struct FRotator GetLeanRotator();
	int32 GetMeleeState();
	void HandleDowned(class UFWHealthComponent* HealthComponent);
	void HandleKilled(class UFWHealthComponent* HealthComponent, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void HandleRevived(class UFWHealthComponent* HealthComponent);
	bool IsOperatingStationaryGun();
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void OnPlayHit(float DamageTaken, const struct FHitResult& HitResult, class APawn* PawnInstigator, class AActor* DamageCauser, bool bKilled);
	void OnSpawnImpactEffect(const struct FHitResult& Hit, class AActor* DamageCauser);
	void OnSyncKilledDeath();
	void ProcessDamageTaken(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser, float* AdjustedDamageAmount);
	void ProcessNoDamageTaken(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void ResetMeleeState();
	void RespondToDamageTaken(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void SetIsGesturing(const bool bSetGesture);
	void SetIsHellDiving(const bool bIsHellDiving);
	void SetLeanRotator(const struct FRotator& LeanRotator);
	void SetMeleeState();
	void SimulatePhysics();

	struct FVector GetHeadSocketLocation() const;
	class ANavigationData* GetNavData() const;
	bool IsPlayerMovingDirectionally() const;
	bool IsRunningLootContainer() const;
	void SetAwarenessMarkerVisibility(bool bVisible) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCharacter")
	}
	static class AFWCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWCharacter>();
	}
};

// Class FWGameCore.FWCharacterMovementComponent
// 0x0040 (0x0FC0 - 0x0F80)
#pragma pack(push, 0x1)
class alignas(0x10) UFWCharacterMovementComponent : public UCharacterMovementComponent
{
public:
	struct FVector                                CharacterFacingDirection;                          // 0x0F78(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                CharacterAimingDirection;                          // 0x0F90(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCharacterStartedAiming;                           // 0x0FA8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCharacterStartedFacing;                           // 0x0FA9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FAA[0x2];                                      // 0x0FAA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimOffsetYaw;                                      // 0x0FAC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimOffsetPitch;                                    // 0x0FB0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FB4[0x4];                                      // 0x0FB4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCharacterMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCharacterMovementComponent")
	}
	static class UFWCharacterMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWCharacterMovementComponent>();
	}
};
#pragma pack(pop)

// Class FWGameCore.FWCharacterVoiceViewModel
// 0x0008 (0x0070 - 0x0068)
class UFWCharacterVoiceViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bIsTalking;                                        // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCharacterVoiceViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCharacterVoiceViewModel")
	}
	static class UFWCharacterVoiceViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWCharacterVoiceViewModel>();
	}
};

// Class FWGameCore.FWCommonBPFL
// 0x0000 (0x0028 - 0x0028)
class UFWCommonBPFL final : public UBlueprintFunctionLibrary
{
public:
	static int32 LexicalCompareText(const class FText& Left, const class FText& Right);
	static bool TextToGameplayTag(const class FName& TagName, struct FGameplayTag* Tag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCommonBPFL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCommonBPFL")
	}
	static class UFWCommonBPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWCommonBPFL>();
	}
};

// Class FWGameCore.FWDamageable
// 0x0000 (0x0000 - 0x0000)
class IFWDamageable final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDamageable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDamageable")
	}
	static class IFWDamageable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWDamageable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWGameCore.FWDamageBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UFWDamageBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float ApplyDamage(class AActor* DamagedActor, float BaseDamage, class AController* EventInstigator, class AActor* DamageCauser, TSubclassOf<class UFWDamageType> DamageTypeClass);
	static float ApplyPointDamage(class AActor* DamagedActor, float BaseDamage, const struct FVector& HitFromDirection, const struct FHitResult& HitInfo, class AController* EventInstigator, class AActor* DamageCauser, TSubclassOf<class UFWDamageType> DamageTypeClass);
	static bool ApplyRadialDamage(const class UObject* WorldContextObject, float BaseDamage, const struct FVector& Origin, float DamageRadius, TSubclassOf<class UFWDamageType> DamageTypeClass, const TArray<class AActor*>& IgnoreActors, class AActor* DamageCauser, class AController* InstigatedByController, bool bDoFullDamage, ECollisionChannel DamagePreventionChannel);
	static bool ApplyRadialDamageWithFalloff(const class UObject* WorldContextObject, float BaseDamage, float MinimumDamage, const struct FVector& Origin, float DamageInnerRadius, float DamageOuterRadius, float DamageFalloff, TSubclassOf<class UFWDamageType> DamageTypeClass, const TArray<class AActor*>& IgnoreActors, class AActor* DamageCauser, class AController* InstigatedByController, ECollisionChannel DamagePreventionChannel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDamageBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDamageBlueprintLibrary")
	}
	static class UFWDamageBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWDamageBlueprintLibrary>();
	}
};

// Class FWGameCore.FWDamageType
// 0x0000 (0x0040 - 0x0040)
class UFWDamageType : public UDamageType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDamageType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDamageType")
	}
	static class UFWDamageType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWDamageType>();
	}
};

// Class FWGameCore.FWDataDefinition
// 0x0018 (0x0048 - 0x0030)
class UFWDataDefinition : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDataDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDataDefinition")
	}
	static class UFWDataDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWDataDefinition>();
	}
};

// Class FWGameCore.FWDestructible
// 0x0038 (0x02C8 - 0x0290)
class AFWDestructible final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWGameplayAbilitySetDefinition*        DefaultAbilitySetDefinition;                       // 0x02A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWGameplayEffectSetDefinition*         DefaultEffectSetDefinition;                        // 0x02A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAbilitySystemComponent*              AbilitySystemComponentPrivate;                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWHealthComponent*                     HealthComponentPrivate;                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Killed(const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void ProcessDamageTaken(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser, float* AdjustedDamageAmount);
	void ProcessNoDamageTaken(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDestructible")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDestructible")
	}
	static class AFWDestructible* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWDestructible>();
	}
};

// Class FWGameCore.FWGameCoreStatics
// 0x0000 (0x0028 - 0x0028)
class UFWGameCoreStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AttachNaniteMechMeshToSkeleton(const class UStaticMeshComponent* StaticMeshComponent, class USkeletalMeshComponent* SkeletalMeshComponent, const class FString& MeshName, const class FString& Delimter, const struct FRotator& RelativeRotation);
	static void AttachNaniteMeshToSkeleton(const class UStaticMeshComponent* StaticMeshComponent, class USkeletalMeshComponent* SkeletalMeshComponent, const class FString& MeshName, const class FString& Delimter, const struct FRotator& RelativeRotation);
	static void AttachNaniteMeshToWeaponCustomizationSkeleton(const class UStaticMeshComponent* StaticMeshComponent, class USkeletalMeshComponent* SkeletalMeshComponent, const class FString& MeshName, const class FString& Delimter, const struct FRotator& RelativeRotation);
	static void AttachNaniteWeaponAttachmentMeshToSkeleton(class UStaticMeshComponent* StaticMeshComponent, class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName, const struct FRotator& RelativeRotation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameCoreStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameCoreStatics")
	}
	static class UFWGameCoreStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameCoreStatics>();
	}
};

// Class FWGameCore.FWGameModeBase
// 0x0018 (0x0340 - 0x0328)
class AFWGameModeBase : public AGameModeBase
{
public:
	TSubclassOf<class APawn>                      SpectatorPawn;                                     // 0x0328(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnAllPlayerPersistenceReady;                       // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void RestartGame();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameModeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameModeBase")
	}
	static class AFWGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWGameModeBase>();
	}
};

// Class FWGameCore.FWGameplayAbility
// 0x0008 (0x03B8 - 0x03B0)
class UFWGameplayAbility : public UGameplayAbility
{
public:
	EFWAbilityActivationPolicy                    ActivationPolicy;                                  // 0x03B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisplayMessageAboutOwnerForAllPlayers(const class FText& InFormat, const class FText& InMessage, const bool bIgnoreOwner);
	void DisplayMessageForAllPlayers(const class FText& InMessage, const bool bIgnoreOwner);

	bool IsInputTagHeld(const struct FGameplayTag& GameplayTag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayAbility")
	}
	static class UFWGameplayAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayAbility>();
	}
};

// Class FWGameCore.FWGameplayAbilitySetDefinition
// 0x0020 (0x0068 - 0x0048)
class UFWGameplayAbilitySetDefinition final : public UFWDataDefinition
{
public:
	TArray<TSubclassOf<class UFWGameplayAbility>> AbilityClasses;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FFWInputTagGameplayAbilitySet>  InputTagGameplayAbilities;                         // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayAbilitySetDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayAbilitySetDefinition")
	}
	static class UFWGameplayAbilitySetDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayAbilitySetDefinition>();
	}
};

// Class FWGameCore.FWGameplayAbilityPayload_PlayMontage
// 0x0020 (0x0048 - 0x0028)
class UFWGameplayAbilityPayload_PlayMontage final : public UObject
{
public:
	struct FFWAbilityMontageData                  MontageData;                                       // 0x0028(0x0020)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayAbilityPayload_PlayMontage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayAbilityPayload_PlayMontage")
	}
	static class UFWGameplayAbilityPayload_PlayMontage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayAbilityPayload_PlayMontage>();
	}
};

// Class FWGameCore.FWGameplayAbility_PlayMontage
// 0x0008 (0x03C0 - 0x03B8)
class UFWGameplayAbility_PlayMontage : public UFWGameplayAbility
{
public:
	class UFWGameplayAbilityPayload_PlayMontage*  Payload;                                           // 0x03B8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayAbility_PlayMontage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayAbility_PlayMontage")
	}
	static class UFWGameplayAbility_PlayMontage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayAbility_PlayMontage>();
	}
};

// Class FWGameCore.FWGameplayCueNotify_Burst
// 0x0000 (0x0350 - 0x0350)
class UFWGameplayCueNotify_Burst : public UGameplayCueNotify_Burst
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayCueNotify_Burst")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayCueNotify_Burst")
	}
	static class UFWGameplayCueNotify_Burst* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayCueNotify_Burst>();
	}
};

// Class FWGameCore.FWGameplayEffect
// 0x0000 (0x0A70 - 0x0A70)
class UFWGameplayEffect : public UGameplayEffect
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayEffect")
	}
	static class UFWGameplayEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayEffect>();
	}
};

// Class FWGameCore.FWGameplayEffectSetDefinition
// 0x0010 (0x0058 - 0x0048)
class UFWGameplayEffectSetDefinition final : public UFWDataDefinition
{
public:
	TArray<TSubclassOf<class UFWGameplayEffect>>  EffectClasses;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayEffectSetDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayEffectSetDefinition")
	}
	static class UFWGameplayEffectSetDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayEffectSetDefinition>();
	}
};

// Class FWGameCore.FWGameplayTask
// 0x0000 (0x0068 - 0x0068)
class UFWGameplayTask final : public UGameplayTask
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameplayTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameplayTask")
	}
	static class UFWGameplayTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameplayTask>();
	}
};

// Class FWGameCore.FWGameSettings
// 0x0018 (0x0050 - 0x0038)
class UFWGameSettings : public UDeveloperSettings
{
public:
	int32                                         ExtractionExperience;                              // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReviveExperience;                                  // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFWAIPlayableCharactersSettings        PlayableCharactersSettings;                        // 0x0040(0x0010)(Edit, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameSettings")
	}
	static class UFWGameSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameSettings>();
	}
};

// Class FWGameCore.FWGameStateBase
// 0x0068 (0x0350 - 0x02E8)
class AFWGameStateBase : public AGameStateBase
{
public:
	class UDataLayerAsset*                        LightingScenarioLayer;                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MissionStartTime;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         MissionEndTime;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const class FName BuddyTag, class APawn* BuddyPawn)> OnRecruitSpawnedDelegate; // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 NextBuddyIndex)> OnRecruitActionChangedDelegate;             // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const class FString& PlayerName, const bool bIsHost)> OnPlayerStateAddedDelegate; // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const class FString& PlayerName, const bool bIsHost)> OnPlayerStateRemovedDelegate; // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFWRecruitInfo>                 Recruits;                                          // 0x0340(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class AFWGameStateBase* GetFWGameStateBase(const class UObject* WorldContextObject);

	bool LoadRandomDataLayer(const TMap<class UDataLayerAsset*, float>& LayerWeights);
	void MulticastDisplayMessageForAllPlayers(const class FText& Message, const TArray<class APlayerController*>& IgnoredPlayers, const TArray<class APlayerController*>& OtherPlayers, const class FText& OtherPlayerMessage);
	void OnPlayerNameChanged(const class FString& NewName, class AFWPlayerStateBase* PlayerState);
	void ServerDisplayMessageForAllPlayers(const class FText& Message, const TArray<class APlayerController*>& IgnoredPlayers, const TArray<class APlayerController*>& OtherPlayers, const class FText& OtherPlayerMessage);

	void ClientInvokeReplicatedEvent(const class UFWReplicatedEventHandler* Event, class AActor* TargetActor) const;
	struct FDateTime GetMissionEndTime() const;
	struct FDateTime GetMissionStartTime() const;
	const TArray<struct FFWRecruitInfo> GetRecruits() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameStateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameStateBase")
	}
	static class AFWGameStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWGameStateBase>();
	}
};

// Class FWGameCore.FWGameViewportClient
// 0x0010 (0x0400 - 0x03F0)
class UFWGameViewportClient final : public UCommonGameViewportClient
{
public:
	uint8                                         Pad_3F0[0x10];                                     // 0x03F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWGameViewportClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWGameViewportClient")
	}
	static class UFWGameViewportClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWGameViewportClient>();
	}
};

// Class FWGameCore.FWHardpointContainerInterface
// 0x0000 (0x0000 - 0x0000)
class IFWHardpointContainerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHardpointContainerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHardpointContainerInterface")
	}
	static class IFWHardpointContainerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWHardpointContainerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWGameCore.FWHardpointDetachmentMetadata
// 0x0048 (0x0090 - 0x0048)
class UFWHardpointDetachmentMetadata final : public UFWDataDefinition
{
public:
	struct FVector                                ColliderLocationOffset;                            // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ColliderRotationOffset;                            // 0x0060(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ColliderExtents;                                   // 0x0078(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHardpointDetachmentMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHardpointDetachmentMetadata")
	}
	static class UFWHardpointDetachmentMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWHardpointDetachmentMetadata>();
	}
};

// Class FWGameCore.FWHardpointWeaponMetadata
// 0x0040 (0x0088 - 0x0048)
class UFWHardpointWeaponMetadata final : public UFWDataDefinition
{
public:
	class FName                                   AimSocket;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MuzzleSocket;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Projectile;                                        // 0x0058(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FireRate;                                          // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoundsPerVolley;                                   // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHardpointWeaponMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHardpointWeaponMetadata")
	}
	static class UFWHardpointWeaponMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWHardpointWeaponMetadata>();
	}
};

// Class FWGameCore.FWHealthBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UFWHealthBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UFWHealthComponent* GetHealthComponentForActor(class AActor* Actor);
	static float GetHealthForActor(class AActor* Actor);
	static float GetHealthForCharacter(class AFWCharacter* Character);
	static float GetHealthRatioForActor(const class AActor* Actor);
	static float GetHealthRatioForCharacter(const class AFWCharacter* Character);
	static float GetMaxHealthForActor(class AActor* Actor);
	static float GetMaxHealthForCharacter(class AFWCharacter* Character);
	static bool IsActorAlive(class AActor* Actor);
	static bool IsActorDead(class AActor* Actor);
	static bool IsActorDeadOrDown(class AActor* Actor);
	static bool IsActorDown(class AActor* Actor);
	static bool IsActorStunned(class AActor* Actor);
	static bool IsCharacterAlive(class AFWCharacter* Character);
	static bool IsCharacterDead(class AFWCharacter* Character);
	static bool IsCharacterDeadOrDown(class AFWCharacter* Character);
	static bool IsCharacterDown(class AFWCharacter* Character);
	static bool IsCharacterStunned(class AFWCharacter* Character);
	static bool KillActor(class AActor* Actor, TSubclassOf<class UFWDamageType> DamageType, class AController* EventInstigator, class AActor* DamageCauser, bool bSkipDownState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHealthBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHealthBlueprintLibrary")
	}
	static class UFWHealthBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWHealthBlueprintLibrary>();
	}
};

// Class FWGameCore.FWHealthComponent
// 0x00A0 (0x0140 - 0x00A0)
class UFWHealthComponent final : public UActorComponent
{
public:
	FMulticastSparseDelegateProperty_             OnHealthChanged;                                   // 0x00A0(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnMaxHealthChanged;                                // 0x00A1(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnDowned;                                          // 0x00A2(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnRevived;                                         // 0x00A3(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnKilled;                                          // 0x00A4(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDamageType>                LastDamageTypeClass;                               // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x48];                                      // 0x00B0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultHealth;                                     // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DefaultMaxHealth;                                  // 0x00FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisableDownEvent;                                 // 0x0100(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvulnerable;                                     // 0x0101(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_102[0xE];                                      // 0x0102(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAttributeSet_Health*                 HealthAttributeSet;                                // 0x0110(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x28];                                     // 0x0118(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float NotifyTakeDamage(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);

	float GetHealth() const;
	float GetHealthRatio() const;
	float GetMaxHealth() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHealthComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHealthComponent")
	}
	static class UFWHealthComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWHealthComponent>();
	}
};

// Class FWGameCore.FWKnockDownDamageType
// 0x0000 (0x0040 - 0x0040)
class UFWKnockDownDamageType : public UFWDamageType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWKnockDownDamageType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWKnockDownDamageType")
	}
	static class UFWKnockDownDamageType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWKnockDownDamageType>();
	}
};

// Class FWGameCore.FWKnockDownMeleeDamageType
// 0x0000 (0x0040 - 0x0040)
class UFWKnockDownMeleeDamageType final : public UFWDamageType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWKnockDownMeleeDamageType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWKnockDownMeleeDamageType")
	}
	static class UFWKnockDownMeleeDamageType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWKnockDownMeleeDamageType>();
	}
};

// Class FWGameCore.FWLocalPlayer
// 0x0000 (0x02B0 - 0x02B0)
class UFWLocalPlayer final : public ULocalPlayer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWLocalPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWLocalPlayer")
	}
	static class UFWLocalPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWLocalPlayer>();
	}
};

// Class FWGameCore.FWMechCharacterInterface
// 0x0000 (0x0000 - 0x0000)
class IFWMechCharacterInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWMechCharacterInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWMechCharacterInterface")
	}
	static class IFWMechCharacterInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWMechCharacterInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWGameCore.FWMessageInterface
// 0x0000 (0x0000 - 0x0000)
class IFWMessageInterface final
{
public:
	void GetSendDataTag(const struct FGameplayTag& DataTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWMessageInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWMessageInterface")
	}
	static class IFWMessageInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWMessageInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWGameCore.FWMessageListenerComponent
// 0x0100 (0x01A0 - 0x00A0)
class UFWMessageListenerComponent final : public UActorComponent
{
public:
	struct FGameplayTag                           UINavigationChannel;                               // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UITextDisplayChannel;                              // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0xF0];                                      // 0x00B0(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RouteToastMessages(const struct FGameplayTag& DisplayTextIntent, TDelegate<void(const struct FGameplayTag& IntentTag, class APlayerController* PlayerController, const class FText& Message)> Endpoint);
	void RouteUINavigation(const struct FGameplayTag& NavigationIntent, TDelegate<void(const struct FGameplayTag& IntentTag, class APlayerController* PlayerController)> Endpoint);
	void RouteUINavigationToWidget(const struct FGameplayTag& NavigationIntent, TSoftClassPtr<class UClass> WidgetToCreate);
	void UnrouteToastMessages(const struct FGameplayTag& DisplayTextIntent, TDelegate<void(const struct FGameplayTag& IntentTag, class APlayerController* PlayerController, const class FText& Message)> Endpoint);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWMessageListenerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWMessageListenerComponent")
	}
	static class UFWMessageListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWMessageListenerComponent>();
	}
};

// Class FWGameCore.FWMessageSettings
// 0x0060 (0x0098 - 0x0038)
class UFWMessageSettings final : public UDeveloperSettings
{
public:
	class FText                                   HostMessage_ClientJoin;                            // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FText                                   HostMessage_ClientLeft;                            // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FText                                   ClientMessage_OtherJoin;                           // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FText                                   ClientMessage_OtherLeft;                           // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FText                                   ClientMessage_HostLeft;                            // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FText                                   ClientMessage_SelfJoin;                            // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWMessageSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWMessageSettings")
	}
	static class UFWMessageSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWMessageSettings>();
	}
};

// Class FWGameCore.FWModifierKeyTrigger
// 0x0018 (0x0068 - 0x0050)
class UFWModifierKeyTrigger final : public UInputTrigger
{
public:
