#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWHubWorld

#include "Basic.hpp"

#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FWHubWorld_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "FWOnlineServices_structs.hpp"
#include "FWSession_structs.hpp"


namespace SDK::Params
{

// Function FWHubWorld.FWCollectableInventoryActor.GetPickupPromptText
// 0x0010 (0x0010 - 0x0000)
struct FWCollectableInventoryActor_GetPickupPromptText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWCollectableInventoryActor.HandleBeginOverlap
// 0x0118 (0x0118 - 0x0000)
struct FWCollectableInventoryActor_HandleBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWCollectableInventoryActor.HandleEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct FWCollectableInventoryActor_HandleEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWDonationStation.SetWeaponDetails
// 0x0230 (0x0230 - 0x0000)
struct FWDonationStation_SetWeaponDetails final
{
public:
	class FName                                   WeaponRow;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInventoryDangly                       WeaponDetails;                                     // 0x0008(0x0228)(Parm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWDonationStation.SetWeaponFilter
// 0x0008 (0x0008 - 0x0000)
struct FWDonationStation_SetWeaponFilter final
{
public:
	struct FGameplayTag                           FilterTag;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWDonationStationActor.HandleDailyRewardTimer
// 0x0020 (0x0020 - 0x0000)
struct FWDonationStationActor_HandleDailyRewardTimer final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ExpectedOccurrence;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              PastDue;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         OccurrenceCount;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWaterFunctionLibrary.GetCurrentHubRemainingWater
// 0x0010 (0x0010 - 0x0000)
struct FWHubWaterFunctionLibrary_GetCurrentHubRemainingWater final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWaterFunctionLibrary.HasEnoughWaterForQuestGiver
// 0x0058 (0x0058 - 0x0000)
struct FWHubWaterFunctionLibrary_HasEnoughWaterForQuestGiver final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuestGiverData                        QuestGiverDetails;                                 // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWaterFunctionLibrary.HasEnoughWaterForVendor
// 0x00F0 (0x00F0 - 0x0000)
struct FWHubWaterFunctionLibrary_HasEnoughWaterForVendor final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFWVendorDetails                       VendorDetails;                                     // 0x0008(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWorldGameMode.GetMissionState
// 0x0060 (0x0060 - 0x0000)
struct FWHubWorldGameMode_GetMissionState final
{
public:
	struct FFWHubWorldMissionState                ReturnValue;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.IncrementCountdown
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldGameState_IncrementCountdown final
{
public:
	int32                                         HowLong;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.ServerIncrementCountdown
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldGameState_ServerIncrementCountdown final
{
public:
	int32                                         HowLong;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.SetInsertionPoint
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldGameState_SetInsertionPoint final
{
public:
	class FName                                   InsertionPointKey;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InsertionPointFriendlyName;                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.SetIsReadyToLaunch
// 0x0001 (0x0001 - 0x0000)
struct FWHubWorldGameState_SetIsReadyToLaunch final
{
public:
	bool                                          bNewIsReadyToLaunch;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.SetMissionGameMode
// 0x0008 (0x0008 - 0x0000)
struct FWHubWorldGameState_SetMissionGameMode final
{
public:
	TSubclassOf<class AGameStateBase>             NewGameMode;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.SetMissionMap
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldGameState_SetMissionMap final
{
public:
	class FName                                   NewMapKey;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   NewMapFriendlyName;                                // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.UpdateWaterDataFromEvent
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldGameState_UpdateWaterDataFromEvent final
{
public:
	int32                                         NewWaterAmount;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.GetMissionState
// 0x0060 (0x0060 - 0x0000)
struct FWHubWorldGameState_GetMissionState final
{
public:
	struct FFWHubWorldMissionState                ReturnValue;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldGameState.GetWaterRemaining
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldGameState_GetWaterRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.CheckForSpecifiedFTUE
// 0x0030 (0x0030 - 0x0000)
struct FWHubWorldPlayerController_CheckForSpecifiedFTUE final
{
public:
	struct FFWFTUEData                            FTUEData;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.ClientRefundInventoryExchange
// 0x0050 (0x0050 - 0x0000)
struct FWHubWorldPlayerController_ClientRefundInventoryExchange final
{
public:
	TSoftObjectPtr<class UFWExchangeFormula>      NewExchangeFormula;                                // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFWFormulaGroup>         FormulaGroup;                                      // 0x0028(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.IsAuthorizedToLaunch
// 0x0001 (0x0001 - 0x0000)
struct FWHubWorldPlayerController_IsAuthorizedToLaunch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.IsHost
// 0x0001 (0x0001 - 0x0000)
struct FWHubWorldPlayerController_IsHost final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.OnAllReadyToLaunchChanged
// 0x0001 (0x0001 - 0x0000)
struct FWHubWorldPlayerController_OnAllReadyToLaunchChanged final
{
public:
	bool                                          bNewIsReadyToLaunch;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.ReceiveRewardItem
// 0x0020 (0x0020 - 0x0000)
struct FWHubWorldPlayerController_ReceiveRewardItem final
{
public:
	struct FDataTableRowHandle                    ItemTableRow;                                      // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ItemContext;                                       // 0x0014(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWorldPlayerController.RedeemQuestRewards
// 0x0008 (0x0008 - 0x0000)
struct FWHubWorldPlayerController_RedeemQuestRewards final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.SendToast
// 0x0010 (0x0010 - 0x0000)
struct FWHubWorldPlayerController_SendToast final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.Server_SetCharacterClassKey
// 0x0008 (0x0008 - 0x0000)
struct FWHubWorldPlayerController_Server_SetCharacterClassKey final
{
public:
	class FName                                   NewCharacterClassKey;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.Server_SetPlayerXP
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldPlayerController_Server_SetPlayerXP final
{
public:
	int32                                         NewPlayerXP;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.Server_SetReadyStatus
// 0x0001 (0x0001 - 0x0000)
struct FWHubWorldPlayerController_Server_SetReadyStatus final
{
public:
	bool                                          bLocalPlayerIsReady;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.ServerHandleAmmoPickedUp
// 0x0010 (0x0010 - 0x0000)
struct FWHubWorldPlayerController_ServerHandleAmmoPickedUp final
{
public:
	class AFWHubWorldGameState*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 What;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.ServerRequestInventoryExchange
// 0x0050 (0x0050 - 0x0000)
struct FWHubWorldPlayerController_ServerRequestInventoryExchange final
{
public:
	TSoftObjectPtr<class UFWExchangeFormula>      NewExchangeFormula;                                // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFWFormulaGroup>         FormulaGroup;                                      // 0x0028(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.ServerSwapPlayerCharacter
// 0x0028 (0x0028 - 0x0000)
struct FWHubWorldPlayerController_ServerSwapPlayerCharacter final
{
public:
	TSoftObjectPtr<class UFWPlayerCharacterDefinition> InPlayerCharacterDefinitionPtr;               // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.SetReadyStatus
// 0x0001 (0x0001 - 0x0000)
struct FWHubWorldPlayerController_SetReadyStatus final
{
public:
	bool                                          bPlayerIsReady;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.WaterTradeAction
// 0x0088 (0x0088 - 0x0000)
struct FWHubWorldPlayerController_WaterTradeAction final
{
public:
	struct FPartyTransactionRequest               Request;                                           // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerController.WaterTradeCheck
// 0x0090 (0x0090 - 0x0000)
struct FWHubWorldPlayerController_WaterTradeCheck final
{
public:
	struct FPartyTransactionRequest               Request;                                           // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWorldPlayerController.AddWater
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldPlayerController_AddWater final
{
public:
	int32                                         Days;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.AdjustInventory
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldPlayerState_AdjustInventory final
{
public:
	TArray<struct FFWInventoryAdjustment>         Adjustment;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.CheckInventory
// 0x0060 (0x0060 - 0x0000)
struct FWHubWorldPlayerState_CheckInventory final
{
public:
	TMap<class FName, int32>                      DesiredQuantities;                                 // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0050(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWorldPlayerState.ClientAdjustInventoryQuantities
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldPlayerState_ClientAdjustInventoryQuantities final
{
public:
	TArray<struct FFWInventoryAdjustment>         Adjustment;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.GetInventoryQuantity
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldPlayerState_GetInventoryQuantity final
{
public:
	class FName                                   InventoryTableRowName;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UDataTable*                       DataTable;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWorldPlayerState.GetStashedWeapons
// 0x0010 (0x0010 - 0x0000)
struct FWHubWorldPlayerState_GetStashedWeapons final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.LocalSetEquippedSkill
// 0x0028 (0x0028 - 0x0000)
struct FWHubWorldPlayerState_LocalSetEquippedSkill final
{
public:
	TSoftObjectPtr<class UPrimaryDataAsset>       NewEquippedSkill;                                  // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.OnOutOfWater
// 0x0020 (0x0020 - 0x0000)
struct FWHubWorldPlayerState_OnOutOfWater final
{
public:
	class UFWPersistenceSubsystem*                Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ExpectedOccurrence;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              PastDue;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         OccurrenceCount;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.OnWaterAmountChanged
// 0x0004 (0x0004 - 0x0000)
struct FWHubWorldPlayerState_OnWaterAmountChanged final
{
public:
	int32                                         NewAmount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.RequestUpdateRig
// 0x0078 (0x0078 - 0x0000)
struct FWHubWorldPlayerState_RequestUpdateRig final
{
public:
	TSoftObjectPtr<class UTexture2D>              DefaultTexture;                                    // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 CustomTexture;                                     // 0x0028(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FIntPoint                              CustomTextureSize;                                 // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RigName;                                           // 0x0040(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   RigNickname;                                       // 0x0050(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         CurrentWeight;                                     // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWeight;                                         // 0x0064(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlayerItems>                   CustomItems;                                       // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.RequestUpdateWeapon
// 0x0070 (0x0070 - 0x0000)
struct FWHubWorldPlayerState_RequestUpdateWeapon final
{
public:
	int32                                         WeaponIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              DefaultTexture;                                    // 0x0008(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 CustomTexture;                                     // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FIntPoint                              CustomTextureSize;                                 // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   WeaponName;                                        // 0x0048(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   WeaponNickname;                                    // 0x0058(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ClipSize;                                          // 0x0068(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmmoCount;                                         // 0x006C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.SendWater
// 0x0020 (0x0020 - 0x0000)
struct FWHubWorldPlayerState_SendWater final
{
public:
	const class AFWHubWorldPlayerState*           Target;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSuccess)>                OnWaterSendComplete;                               // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWHubWorld.FWHubWorldPlayerState.ServerDonateWeapon
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldPlayerState_ServerDonateWeapon final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   What;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWDonationStationActor*                DonationActor;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.ServerSetEquippedSkill
// 0x0028 (0x0028 - 0x0000)
struct FWHubWorldPlayerState_ServerSetEquippedSkill final
{
public:
	TSoftObjectPtr<class UPrimaryDataAsset>       NewEquippedSkill;                                  // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.ServerSetWaterInfo
// 0x000C (0x000C - 0x0000)
struct FWHubWorldPlayerState_ServerSetWaterInfo final
{
public:
	int32                                         InCurrentWater;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAvailableWaterCapacity;                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxWaterCapacity;                                // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.ServerTake
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldPlayerState_ServerTake final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   What;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWDonationStationActor*                DonationActor;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.ServerTakeDonation
// 0x0018 (0x0018 - 0x0000)
struct FWHubWorldPlayerState_ServerTakeDonation final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWDonationStationActor*                DonationActor;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.ServerTakeReward
// 0x0010 (0x0010 - 0x0000)
struct FWHubWorldPlayerState_ServerTakeReward final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWDonationStationActor*                DonationActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.FWHubWorldPlayerState.SetPawnWithLoadout
// 0x0008 (0x0008 - 0x0000)
struct FWHubWorldPlayerState_SetPawnWithLoadout final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.HubWorldManagerActor.SetHubActorsToShow
// 0x0010 (0x0010 - 0x0000)
struct HubWorldManagerActor_SetHubActorsToShow final
{
public:
	TArray<class FName>                           InHubActorsToShow;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.UpdatePlayerLoadout.UpdateRig
// 0x0078 (0x0078 - 0x0000)
struct UpdatePlayerLoadout_UpdateRig final
{
public:
	TSoftObjectPtr<class UTexture2D>              DefaultTexture;                                    // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 CustomTexture;                                     // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FIntPoint                              CustomTextureSize;                                 // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RigName;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   RigNickname;                                       // 0x0050(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         CurrentWeight;                                     // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWeight;                                         // 0x0064(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlayerItems>                   CustomItems;                                       // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWHubWorld.UpdatePlayerLoadout.UpdateWeapon
// 0x0070 (0x0070 - 0x0000)
struct UpdatePlayerLoadout_UpdateWeapon final
{
public:
	int32                                         WeaponIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              DefaultTexture;                                    // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 CustomTexture;                                     // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FIntPoint                              CustomTextureSize;                                 // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   WeaponName;                                        // 0x0048(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   WeaponNickname;                                    // 0x0058(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ClipSize;                                          // 0x0068(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmmoCount;                                         // 0x006C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

