#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWHubWorld

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"
#include "FWGameCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FWHubWorld_structs.hpp"


namespace SDK
{

// Class FWHubWorld.FWCollectableInventoryActor
// 0x0040 (0x02D0 - 0x0290)
class AFWCollectableInventoryActor : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       SphereComponent;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UISendMessageChannel;                              // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UISendToastMessageTag;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   UnmaskedItemNoun;                                  // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bUnmaskedItem;                                     // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class FText GetPickupPromptText();
	void HandleBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void HandleEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCollectableInventoryActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCollectableInventoryActor")
	}
	static class AFWCollectableInventoryActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWCollectableInventoryActor>();
	}
};

// Class FWHubWorld.FWCollectableAmmoOutputActor
// 0x0018 (0x02E8 - 0x02D0)
class AFWCollectableAmmoOutputActor final : public AFWCollectableInventoryActor
{
public:
	class UFWFormulaGroup*                        FormulaGroup;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFWExchangeFormula*                     Formula;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ItemMeshComponent;                                 // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_Formula();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCollectableAmmoOutputActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCollectableAmmoOutputActor")
	}
	static class AFWCollectableAmmoOutputActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWCollectableAmmoOutputActor>();
	}
};

// Class FWHubWorld.FWDonationStation
// 0x0098 (0x0378 - 0x02E0)
class UFWDonationStation final : public UUserWidget
{
public:
	class UGridPanel*                             StashGrid;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGridPanel*                             DonationBoxGrid;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFWDonationStationWeaponCard> CardClass;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UDataTable>              InventoryItemTableSoftPtr;                         // 0x02F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFWDonationStationWeaponCard*>   WeaponCards;                                       // 0x0320(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0x48];                                     // 0x0330(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideWeaponDetails();
	void SetWeaponDetails(const class FName& WeaponRow, const struct FInventoryDangly& WeaponDetails);
	void SetWeaponFilter(const struct FGameplayTag& FilterTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDonationStation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDonationStation")
	}
	static class UFWDonationStation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWDonationStation>();
	}
};

// Class FWHubWorld.FWDonationStationActor
// 0x00F8 (0x0388 - 0x0290)
class AFWDonationStationActor : public AActor
{
public:
	TSoftObjectPtr<class UFWDailyGiftList>        SpawnSelection;                                    // 0x0290(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimespan                              InitialSpawnPeriod;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimespan                              SpawnPeriod;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UISendToastMessageTag;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UISendMessageChannel;                              // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   NotificationText;                                  // 0x02D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                   DailyRewardEventName;                              // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RewardInventoryName;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           DonationInventoryNames;                            // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           DailyRewards;                                      // 0x0308(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           Donations;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   DonationStationWidgetClass;                        // 0x0328(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFWDonationStation*                     DonationStationWidget;                             // 0x0350(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x30];                                     // 0x0358(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleDailyRewardTimer(class UFWPersistenceSubsystem* Subsystem, const struct FDateTime& ExpectedOccurrence, const struct FTimespan& PastDue, int64 OccurrenceCount);
	void OnRep_DailyRewards();
	void OnRep_Donations();
	void TestReward();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDonationStationActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDonationStationActor")
	}
	static class AFWDonationStationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWDonationStationActor>();
	}
};

// Class FWHubWorld.FWDonationStationWeaponCard
// 0x0290 (0x0570 - 0x02E0)
class UFWDonationStationWeaponCard final : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x48];                                     // 0x02E0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                IconButton;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 IconImage;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             WeaponName;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x230];                                    // 0x0340(0x0230)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleButtonClicked();
	void HandleButtonHovered();
	void HandleButtonUnhovered();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDonationStationWeaponCard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDonationStationWeaponCard")
	}
	static class UFWDonationStationWeaponCard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWDonationStationWeaponCard>();
	}
};

// Class FWHubWorld.FWExchangeFormula
// 0x00A8 (0x00F0 - 0x0048)
class UFWExchangeFormula final : public UFWDataDefinition
{
public:
	float                                         ExchangeTime;                                      // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsTestOnly;                                       // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      Inputs;                                            // 0x0050(0x0050)(Edit, NativeAccessSpecifierPrivate)
	TMap<class FName, int32>                      Outputs;                                           // 0x00A0(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWExchangeFormula")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWExchangeFormula")
	}
	static class UFWExchangeFormula* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWExchangeFormula>();
	}
};

// Class FWHubWorld.FWFormulaGroup
// 0x0038 (0x0080 - 0x0048)
class UFWFormulaGroup final : public UFWDataDefinition
{
public:
	TArray<class UFWExchangeFormula*>             Formulas;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UDataTable>              InventoryItemTable;                                // 0x0058(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWFormulaGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWFormulaGroup")
	}
	static class UFWFormulaGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWFormulaGroup>();
	}
};

// Class FWHubWorld.FWHubWaterFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFWHubWaterFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetCurrentHubRemainingWater(const class UObject* WorldContextObject);
	static bool HasEnoughWaterForQuestGiver(const class UObject* WorldContextObject, const struct FQuestGiverData& QuestGiverDetails);
	static bool HasEnoughWaterForVendor(const class UObject* WorldContextObject, const struct FFWVendorDetails& VendorDetails);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHubWaterFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHubWaterFunctionLibrary")
	}
	static class UFWHubWaterFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWHubWaterFunctionLibrary>();
	}
};

// Class FWHubWorld.FWHubWorldGameMode
// 0x0068 (0x03A8 - 0x0340)
class AFWHubWorldGameMode : public AFWGameModeBase
{
public:
	int32                                         DefaultCountdownDuration;                          // 0x0340(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_344[0x5C];                                     // 0x0344(0x005C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CalculatedWaterCost;                               // 0x03A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCountdownFinished();

	const struct FFWHubWorldMissionState GetMissionState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHubWorldGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHubWorldGameMode")
	}
	static class AFWHubWorldGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWHubWorldGameMode>();
	}
};

// Class FWHubWorld.FWHubWorldGameState
// 0x01D8 (0x0528 - 0x0350)
class AFWHubWorldGameState : public AFWGameStateBase
{
public:
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsReadyToLaunch : 1;                              // 0x0358(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsCountingDown : 1;                               // 0x0358(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountDownTimeRemaining;                            // 0x035C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           RewardWeapons;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           DonatedWeapons;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FFWHubWorldMissionState                MissionState;                                      // 0x0388(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, RepNotify, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   CollectableInventoryClass;                         // 0x03E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ExchangeStartedGameplayMessage;                    // 0x0410(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ExchangeReadyGameplayMessage;                      // 0x0418(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ExchangeCompleteGameplayMessage;                   // 0x0420(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           OutputPlacedGameplayMessage;                       // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxCountdownDuration;                              // 0x0430(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWCollectableAmmoOutputActor*          PendingPickup;                                     // 0x0438(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   HubName;                                           // 0x0440(0x0010)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         HubWaterAmount;                                    // 0x0450(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerAsset*                        LowWaterWorldDataLayer;                            // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFWExchangeFormula*                     ExchangeInProgress;                                // 0x0460(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   ExchangeAlreadyInProgressMessage;                  // 0x0468(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bNewIsCountingDown)> OnIsCountingDownChanged;                 // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 NewCountDownRemaining)> OnCountdownTimeRemaingChanged;       // 0x04A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCountdownFinished;                               // 0x04B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bNewIsReadyToLaunch)> OnReadyToLaunchChanged;                 // 0x04C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFWHubWorldMissionState& bNewMissionState)> OnMissionStateChanged; // 0x04D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UFWExchangeFormula* NewExchangeFormula)> OnInventoryExchangeStarted; // 0x04E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInventoryExchangeReady;                          // 0x04F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInventoryExchangeEnded;                          // 0x0500(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_510[0x18];                                     // 0x0510(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AbortCountdown();
	void AmmoPickedUp();
	void BeginCountdown();
	void IncrementCountdown(int32 HowLong);
	void OnRep_CountDownTimeRemaining();
	void OnRep_ExchangeInProgress();
	void OnRep_HubWaterExpiry();
	void OnRep_IsCountingDown();
	void OnRep_IsReadyToLaunch();
	void OnRep_MissionState();
	void ServerIncrementCountdown(int32 HowLong);
	void SetInsertionPoint(class FName InsertionPointKey, const class FText& InsertionPointFriendlyName);
	void SetIsReadyToLaunch(bool bNewIsReadyToLaunch);
	void SetMissionGameMode(TSubclassOf<class AGameStateBase> NewGameMode);
	void SetMissionMap(class FName NewMapKey, const class FText& NewMapFriendlyName);
	void UpdateWaterDataFromEvent(int32 NewWaterAmount);
	void UpdateWaterDataFromLocalPlayer();

	const struct FFWHubWorldMissionState GetMissionState() const;
	float GetWaterRemaining() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHubWorldGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHubWorldGameState")
	}
	static class AFWHubWorldGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWHubWorldGameState>();
	}
};

// Class FWHubWorld.FWHubWorldPlayerController
// 0x00D8 (0x0A40 - 0x0968)
class AFWHubWorldPlayerController : public AFWPlayerController
{
public:
	class UDataTable*                             FTUEPopupDataTable;                                // 0x0968(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_970[0x28];                                     // 0x0970(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FTUEZOrder;                                        // 0x0998(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FTUEFullCheckDelayTime;                            // 0x099C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A0[0x8];                                      // 0x09A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountDownTimerDuration;                            // 0x09A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                LobbyHUDClass;                                     // 0x09B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                            LobbyHUDInstance;                                  // 0x09B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFWPickupAdvertisementWidget> PickupAdvertisementWidgetClass;                  // 0x09C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFWPickupAdvertisementWidget*           PickupAdvertisementWidgetInstance;                 // 0x09C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayMenu;                                      // 0x09D0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsReady;                                          // 0x09D1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9D2[0x6];                                      // 0x09D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWQuestComponent*                      QuestComponent;                                    // 0x09D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9E0[0x10];                                     // 0x09E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, TSoftClassPtr<class UClass>> NavigateToWidgetMap;                      // 0x09F0(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AbortCountdown();
	void BeginCountdown();
	void CheckForSpecifiedFTUE(const struct FFWFTUEData& FTUEData);
	void ClientRefundInventoryExchange(const TSoftObjectPtr<class UFWExchangeFormula>& NewExchangeFormula, const TSoftObjectPtr<class UFWFormulaGroup>& FormulaGroup);
	void ExitToMainMenu();
	bool IsAuthorizedToLaunch();
	bool IsHost();
	void OnAllReadyToLaunchChanged(bool bNewIsReadyToLaunch);
	void OnExitRequested();
	void OnRep_DisplayMenu();
	void OnRep_IsReady();
	void ReceiveRewardItem(const struct FDataTableRowHandle& ItemTableRow, int32 Count, const struct FGameplayTag& ItemContext);
	void RedeemQuestRewards(class UFWQuest* Quest);
	void SendToast(const class FText& Message);
	void Server_SetCharacterClassKey(class FName NewCharacterClassKey);
	void Server_SetPlayerXP(int32 NewPlayerXP);
	void Server_SetReadyStatus(bool bLocalPlayerIsReady);
	void ServerHandleAmmoPickedUp(class AFWHubWorldGameState* GameState, class AActor* What);
	void ServerRequestInventoryExchange(const TSoftObjectPtr<class UFWExchangeFormula>& NewExchangeFormula, const TSoftObjectPtr<class UFWFormulaGroup>& FormulaGroup);
	void ServerSwapPlayerCharacter(const TSoftObjectPtr<class UFWPlayerCharacterDefinition>& InPlayerCharacterDefinitionPtr);
	void SetReadyStatus(bool bPlayerIsReady);
	void WaterTradeAction(const struct FPartyTransactionRequest& Request);
	bool WaterTradeCheck(const struct FPartyTransactionRequest& Request);

	void AddWater(int32 Days) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHubWorldPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHubWorldPlayerController")
	}
	static class AFWHubWorldPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWHubWorldPlayerController>();
	}
};

// Class FWHubWorld.FWHubWorldPlayerState
// 0x0138 (0x0550 - 0x0418)
class AFWHubWorldPlayerState : public AFWPlayerStateBase
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsReadyToLaunch;                                  // 0x0420(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharacterClassKey;                                 // 0x0424(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PlayerXP;                                          // 0x042C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPlayerRig                             Rig;                                               // 0x0430(0x0078)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPlayerWeapon>                  Weapons;                                           // 0x04A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UPrimaryDataAsset>       EquippedSkill;                                     // 0x04B8(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentWater;                                      // 0x04E0(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AvailableWaterCapacity;                            // 0x04E4(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxWaterCapacity;                                  // 0x04E8(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class UFWExchangeFormula* NewExchangeFormula)> OnInventoryExchangeStarted; // 0x04F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInventoryExchangeEnded;                          // 0x0500(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_510[0x18];                                     // 0x0510(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class AFWHubWorldPlayerState* PlayerState)> OnReplicatedWaterChanged; // 0x0528(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_538[0x18];                                     // 0x0538(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdjustInventory(const TArray<struct FFWInventoryAdjustment>& Adjustment, const class UDataTable* DataTable);
	bool CheckInventory(const TMap<class FName, int32>& DesiredQuantities, const class UDataTable* DataTable);
	void ClientAdjustInventoryQuantities(const TArray<struct FFWInventoryAdjustment>& Adjustment, const class UDataTable* DataTable);
	int32 GetInventoryQuantity(class FName InventoryTableRowName, const class UDataTable* DataTable);
	TArray<class FName> GetStashedWeapons();
	void LocalSetEquippedSkill(TSoftObjectPtr<class UPrimaryDataAsset> NewEquippedSkill);
	void OnOutOfWater(class UFWPersistenceSubsystem* Subsystem, const struct FDateTime& ExpectedOccurrence, const struct FTimespan& PastDue, int64 OccurrenceCount);
	void OnRep_CharacterClassKey();
	void OnRep_EquippedSkill();
	void OnRep_PlayerRig();
	void OnRep_PlayerWeapons();
	void OnRep_PlayerXP();
	void OnRep_ReadyToLaunch();
	void OnWaterAmountChanged(int32 NewAmount);
	void RequestUpdateRig(const TSoftObjectPtr<class UTexture2D>& DefaultTexture, const TArray<uint8>& CustomTexture, const struct FIntPoint& CustomTextureSize, const class FText& RigName, const class FText& RigNickname, const float CurrentWeight, const float MaxWeight, const TArray<struct FPlayerItems>& CustomItems);
	void RequestUpdateWeapon(const int32 WeaponIndex, const TSoftObjectPtr<class UTexture2D>& DefaultTexture, const TArray<uint8>& CustomTexture, const struct FIntPoint& CustomTextureSize, const class FText& WeaponName, const class FText& WeaponNickname, const int32 ClipSize, const int32 AmmoCount);
	void SendWater(const class AFWHubWorldPlayerState* Target, const int32 Amount, TDelegate<void(bool bSuccess)> OnWaterSendComplete);
	void ServerDonateWeapon(class APlayerController* PC, class FName What, class AFWDonationStationActor* DonationActor);
	void ServerSetEquippedSkill(const TSoftObjectPtr<class UPrimaryDataAsset>& NewEquippedSkill);
	void ServerSetWaterInfo(const int32 InCurrentWater, const int32 InAvailableWaterCapacity, const int32 InMaxWaterCapacity);
	void ServerTake(class APlayerController* PC, class FName What, class AFWDonationStationActor* DonationActor);
	void ServerTakeDonation(class APlayerController* PC, int32 Index_0, class AFWDonationStationActor* DonationActor);
	void ServerTakeReward(class APlayerController* PC, class AFWDonationStationActor* DonationActor);
	void SetPawnWithLoadout(class APawn* Pawn);

	void OnRep_CurrentWater() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHubWorldPlayerState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHubWorldPlayerState")
	}
	static class AFWHubWorldPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWHubWorldPlayerState>();
	}
};

// Class FWHubWorld.FWPickupAdvertisementWidget
// 0x0008 (0x02E8 - 0x02E0)
class UFWPickupAdvertisementWidget : public UUserWidget
{
public:
	class UTextBlock*                             AdvertisementText;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPickupAdvertisementWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPickupAdvertisementWidget")
	}
	static class UFWPickupAdvertisementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPickupAdvertisementWidget>();
	}
};

// Class FWHubWorld.FWReplicatedClientMessageHandler
// 0x0020 (0x0048 - 0x0028)
class UFWReplicatedClientMessageHandler final : public UFWReplicatedEventHandler
{
public:
	class FText                                   Message;                                           // 0x0028(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           UISendMessageChannel;                              // 0x0038(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           UISendToastMessageTag;                             // 0x0040(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWReplicatedClientMessageHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWReplicatedClientMessageHandler")
	}
	static class UFWReplicatedClientMessageHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWReplicatedClientMessageHandler>();
	}
};

// Class FWHubWorld.FWSpawnedInventoryActor
// 0x0088 (0x0358 - 0x02D0)
class AFWSpawnedInventoryActor final : public AFWCollectableInventoryActor
{
public:
	TSoftObjectPtr<class UStaticMesh>             DefaultItemMesh;                                   // 0x02D0(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x60];                                     // 0x02F8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWSpawnedInventoryActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWSpawnedInventoryActor")
	}
	static class AFWSpawnedInventoryActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWSpawnedInventoryActor>();
	}
};

// Class FWHubWorld.HubWorldManagerActor
// 0x0010 (0x02A0 - 0x0290)
class AHubWorldManagerActor : public AActor
{
public:
	TArray<class FName>                           HubActorsToShow;                                   // 0x0290(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	void HubActorsToShowChanged();
	void OnRep_HubActorsToShow();
	void SetHubActorsToShow(const TArray<class FName>& InHubActorsToShow);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HubWorldManagerActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HubWorldManagerActor")
	}
	static class AHubWorldManagerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHubWorldManagerActor>();
	}
};

// Class FWHubWorld.UpdatePlayerLoadout
// 0x0000 (0x0000 - 0x0000)
class IUpdatePlayerLoadout final
{
public:
	void SetReadyRoom();
