#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWHUD

#include "Basic.hpp"

#include "FWHUD_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class FWHUD.FWCrosshairInterface
// 0x0000 (0x0000 - 0x0000)
class IFWCrosshairInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWCrosshairInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWCrosshairInterface")
	}
	static class IFWCrosshairInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWCrosshairInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWHUD.FWHUD
// 0x0070 (0x03F0 - 0x0380)
class AFWHUD : public AHUD
{
public:
	bool                                          bDrawCrossHair;                                    // 0x0380(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ScopeTexture;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ScopeViewSize;                                     // 0x0390(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ScopeOverlayTexture;                               // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ScopeOverlaySize;                                  // 0x03A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrosshairOpacity;                                  // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrosshairSpreadMax;                                // 0x03A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWHUDInfo                             HUDInfo;                                           // 0x03B0(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void ChangeCrosshairMode(bool Scoped);
	void SetScopeOverlay(class UTexture2D* NewScopeOverlay, float NewScopeOverlaySize);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHUD")
	}
	static class AFWHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWHUD>();
	}
};

// Class FWHUD.FWHUDComponent
// 0x0030 (0x00D0 - 0x00A0)
class UFWHUDComponent final : public UActorComponent
{
public:
	class ACharacter*                             WeaponUserCharacter;                               // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWHUD*                                 FWHUD;                                             // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFWPlayerController>     Controller;                                        // 0x00B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWHUDComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWHUDComponent")
	}
	static class UFWHUDComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWHUDComponent>();
	}
};

// Class FWHUD.FWWatermarkWidget
// 0x0018 (0x02F8 - 0x02E0)
class UFWWatermarkWidget : public UUserWidget
{
public:
	class UTextBlock*                             VersionLabel;                                      // 0x02E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             SteamNameLabel;                                    // 0x02E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsVisibleInShipping;                              // 0x02F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWWatermarkWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWWatermarkWidget")
	}
	static class UFWWatermarkWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWWatermarkWidget>();
	}
};

}

