#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWInventory_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FWInventory.FWCrabBotInventory.AddStartingItems
// 0x0028 (0x0028 - 0x0000)
struct FWCrabBotInventory_AddStartingItems final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FContainerItem>                 Items;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>            DanglyRows;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWCrabBotInventory.GetRelevantContainerComponent
// 0x0008 (0x0008 - 0x0000)
struct FWCrabBotInventory_GetRelevantContainerComponent final
{
public:
	class UFWRigContainersComponent*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWCrabBotInventory.GetRelevantMultiDanglyComponent
// 0x0008 (0x0008 - 0x0000)
struct FWCrabBotInventory_GetRelevantMultiDanglyComponent final
{
public:
	class UFWMultiRigDanglySlot*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.AdjustDangly
// 0x0002 (0x0002 - 0x0000)
struct FWDanglyComponent_AdjustDangly final
{
public:
	uint8                                         Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LooseSlot;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.DamageDangly
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_DamageDangly final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.EnableDanglyLooting
// 0x0001 (0x0001 - 0x0000)
struct FWDanglyComponent_EnableDanglyLooting final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetCanBeLoose
// 0x0001 (0x0001 - 0x0000)
struct FWDanglyComponent_GetCanBeLoose final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDangleAttachPointName
// 0x0010 (0x0010 - 0x0000)
struct FWDanglyComponent_GetDangleAttachPointName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDangleLootTime
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_GetDangleLootTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDangleValue
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_GetDangleValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDangleValueOverrideRow
// 0x0008 (0x0008 - 0x0000)
struct FWDanglyComponent_GetDangleValueOverrideRow final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyAllowTags
// 0x0020 (0x0020 - 0x0000)
struct FWDanglyComponent_GetDanglyAllowTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyDurability
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_GetDanglyDurability final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyHUDIcon
// 0x0028 (0x0028 - 0x0000)
struct FWDanglyComponent_GetDanglyHUDIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyIcon
// 0x0028 (0x0028 - 0x0000)
struct FWDanglyComponent_GetDanglyIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyLootPosition
// 0x0018 (0x0018 - 0x0000)
struct FWDanglyComponent_GetDanglyLootPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyLootRange
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_GetDanglyLootRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyMaxDurability
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_GetDanglyMaxDurability final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyName
// 0x0010 (0x0010 - 0x0000)
struct FWDanglyComponent_GetDanglyName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyOwningBackpackRig
// 0x0008 (0x0008 - 0x0000)
struct FWDanglyComponent_GetDanglyOwningBackpackRig final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyRowHandle
// 0x0010 (0x0010 - 0x0000)
struct FWDanglyComponent_GetDanglyRowHandle final
{
public:
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetDanglyWeight
// 0x0004 (0x0004 - 0x0000)
struct FWDanglyComponent_GetDanglyWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetHasOwningBackpackRig
// 0x0001 (0x0001 - 0x0000)
struct FWDanglyComponent_GetHasOwningBackpackRig final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetMustBeLoose
// 0x0001 (0x0001 - 0x0000)
struct FWDanglyComponent_GetMustBeLoose final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.GetUniqueDangly
// 0x0001 (0x0001 - 0x0000)
struct FWDanglyComponent_GetUniqueDangly final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.SetDanglyAttachPointName
// 0x0010 (0x0010 - 0x0000)
struct FWDanglyComponent_SetDanglyAttachPointName final
{
public:
	class FString                                 NewAttachPointName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWDanglyComponent.SetDanglyOwningBackpackRig
// 0x0008 (0x0008 - 0x0000)
struct FWDanglyComponent_SetDanglyOwningBackpackRig final
{
public:
	class AActor*                                 BackpackRig;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.EnableItemLooting
// 0x0001 (0x0001 - 0x0000)
struct FWInventoryItem_EnableItemLooting final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.GetItemDetails
// 0x0240 (0x0240 - 0x0000)
struct FWInventoryItem_GetItemDetails final
{
public:
	struct FInventoryItemDetails                  ReturnValue;                                       // 0x0000(0x0240)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.GetItemName
// 0x0010 (0x0010 - 0x0000)
struct FWInventoryItem_GetItemName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.GetItemRowHandle
// 0x0010 (0x0010 - 0x0000)
struct FWInventoryItem_GetItemRowHandle final
{
public:
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.GetLootPosition
// 0x0018 (0x0018 - 0x0000)
struct FWInventoryItem_GetLootPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.GetLootRange
// 0x0004 (0x0004 - 0x0000)
struct FWInventoryItem_GetLootRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.GetStackCount
// 0x0004 (0x0004 - 0x0000)
struct FWInventoryItem_GetStackCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.InitialiseExtraMeshes
// 0x0008 (0x0008 - 0x0000)
struct FWInventoryItem_InitialiseExtraMeshes final
{
public:
	class UStaticMeshComponent*                   ItemMeshComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.InitialiseMesh
// 0x0001 (0x0001 - 0x0000)
struct FWInventoryItem_InitialiseMesh final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.ItemLooted
// 0x0008 (0x0008 - 0x0000)
struct FWInventoryItem_ItemLooted final
{
public:
	class ACharacter*                             Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.SetupItem
// 0x0018 (0x0018 - 0x0000)
struct FWInventoryItem_SetupItem final
{
public:
	struct FDataTableRowHandle                    NewItemDetailsRow;                                 // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          NewItemBroughtIn;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWInventoryItem.UpdateExtraMeshes
// 0x0008 (0x0008 - 0x0000)
struct FWInventoryItem_UpdateExtraMeshes final
{
public:
	class UStaticMeshComponent*                   ItemMeshComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWInventoryItem.UpdateStackCount
// 0x0004 (0x0004 - 0x0000)
struct FWInventoryItem_UpdateStackCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWMultiRigDanglySlot.GetDanglies
// 0x0010 (0x0010 - 0x0000)
struct FWMultiRigDanglySlot_GetDanglies final
{
public:
	TArray<struct FMultiRigDangly>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWMultiRigDanglySlot.GetTotalValue
// 0x0004 (0x0004 - 0x0000)
struct FWMultiRigDanglySlot_GetTotalValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWMultiRigDanglySlot.GetTotalWeight
// 0x0004 (0x0004 - 0x0000)
struct FWMultiRigDanglySlot_GetTotalWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWMultiRigDanglySlot.RemoveDangly
// 0x0004 (0x0004 - 0x0000)
struct FWMultiRigDanglySlot_RemoveDangly final
{
public:
	int32                                         DanglyIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.AddItem
// 0x0020 (0x0020 - 0x0000)
struct FWRigContainersComponent_AddItem final
{
public:
	struct FContainerItem                         Item;                                              // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.AddItemAsItem
// 0x0008 (0x0008 - 0x0000)
struct FWRigContainersComponent_AddItemAsItem final
{
public:
	class AFWInventoryItem*                       NewItem;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.AddItemAsLoot
// 0x0020 (0x0020 - 0x0000)
struct FWRigContainersComponent_AddItemAsLoot final
{
public:
	struct FContainerItem                         NewItem;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.CanFitItem
// 0x0250 (0x0250 - 0x0000)
struct FWRigContainersComponent_CanFitItem final
{
public:
	struct FInventoryItemDetails                  ItemDetails;                                       // 0x0000(0x0240)(Parm, NativeAccessSpecifierPublic)
	int32                                         StackCount;                                        // 0x0240(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECanFit                                       ItemFits;                                          // 0x0244(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_245[0xB];                                      // 0x0245(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWRigContainersComponent.GetContainerDetails
// 0x0120 (0x0120 - 0x0000)
struct FWRigContainersComponent_GetContainerDetails final
{
public:
	struct FInventoryContainer                    ReturnValue;                                       // 0x0000(0x0120)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetContainerFilledPercentage
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetContainerFilledPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetContainerLootTime
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetContainerLootTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetContainerSize
// 0x0018 (0x0018 - 0x0000)
struct FWRigContainersComponent_GetContainerSize final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetContainerSlotsSize
// 0x0008 (0x0008 - 0x0000)
struct FWRigContainersComponent_GetContainerSlotsSize final
{
public:
	struct FIntPoint                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetContainerType
// 0x0001 (0x0001 - 0x0000)
struct FWRigContainersComponent_GetContainerType final
{
public:
	EItemCategory                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetExtraWeightCapacity
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetExtraWeightCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetInventoryValue
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetInventoryValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetInventoryWeight
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetInventoryWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetItem
// 0x0028 (0x0028 - 0x0000)
struct FWRigContainersComponent_GetItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerItem                         ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetVolumeCapacity
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetVolumeCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetWeight
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.GetWeightCapacity
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_GetWeightCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.HasAmmoType
// 0x000C (0x000C - 0x0000)
struct FWRigContainersComponent_HasAmmoType final
{
public:
	struct FGameplayTag                           AmmoType;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWRigContainersComponent.ItemSwapContainer
// 0x0018 (0x0018 - 0x0000)
struct FWRigContainersComponent_ItemSwapContainer final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWRigContainersComponent*              NewContainer;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Hidden;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWRigContainersComponent.RemoveItem
// 0x0008 (0x0008 - 0x0000)
struct FWRigContainersComponent_RemoveItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableLooting;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWRigContainersComponent.RequestItemSwapContainer
// 0x0018 (0x0018 - 0x0000)
struct FWRigContainersComponent_RequestItemSwapContainer final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWRigContainersComponent*              NewContainer;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Hidden;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWRigContainersComponent.RequestLootItem
// 0x0008 (0x0008 - 0x0000)
struct FWRigContainersComponent_RequestLootItem final
{
public:
	class AFWInventoryItem*                       NewItem;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.RequestRemoveItem
// 0x0008 (0x0008 - 0x0000)
struct FWRigContainersComponent_RequestRemoveItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableLooting;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWInventory.FWRigContainersComponent.SetAttachPointName
// 0x0010 (0x0010 - 0x0000)
struct FWRigContainersComponent_SetAttachPointName final
{
public:
	class FString                                 AttachPoint;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.SetSocketNum
// 0x0004 (0x0004 - 0x0000)
struct FWRigContainersComponent_SetSocketNum final
{
public:
	int32                                         Socket;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWInventory.FWRigContainersComponent.UseAmmoByType
// 0x0010 (0x0010 - 0x0000)
struct FWRigContainersComponent_UseAmmoByType final
{
public:
	struct FGameplayTag                           AmmoType;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmmoNeeded;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

