#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWOnlineServices

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum FWOnlineServices.EFWVoiceActivityType
// NumValues: 0x0005
enum class EFWVoiceActivityType : uint8
{
	PushToTalk                               = 0,
	Always                                   = 1,
	Muted                                    = 2,
	Count                                    = 3,
	EFWVoiceActivityType_MAX                 = 4,
};

// Enum FWOnlineServices.EFWSessionJoinPermission
// NumValues: 0x0005
enum class EFWSessionJoinPermission : uint8
{
	Public                                   = 0,
	FriendsOnly                              = 1,
	Private                                  = 2,
	Count                                    = 3,
	EFWSessionJoinPermission_MAX             = 4,
};

// Enum FWOnlineServices.EFWSessionOnlineMode
// NumValues: 0x0004
enum class EFWSessionOnlineMode : uint8
{
	Offline                                  = 0,
	LAN                                      = 1,
	Online                                   = 2,
	EFWSessionOnlineMode_MAX                 = 3,
};

// Enum FWOnlineServices.EFWSessionDisconnectReason
// NumValues: 0x0009
enum class EFWSessionDisconnectReason : uint8
{
	None                                     = 0,
	UserInitiated                            = 1,
	Kicked                                   = 2,
	HostLeft                                 = 3,
	NetworkError                             = 4,
	TravelError                              = 5,
	IncompatibleClient                       = 6,
	Count                                    = 7,
	EFWSessionDisconnectReason_MAX           = 8,
};

// Enum FWOnlineServices.EFWLobbyInfoStatus
// NumValues: 0x0008
enum class EFWLobbyInfoStatus : uint8
{
	NotStarted                               = 0,
	SessionSearch                            = 1,
	SessionFound                             = 2,
	PingInProgress                           = 3,
	Ready                                    = 4,
	Failed                                   = 5,
	Count                                    = 6,
	EFWLobbyInfoStatus_MAX                   = 7,
};

// ScriptStruct FWOnlineServices.PartyTransactionResponse
// 0x0014 (0x0014 - 0x0000)
struct FPartyTransactionResponse final
{
public:
	struct FGuid                                  TransactionId;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccepted;                                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWOnlineServices.PartyTransactionItem
// 0x0018 (0x0018 - 0x0000)
struct FPartyTransactionItem final
{
public:
	class FName                                   ItemClass;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ItemId;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Amount;                                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.PartyTransactionRequest
// 0x0088 (0x0088 - 0x0000)
struct FPartyTransactionRequest final
{
public:
	struct FGuid                                  TransactionId;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       Sender;                                            // 0x0010(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       Receiver;                                          // 0x0040(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TransactionType;                                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPartyTransactionItem>          Items;                                             // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.FWSessionMapDataChangeEnvelope
// 0x0010 (0x0010 - 0x0000)
struct FFWSessionMapDataChangeEnvelope final
{
public:
	class FName                                   MapName;                                           // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpawnPointTag;                                     // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.ChatSenderInfo
// 0x0050 (0x0050 - 0x0000)
struct FChatSenderInfo final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DisplayColor;                                      // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.ChatMessage
// 0x0068 (0x0068 - 0x0000)
struct FChatMessage final
{
public:
	struct FChatSenderInfo                        ChatSenderInfo;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDateTime                              timestamp;                                         // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.FWSessionJoinPermissionChangeEnvelope
// 0x0001 (0x0001 - 0x0000)
struct FFWSessionJoinPermissionChangeEnvelope final
{
public:
	EFWSessionJoinPermission                      Permission;                                        // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.FWSessionSearchResultEnvelope
// 0x0008 (0x0008 - 0x0000)
struct FFWSessionSearchResultEnvelope final
{
public:
	class UFWSession_SearchResult*                SearchResult;                                      // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.FWLobbyResultEnvelope
// 0x0008 (0x0008 - 0x0000)
struct FFWLobbyResultEnvelope final
{
public:
	class UFWLobbySearchResult*                   SearchResult;                                      // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FWOnlineServices.PartyReservationRequest
// 0x0048 (0x0048 - 0x0000)
struct FPartyReservationRequest final
{
public:
	class FString                                 PartyId;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUniqueNetIdRepl>               Players;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvite;                                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWOnlineServices.PartyReservationResponse
// 0x0018 (0x0018 - 0x0000)
struct FPartyReservationResponse final
{
public:
	class FString                                 PartyId;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccepted;                                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FWOnlineServices.FWLobbyInfoResult
// 0x0058 (0x0058 - 0x0000)
struct FFWLobbyInfoResult final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWLobbySearchResult*                   LobbySearchResult;                                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x48];                                      // 0x0010(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

