#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWOnlineServices

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FWOnlineServices_structs.hpp"
#include "CommonUser_structs.hpp"


namespace SDK::Params
{

// Function FWOnlineServices.FWAsync_CreateParty.CreateOnlineParty
// 0x0010 (0x0010 - 0x0000)
struct FWAsync_CreateParty_CreateOnlineParty final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_CreateParty*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_FindQuickPlayMatch.FindQuickPlayMatch
// 0x0010 (0x0010 - 0x0000)
struct FWAsync_FindQuickPlayMatch_FindQuickPlayMatch final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_FindQuickPlayMatch*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_GetPartyList.GetOnlinePartyList
// 0x0010 (0x0010 - 0x0000)
struct FWAsync_GetPartyList_GetOnlinePartyList final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_GetPartyList*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_GetSessionPing.GetSessionPing
// 0x0018 (0x0018 - 0x0000)
struct FWAsync_GetSessionPing_GetSessionPing final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWLobbySearchResult*                   SearchResult_0;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_GetSessionPing*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_JoinParty.JoinOnlineParty
// 0x0010 (0x0010 - 0x0000)
struct FWAsync_JoinParty_JoinOnlineParty final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_JoinParty*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_KickPlayer.KickOnlinePartyMember
// 0x0040 (0x0040 - 0x0000)
struct FWAsync_KickPlayer_KickOnlinePartyMember final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          WorldContextObject_0;                              // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_KickPlayer*                    ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_LeaveParty.LeaveOnlineParty
// 0x0010 (0x0010 - 0x0000)
struct FWAsync_LeaveParty_LeaveOnlineParty final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_LeaveParty*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWAsync_LinkThirdPartyAccount.LinkThirdPartyAccount
// 0x0010 (0x0010 - 0x0000)
struct FWAsync_LinkThirdPartyAccount_LinkThirdPartyAccount final
{
public:
	const class UObject*                          WorldContextObject_0;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWAsync_LinkThirdPartyAccount*         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerChatSubsystem.GetChatSender
// 0x0080 (0x0080 - 0x0000)
struct FWLocalPlayerChatSubsystem_GetChatSender final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatSenderInfo                        ReturnValue;                                       // 0x0030(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerChatSubsystem.SendChatMessage
// 0x0028 (0x0028 - 0x0000)
struct FWLocalPlayerChatSubsystem_SendChatMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InDisplayColor;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWLocalPlayerChatSubsystem.GetChatHistory
// 0x0010 (0x0010 - 0x0000)
struct FWLocalPlayerChatSubsystem_GetChatHistory final
{
public:
	TArray<struct FChatMessage>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerChatSubsystem.IsChatEnabled
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerChatSubsystem_IsChatEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.OnUserInitializeComplete
// 0x0028 (0x0028 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_OnUserInitializeComplete final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetAudioInputDevice
// 0x0010 (0x0010 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetAudioInputDevice final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetAudioOutputDevice
// 0x0010 (0x0010 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetAudioOutputDevice final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetPlayerMuted
// 0x0038 (0x0038 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetPlayerMuted final
{
public:
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMuted;                                          // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetTransmitting
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetTransmitting final
{
public:
	bool                                          bIsTransmitting;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.GetAvailableAudioInputDevices
// 0x0050 (0x0050 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_GetAvailableAudioInputDevices final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.GetAvailableAudioOutputDevices
// 0x0050 (0x0050 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_GetAvailableAudioOutputDevices final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.GetCurrentAudioInputDevice
// 0x0020 (0x0020 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_GetCurrentAudioInputDevice final
{
public:
	class FString                                 OutDeviceId;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceDisplayName;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.GetCurrentAudioOutputDevice
// 0x0020 (0x0020 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_GetCurrentAudioOutputDevice final
{
public:
	class FString                                 OutDeviceId;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceDisplayName;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.GetDefaultAudioInputDevice
// 0x0020 (0x0020 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_GetDefaultAudioInputDevice final
{
public:
	class FString                                 OutDeviceId;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceDisplayName;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.GetDefaultAudioOutputDevice
// 0x0020 (0x0020 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_GetDefaultAudioOutputDevice final
{
public:
	class FString                                 OutDeviceId;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceDisplayName;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsAutoGainControlEnabled
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsAutoGainControlEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsDtxEnabled
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsDtxEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsEchoCancellationEnabled
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsEchoCancellationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsNoiseSuppressionEnabled
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsNoiseSuppressionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsPlatformAECEnabled
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsPlatformAECEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsPlayerInVoice
// 0x0038 (0x0038 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsPlayerInVoice final
{
public:
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsPlayerMuted
// 0x0038 (0x0038 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsPlayerMuted final
{
public:
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.IsPlayerSpeaking
// 0x0038 (0x0038 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_IsPlayerSpeaking final
{
public:
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetAutoGainControlState
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetAutoGainControlState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetDtxState
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetDtxState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetEchoCancellationState
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetEchoCancellationState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetNoiseSuppressionState
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetNoiseSuppressionState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetPlatformAECState
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetPlatformAECState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetVoiceInputMuted
// 0x0001 (0x0001 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetVoiceInputMuted final
{
public:
	bool                                          bIsMuted;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetVoiceInputVolume
// 0x0004 (0x0004 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetVoiceInputVolume final
{
public:
	float                                         VolumePercent;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLocalPlayerVoiceSubsystem.SetVoiceOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct FWLocalPlayerVoiceSubsystem_SetVoiceOutputVolume final
{
public:
	float                                         VolumePercent;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWOnlineServicesBPFL.SortPlayerStatesByPartyStatus
// 0x0018 (0x0018 - 0x0000)
struct FWOnlineServicesBPFL_SortPlayerStatesByPartyStatus final
{
public:
	class UFWPartySubsystem*                      PartySubsystem;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   PlayerStates;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWOnlineServicesBPFL.SortWidgetsByPredicate
// 0x0028 (0x0028 - 0x0000)
struct FWOnlineServicesBPFL_SortWidgetsByPredicate final
{
public:
	TArray<class UWidget*>                        Widgets;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(const class UWidget* Left, const class UWidget* Right)> SortingPredicate;         // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWOnlineServicesBPFL.UnformatRedpointError
// 0x0050 (0x0050 - 0x0000)
struct FWOnlineServicesBPFL_UnformatRedpointError final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ErrorNamespace;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ErrorCode;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ErrorMessage;                                      // 0x0020(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 OriginalCall;                                      // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Context;                                           // 0x0040(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetBattlePointRating
// 0x0004 (0x0004 - 0x0000)
struct FWLobbySearchResult_GetBattlePointRating final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetCreated
// 0x0008 (0x0008 - 0x0000)
struct FWLobbySearchResult_GetCreated final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetCreatedDuration
// 0x0008 (0x0008 - 0x0000)
struct FWLobbySearchResult_GetCreatedDuration final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetMainLevelName
// 0x0008 (0x0008 - 0x0000)
struct FWLobbySearchResult_GetMainLevelName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetMaxPlayers
// 0x0004 (0x0004 - 0x0000)
struct FWLobbySearchResult_GetMaxPlayers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetNumPlayers
// 0x0004 (0x0004 - 0x0000)
struct FWLobbySearchResult_GetNumPlayers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetOwningPlayerName
// 0x0010 (0x0010 - 0x0000)
struct FWLobbySearchResult_GetOwningPlayerName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetOwningPlayerNetId
// 0x0030 (0x0030 - 0x0000)
struct FWLobbySearchResult_GetOwningPlayerNetId final
{
public:
	struct FUniqueNetIdRepl                       ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetPing
// 0x0004 (0x0004 - 0x0000)
struct FWLobbySearchResult_GetPing final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetSpawnPointTag
// 0x0008 (0x0008 - 0x0000)
struct FWLobbySearchResult_GetSpawnPointTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetStarted
// 0x0008 (0x0008 - 0x0000)
struct FWLobbySearchResult_GetStarted final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWLobbySearchResult.GetStartedDuration
// 0x0008 (0x0008 - 0x0000)
struct FWLobbySearchResult_GetStartedDuration final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetBattlePointRating
// 0x0004 (0x0004 - 0x0000)
struct FWSession_SearchResult_GetBattlePointRating final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetCreated
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetCreated final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetCreatedDuration
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetCreatedDuration final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetCurrentMapName
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetCurrentMapName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct FWSession_SearchResult_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetIntSetting
// 0x0010 (0x0010 - 0x0000)
struct FWSession_SearchResult_GetIntSetting final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFoundValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWSession_SearchResult.GetJoinPermission
// 0x0001 (0x0001 - 0x0000)
struct FWSession_SearchResult_GetJoinPermission final
{
public:
	EFWSessionJoinPermission                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetMainLevelName
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetMainLevelName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetMaxPublicConnections
// 0x0004 (0x0004 - 0x0000)
struct FWSession_SearchResult_GetMaxPublicConnections final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetNumOpenPrivateConnections
// 0x0004 (0x0004 - 0x0000)
struct FWSession_SearchResult_GetNumOpenPrivateConnections final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetNumOpenPublicConnections
// 0x0004 (0x0004 - 0x0000)
struct FWSession_SearchResult_GetNumOpenPublicConnections final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetOwningPlayerName
// 0x0010 (0x0010 - 0x0000)
struct FWSession_SearchResult_GetOwningPlayerName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetOwningPlayerNetId
// 0x0010 (0x0010 - 0x0000)
struct FWSession_SearchResult_GetOwningPlayerNetId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetPingInMs
// 0x0004 (0x0004 - 0x0000)
struct FWSession_SearchResult_GetPingInMs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetSessionId
// 0x0010 (0x0010 - 0x0000)
struct FWSession_SearchResult_GetSessionId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetSpawnPointTag
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetSpawnPointTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetStarted
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetStarted final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetStartedDuration
// 0x0008 (0x0008 - 0x0000)
struct FWSession_SearchResult_GetStartedDuration final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWSession_SearchResult.GetStringSetting
// 0x0020 (0x0020 - 0x0000)
struct FWSession_SearchResult_GetStringSetting final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFoundValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWSession_SearchResult.IsValid
// 0x0001 (0x0001 - 0x0000)
struct FWSession_SearchResult_IsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartyCheats.RequestReservation
// 0x0020 (0x0020 - 0x0000)
struct FWPartyCheats_RequestReservation final
{
public:
	class FString                                 Leader;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyId;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartyCheats.SetPartyJoinPermission
// 0x0001 (0x0001 - 0x0000)
struct FWPartyCheats_SetPartyJoinPermission final
{
public:
	EFWSessionJoinPermission                      Permission;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartyCheats.SetPartyMap
// 0x0010 (0x0010 - 0x0000)
struct FWPartyCheats_SetPartyMap final
{
public:
	class FName                                   MapName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpawnPointName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetCurrentLobbyInfo
// 0x0008 (0x0008 - 0x0000)
struct FWPartySubsystem_GetCurrentLobbyInfo final
{
public:
	class UFWLobbySearchResult*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.HandleCommonUserOnUserInitializeComplete
// 0x0028 (0x0028 - 0x0000)
struct FWPartySubsystem_HandleCommonUserOnUserInitializeComplete final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWPartySubsystem.HandlePostLoginAccountLink
// 0x0028 (0x0028 - 0x0000)
struct FWPartySubsystem_HandlePostLoginAccountLink final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWPartySubsystem.SelectMapAndSpawn
// 0x0010 (0x0010 - 0x0000)
struct FWPartySubsystem_SelectMapAndSpawn final
{
public:
	class FName                                   NewMapName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewSpawnPoint;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.SetLastDisconnectReason
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_SetLastDisconnectReason final
{
public:
	EFWSessionDisconnectReason                    NewReason;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.SetPartyToJoin
// 0x0008 (0x0008 - 0x0000)
struct FWPartySubsystem_SetPartyToJoin final
{
public:
	class UFWLobbySearchResult*                   SearchResult;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.CanLinkThirdPartyAccount
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_CanLinkThirdPartyAccount final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.CanPlayOnline
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_CanPlayOnline final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetLastDisconnectReason
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_GetLastDisconnectReason final
{
public:
	EFWSessionDisconnectReason                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetPartyJoinPermission
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_GetPartyJoinPermission final
{
public:
	EFWSessionJoinPermission                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetPartyLeader
// 0x0030 (0x0030 - 0x0000)
struct FWPartySubsystem_GetPartyLeader final
{
public:
	struct FUniqueNetIdRepl                       ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetPartyMapName
// 0x0008 (0x0008 - 0x0000)
struct FWPartySubsystem_GetPartyMapName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetPartyMembers
// 0x0010 (0x0010 - 0x0000)
struct FWPartySubsystem_GetPartyMembers final
{
public:
	TArray<struct FUniqueNetIdRepl>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetPartySpawnPoint
// 0x0008 (0x0008 - 0x0000)
struct FWPartySubsystem_GetPartySpawnPoint final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.GetPartyToJoin
// 0x0008 (0x0008 - 0x0000)
struct FWPartySubsystem_GetPartyToJoin final
{
public:
	class UFWLobbySearchResult*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.HasThirdPartyAccount
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_HasThirdPartyAccount final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.IsInParty
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_IsInParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.IsPartyLeader
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_IsPartyLeader final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.IsSearchCooldownComplete
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_IsSearchCooldownComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPartySubsystem.SetPartyJoinPermission
// 0x0001 (0x0001 - 0x0000)
struct FWPartySubsystem_SetPartyJoinPermission final
{
public:
	EFWSessionJoinPermission                      NewPermission;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPlayerChatComponent.MulticastReceiveChatMessage
// 0x0058 (0x0058 - 0x0000)
struct FWPlayerChatComponent_MulticastReceiveChatMessage final
{
public:
	struct FUniqueNetIdRepl                       Sender;                                            // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              timestamp;                                         // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InDisplayColor;                                    // 0x0048(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPlayerChatComponent.GetChatHistory
// 0x0010 (0x0010 - 0x0000)
struct FWPlayerChatComponent_GetChatHistory final
{
public:
	TArray<struct FChatMessage>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPlayerChatComponent.GetSenderInfo
// 0x0080 (0x0080 - 0x0000)
struct FWPlayerChatComponent_GetSenderInfo final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatSenderInfo                        ReturnValue;                                       // 0x0030(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWOnlineServices.FWPlayerChatComponent.SendChatMessage
// 0x0028 (0x0028 - 0x0000)
struct FWPlayerChatComponent_SendChatMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InDisplayColor;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWOnlineServices.FWPlayerChatComponent.ServerSendChatMessage
// 0x0050 (0x0050 - 0x0000)
struct FWPlayerChatComponent_ServerSendChatMessage final
{
public:
	struct FUniqueNetIdRepl                       Sender;                                            // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InDisplayColor;                                    // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

