#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWOnlineServices

#include "Basic.hpp"

#include "CommonUser_structs.hpp"
#include "Engine_classes.hpp"
#include "FWOnlineServices_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class FWOnlineServices.FWAsync_CreateParty
// 0x0018 (0x0048 - 0x0030)
class UFWAsync_CreateParty final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result)> Completed;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_CreateParty* CreateOnlineParty(const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_CreateParty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_CreateParty")
	}
	static class UFWAsync_CreateParty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_CreateParty>();
	}
};

// Class FWOnlineServices.FWAsync_FindQuickPlayMatch
// 0x0030 (0x0060 - 0x0030)
class UFWAsync_FindQuickPlayMatch final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bSuccess, const class FText& Error)> Completed;               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldContextObject;                                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_FindQuickPlayMatch* FindQuickPlayMatch(const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_FindQuickPlayMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_FindQuickPlayMatch")
	}
	static class UFWAsync_FindQuickPlayMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_FindQuickPlayMatch>();
	}
};

// Class FWOnlineServices.FWAsync_GetPartyList
// 0x0018 (0x0048 - 0x0030)
class UFWAsync_GetPartyList final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result, const TArray<class UFWLobbySearchResult*>& Results)> Completed; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_GetPartyList* GetOnlinePartyList(const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_GetPartyList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_GetPartyList")
	}
	static class UFWAsync_GetPartyList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_GetPartyList>();
	}
};

// Class FWOnlineServices.FWAsync_GetSessionPing
// 0x0020 (0x0050 - 0x0030)
class UFWAsync_GetSessionPing final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const int32 Ping)> Completed;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWLobbySearchResult*                   SearchResult;                                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_GetSessionPing* GetSessionPing(const class UObject* WorldContextObject_0, class UFWLobbySearchResult* SearchResult_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_GetSessionPing")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_GetSessionPing")
	}
	static class UFWAsync_GetSessionPing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_GetSessionPing>();
	}
};

// Class FWOnlineServices.FWAsync_JoinParty
// 0x0018 (0x0048 - 0x0030)
class UFWAsync_JoinParty final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result)> Completed;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_JoinParty* JoinOnlineParty(const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_JoinParty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_JoinParty")
	}
	static class UFWAsync_JoinParty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_JoinParty>();
	}
};

// Class FWOnlineServices.FWAsync_KickPlayer
// 0x0048 (0x0078 - 0x0030)
class UFWAsync_KickPlayer final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result)> Completed;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAsync_KickPlayer* KickOnlinePartyMember(const struct FUniqueNetIdRepl& PlayerId, const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_KickPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_KickPlayer")
	}
	static class UFWAsync_KickPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_KickPlayer>();
	}
};

// Class FWOnlineServices.FWAsync_LeaveParty
// 0x0018 (0x0048 - 0x0030)
class UFWAsync_LeaveParty final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result)> Completed;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_LeaveParty* LeaveOnlineParty(const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_LeaveParty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_LeaveParty")
	}
	static class UFWAsync_LeaveParty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_LeaveParty>();
	}
};

// Class FWOnlineServices.FWAsync_LinkThirdPartyAccount
// 0x0018 (0x0048 - 0x0030)
class UFWAsync_LinkThirdPartyAccount final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result)> Completed;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFWAsync_LinkThirdPartyAccount* LinkThirdPartyAccount(const class UObject* WorldContextObject_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_LinkThirdPartyAccount")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_LinkThirdPartyAccount")
	}
	static class UFWAsync_LinkThirdPartyAccount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_LinkThirdPartyAccount>();
	}
};

// Class FWOnlineServices.FWLocalPlayerChatSubsystem
// 0x00E0 (0x0110 - 0x0030)
class UFWLocalPlayerChatSubsystem final : public ULocalPlayerSubsystem
{
public:
	TMulticastInlineDelegate<void(const bool ChatEnabledState)> OnChatPossibleChanged;               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FChatSenderInfo& Sender, const struct FChatMessage& Text)> OnChatMessageReceived; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0xC0];                                      // 0x0050(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const struct FChatSenderInfo GetChatSender(const struct FUniqueNetIdRepl& NetId);
	bool SendChatMessage(const class FString& Message, const struct FLinearColor& InDisplayColor);

	TArray<struct FChatMessage> GetChatHistory() const;
	bool IsChatEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWLocalPlayerChatSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWLocalPlayerChatSubsystem")
	}
	static class UFWLocalPlayerChatSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWLocalPlayerChatSubsystem>();
	}
};

// Class FWOnlineServices.FWLocalPlayerVoiceSubsystem
// 0x0050 (0x0080 - 0x0030)
class UFWLocalPlayerVoiceSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UFWLocalPlayerVoiceSubsystem* Subsystem)> OnVoiceUserReady;  // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoadingScreenEnded();
	void OnLoadingScreenStarted();
	void OnUserInitializeComplete(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void SetAudioInputDevice(const class FString& DeviceID);
	void SetAudioOutputDevice(const class FString& DeviceID);
	bool SetPlayerMuted(const struct FUniqueNetIdRepl& PlayerNetId, bool bIsMuted);
	void SetTransmitting(bool bIsTransmitting);

	TMap<class FString, class FString> GetAvailableAudioInputDevices() const;
	TMap<class FString, class FString> GetAvailableAudioOutputDevices() const;
	void GetCurrentAudioInputDevice(class FString* OutDeviceId, class FString* OutDeviceDisplayName) const;
	void GetCurrentAudioOutputDevice(class FString* OutDeviceId, class FString* OutDeviceDisplayName) const;
	void GetDefaultAudioInputDevice(class FString* OutDeviceId, class FString* OutDeviceDisplayName) const;
	void GetDefaultAudioOutputDevice(class FString* OutDeviceId, class FString* OutDeviceDisplayName) const;
	bool IsAutoGainControlEnabled() const;
	bool IsDtxEnabled() const;
	bool IsEchoCancellationEnabled() const;
	bool IsLoggedIn() const;
	bool IsNoiseSuppressionEnabled() const;
	bool IsPlatformAECEnabled() const;
	bool IsPlayerInVoice(const struct FUniqueNetIdRepl& PlayerNetId) const;
	bool IsPlayerMuted(const struct FUniqueNetIdRepl& PlayerNetId) const;
	bool IsPlayerSpeaking(const struct FUniqueNetIdRepl& PlayerNetId) const;
	void SetAutoGainControlState(bool bEnabled) const;
	void SetDtxState(bool bEnabled) const;
	void SetEchoCancellationState(bool bEnabled) const;
	void SetNoiseSuppressionState(bool bEnabled) const;
	void SetPlatformAECState(bool bEnabled) const;
	void SetVoiceInputMuted(bool bIsMuted) const;
	void SetVoiceInputVolume(float VolumePercent) const;
	void SetVoiceOutputVolume(float VolumePercent) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWLocalPlayerVoiceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWLocalPlayerVoiceSubsystem")
	}
	static class UFWLocalPlayerVoiceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWLocalPlayerVoiceSubsystem>();
	}
};

// Class FWOnlineServices.FWOnlineServicesBPFL
// 0x0000 (0x0028 - 0x0028)
class UFWOnlineServicesBPFL final : public UBlueprintFunctionLibrary
{
public:
	static void SortPlayerStatesByPartyStatus(class UFWPartySubsystem* PartySubsystem, TArray<class APlayerState*>& PlayerStates);
	static void SortWidgetsByPredicate(TArray<class UWidget*>& Widgets, TDelegate<void(const class UWidget* Left, const class UWidget* Right)> SortingPredicate, bool bReverse);
	static void UnformatRedpointError(const class FText& ErrorText, class FName* ErrorNamespace, class FName* ErrorCode, class FText* ErrorMessage, class FString* OriginalCall, class FText* Context);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWOnlineServicesBPFL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWOnlineServicesBPFL")
	}
	static class UFWOnlineServicesBPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWOnlineServicesBPFL>();
	}
};

// Class FWOnlineServices.FWSession_HostSessionRequest
// 0x0080 (0x00A8 - 0x0028)
class UFWSession_HostSessionRequest final : public UObject
{
public:
	EFWSessionOnlineMode                          OnlineMode;                                        // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLobbies;                                       // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWSessionJoinPermission                      JoinPermission;                                    // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MapName;                                           // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpawnPointTag;                                     // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            ExtraArgs;                                         // 0x0040(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         MaxPlayerCount;                                    // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0098(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWSession_HostSessionRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWSession_HostSessionRequest")
	}
	static class UFWSession_HostSessionRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWSession_HostSessionRequest>();
	}
};

// Class FWOnlineServices.FWLobbySearchResult
// 0x00A8 (0x00D0 - 0x0028)
class UFWLobbySearchResult final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnResultChanged;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x98];                                      // 0x0038(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetBattlePointRating() const;
	struct FDateTime GetCreated() const;
	struct FTimespan GetCreatedDuration() const;
	class FName GetMainLevelName() const;
	int32 GetMaxPlayers() const;
	int32 GetNumPlayers() const;
	class FString GetOwningPlayerName() const;
	struct FUniqueNetIdRepl GetOwningPlayerNetId() const;
	int32 GetPing() const;
	class FName GetSpawnPointTag() const;
	struct FDateTime GetStarted() const;
	struct FTimespan GetStartedDuration() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWLobbySearchResult")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWLobbySearchResult")
	}
	static class UFWLobbySearchResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWLobbySearchResult>();
	}
};

// Class FWOnlineServices.FWSession_SearchResult
// 0x0140 (0x0168 - 0x0028)
class UFWSession_SearchResult final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnResultChanged;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x130];                                     // 0x0038(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetBattlePointRating() const;
	struct FDateTime GetCreated() const;
	struct FTimespan GetCreatedDuration() const;
	class FName GetCurrentMapName() const;
	class FString GetDescription() const;
	void GetIntSetting(class FName Key, int32* Value, bool* bFoundValue) const;
	EFWSessionJoinPermission GetJoinPermission() const;
	class FName GetMainLevelName() const;
	int32 GetMaxPublicConnections() const;
	int32 GetNumOpenPrivateConnections() const;
	int32 GetNumOpenPublicConnections() const;
	class FString GetOwningPlayerName() const;
	class FString GetOwningPlayerNetId() const;
	int32 GetPingInMs() const;
	class FString GetSessionId() const;
	class FName GetSpawnPointTag() const;
	struct FDateTime GetStarted() const;
	struct FTimespan GetStartedDuration() const;
	void GetStringSetting(class FName Key, class FString* Value, bool* bFoundValue) const;
	bool IsValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWSession_SearchResult")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWSession_SearchResult")
	}
	static class UFWSession_SearchResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWSession_SearchResult>();
	}
};

// Class FWOnlineServices.FWSession_SearchRequest
// 0x0058 (0x0080 - 0x0028)
class UFWSession_SearchRequest final : public UObject
{
public:
	EFWSessionOnlineMode                          OnlineMode;                                        // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLobbies;                                       // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFWSession_SearchResult*>        Results;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FOnlineResultInformation& Result)> K2_OnSearchFinished; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWSession_SearchRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWSession_SearchRequest")
	}
	static class UFWSession_SearchRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWSession_SearchRequest>();
	}
};

// Class FWOnlineServices.FWPartyCheats
// 0x0008 (0x0030 - 0x0028)
class UFWPartyCheats final : public UCheatManagerExtension
{
public:
	class UFWPartySubsystem*                      PartySubsystem;                                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CreateParty() const;
	void DumpSteamSessionState() const;
	void GetLobbyList() const;
	void GetPartyID() const;
	void LeaveParty() const;
	void RequestReservation(const class FString& Leader, const class FString& PartyId) const;
	void SetPartyJoinPermission(EFWSessionJoinPermission Permission) const;
	void SetPartyMap(class FName MapName, class FName SpawnPointName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPartyCheats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPartyCheats")
	}
	static class UFWPartyCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPartyCheats>();
	}
};

// Class FWOnlineServices.FWPartySubsystem
// 0x02D8 (0x0308 - 0x0030)
class UFWPartySubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnSearchCooldownComplete;                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFWPartyMemberLeft;                               // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFWPartyMemberJoined;                             // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x90];                                      // 0x0088(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserInfo*                        AuthenticatedUserInfo;                             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x1E8];                                    // 0x0120(0x01E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFWLobbySearchResult* GetCurrentLobbyInfo();
	void HandleCommonUserOnUserInitializeComplete(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void HandlePostLoginAccountLink(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void OpenExternalFriendsUI();
	void SelectMapAndSpawn(class FName NewMapName, class FName NewSpawnPoint);
	void SetLastDisconnectReason(const EFWSessionDisconnectReason NewReason);
	void SetPartyToJoin(class UFWLobbySearchResult* SearchResult);
	void TryLinkAfterLogin();

	bool CanLinkThirdPartyAccount() const;
	bool CanPlayOnline() const;
	EFWSessionDisconnectReason GetLastDisconnectReason() const;
	EFWSessionJoinPermission GetPartyJoinPermission() const;
	struct FUniqueNetIdRepl GetPartyLeader() const;
	class FName GetPartyMapName() const;
	TArray<struct FUniqueNetIdRepl> GetPartyMembers() const;
	class FName GetPartySpawnPoint() const;
	class UFWLobbySearchResult* GetPartyToJoin() const;
	bool HasThirdPartyAccount() const;
	bool IsInParty() const;
	bool IsPartyLeader() const;
	bool IsSearchCooldownComplete() const;
	void SetPartyJoinPermission(const EFWSessionJoinPermission NewPermission) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPartySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPartySubsystem")
	}
	static class UFWPartySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPartySubsystem>();
	}
};

// Class FWOnlineServices.FWPlayerChatComponent
// 0x0008 (0x00A8 - 0x00A0)
class UFWPlayerChatComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MulticastReceiveChatMessage(const struct FUniqueNetIdRepl& Sender, const struct FDateTime& timestamp, const class FString& Message, const struct FLinearColor& InDisplayColor);

	TArray<struct FChatMessage> GetChatHistory() const;
	struct FChatSenderInfo GetSenderInfo(const struct FUniqueNetIdRepl& NetId) const;
	bool SendChatMessage(const class FString& Message, const struct FLinearColor& InDisplayColor) const;
	void ServerSendChatMessage(const struct FUniqueNetIdRepl& Sender, const class FString& Message, const struct FLinearColor& InDisplayColor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerChatComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerChatComponent")
	}
	static class UFWPlayerChatComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerChatComponent>();
	}
};

}

