#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWPersistence

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FWPersistence_structs.hpp"
#include "SqliteGameDB_classes.hpp"
#include "CommonUser_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FWPersistence.FWAsync_WaitForDatastoreReady
// 0x0020 (0x0050 - 0x0030)
class UFWAsync_WaitForDatastoreReady final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)> Ready; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFWAsync_WaitForDatastoreReady* WaitForDatastoreToBeReady(const class UObject* WorldContextObject_0, bool bCompleteOnFailure);

	void OnComplete(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAsync_WaitForDatastoreReady")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAsync_WaitForDatastoreReady")
	}
	static class UFWAsync_WaitForDatastoreReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAsync_WaitForDatastoreReady>();
	}
};

// Class FWPersistence.FWDataAccessLayer
// 0x0B88 (0x0BE0 - 0x0058)
class UFWDataAccessLayer final : public UDbBase
{
public:
	uint8                                         Pad_58[0xB88];                                     // 0x0058(0x0B88)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWDataAccessLayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWDataAccessLayer")
	}
	static class UFWDataAccessLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWDataAccessLayer>();
	}
};

// Class FWPersistence.FWPersistenceCheats
// 0x0008 (0x0030 - 0x0028)
class UFWPersistenceCheats final : public UCheatManagerExtension
{
public:
	class UFWPersistenceSubsystem*                PersistenceSubsystem;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddPlayerUpgrade(const class FString& UpgradeTagString, bool LostOnWaterDeath) const;
	void ClearDataLimits() const;
	void ClearMarker(const class FString& MarkerTagString) const;
	void ClearVendorData() const;
	void GetAllCounters() const;
	void GetTimeUntilTimedEvent(const class FString& TimedEventName) const;
	void LockCharacter(const class FString& CharacterTagString) const;
	void ModifyCharacterExperience(const class FString& CharacterTagString, const double Delta) const;
	void ModifyExperience(const double Delta) const;
	void ModifyScopedCounter(const class FString& ScopeTagString, const class FString& CounterTagString, const double Delta) const;
	void ModifyTimedEventTimer(const class FString& TimedEventName, const class FString& NewTimeUntilOccurrence) const;
	void PromoteCharacter(const class FString& CharacterTagString, const int32 NumberOfLevels) const;
	void RemovePlayerUpgrade(const class FString& UpgradeTagString) const;
	void SetMarker(const class FString& MarkerTagString, const float ExpiresInSeconds) const;
	void SetPersistentScopedCounter(const class FString& ScopeTagString, const class FString& CounterTagString, double Value) const;
	void SetSessionScopedCounter(const class FString& ScopeTagString, const class FString& CounterTagString, double Value) const;
	void SetTimedEventFromNow(const class FString& TimedEventName, const class FString& TimeFromNowToTriggerAt) const;
	void UnlockCharacter(const class FString& CharacterTagString) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPersistenceCheats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPersistenceCheats")
	}
	static class UFWPersistenceCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPersistenceCheats>();
	}
};

// Class FWPersistence.FWPersistenceFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFWPersistenceFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FCurrencyType Conv_DataTableRowHandleToInventoryCurrencyType(const struct FDataTableRowHandle& RowHandle);
	static struct FInventoryItemType Conv_DataTableRowHandleToInventoryItemType(const struct FDataTableRowHandle& RowHandle);
	static struct FDataTableRowHandle Conv_InventoryCurrencyTypeToDataTableRowHandle(const struct FCurrencyType& CurrencyType);
	static struct FDataTableRowHandle Conv_InventoryItemTypeToDataTableRowHandle(const struct FInventoryItemType& ItemType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPersistenceFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPersistenceFunctionLibrary")
	}
	static class UFWPersistenceFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPersistenceFunctionLibrary>();
	}
};

// Class FWPersistence.FWPersistenceSettings
// 0x00D8 (0x0110 - 0x0038)
class UFWPersistenceSettings final : public UDeveloperSettings
{
public:
	int32                                         SaveVersion;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShippingSaveVersion;                               // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCounterWindowConfigurationData> CounterWindowConfiguration;                       // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCounterScopeConfigurationData> CounterScopeConfiguration;                         // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCounterConfigurationData>      CounterConfiguration;                              // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCounterReplicationConfigurationData> CounterReplicationConfiguration;             // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   DefaultScopeTags;                                  // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCounterRoutingConfigurationData> CounterRoutingConfiguration;                     // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FScopedCounterCurrencyConfigurationData> ScopedCounterCurrencyConfiguration;       // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              WeaponExperienceTagTable;                          // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharacterConfigurationData>    CharacterConfiguration;                            // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPromotionSettings                     PromotionSettings;                                 // 0x00E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FItemTypeConfigurationData>     ItemTypeConfiguration;                             // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCurrencyConfigurationData>     CurrencyConfiguration;                             // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static bool FindCharacterExperienceCurrency(const struct FGameplayTag& CharacterTag, struct FCurrencyType* ExperienceCurrencyType);
	static struct FGameplayTag FindCharacterExperienceLimitTag(const struct FGameplayTag& CharacterTag);
	static bool GetCharacterDataConfiguration(const struct FGameplayTag& CharacterTag, struct FCharacterConfigurationData* OutCharacterConfiguration);
	static struct FCounterConfigurationData GetCounterConfiguration(const struct FGameplayTag& CounterTag);
	static const struct FPromotionSettings GetPromotionSettings();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPersistenceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPersistenceSettings")
	}
	static class UFWPersistenceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPersistenceSettings>();
	}
};

// Class FWPersistence.FWPersistenceSubsystem
// 0x01D8 (0x0208 - 0x0030)
class UFWPersistenceSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class UFWPersistenceSubsystem* Subsystem)> PreLoadGame;      // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)> PostLoadGame; // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UFWPersistenceSubsystem* Subsystem)> PreSaveGame;      // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)> PostSaveGame; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x38];                                      // 0x00B8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWDataAccessLayer*                     DatabaseConnection;                                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x110];                                     // 0x00F8(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void AddDatastoreReadyDelegate(const TDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)>& Delegate);
	static void AddNewDatastoreCreatedDelegate(const TDelegate<void(class UFWPersistenceSubsystem* Subsystem)>& Delegate);
	static void RemoveDatastoreReadyDelegate(const TDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result)>& Delegate);
	static void RemoveNewDatastoreCreatedDelegate(const TDelegate<void(class UFWPersistenceSubsystem* Subsystem)>& Delegate);

	int32 AddBuddySpawnRequest(const struct FBuddyType& BuddyType);
	struct FCharacterSkillOperationResult AddCharacterSkill(const struct FGameplayTag& CharacterTag, const struct FGameplayTag& SkillTag, const bool bEnabled);
	void AddPlayerUpgrade(const struct FGameplayTag& UpgradeTag, const bool Permanent);
	void ClearAllPlayerUpgrades();
	void ClearBuddiesToSpawn(const bool bRemoveCount);
	void ClearDurationTracker(const class FName Name_0);
	void ClearExpiredVendorDataJob(class UFWPersistenceSubsystem* Subsystem, const struct FDateTime& ExpectedOccurrence, const struct FTimespan& PastDue, int64 OccurrenceCount);
	void ClearGameplayElementSeen(const struct FGameplayTag& SeenElementTag);
	void ClearPersistentMarker(const struct FGameplayTag& MarkerTag);
	void ClearRuntimeDataLimit(const struct FGameplayTag& LimitTag);
	void ClearTemporaryPlayerUpgrades();
	bool ClearTimedEvent(const class FName EventName);
	void ClearUnsafeLeaveFlag();
	void ClearWindow(const struct FGameplayTag& ScopeTag);
	int64 ConsumeVendorInventory(const struct FVendorIdentifier& VendorID, const struct FInventoryItemType& ItemType, const int64 Quantity, const struct FDateTime& ResetAfter);
	bool CreateDurationTracker(const class FName Name_0, const struct FDateTime& Started, const float ErrorPeriodSeconds);
	struct FInventoryOperationResult CreateInventoryItem(const struct FInventoryItemCreationRequest& ItemToCreate);
	bool DeleteDatastore();
	void ExploreSaveGameDirectory();
	TMap<struct FBuddyType, int64> GetBuddiesToSpawn();
	TArray<struct FVendorConsumedItem> GetVendorConsumedItems(const struct FVendorIdentifier& VendorID);
	void LoadDatastore(bool bCanOverwrite);
	EInventoryItemMergeResult MergeInventoryItem(const int64 KeepInstanceID, const int64 RemoveInstanceID);
	int64 ModifyBuddyCount(const struct FBuddyType& BuddyType, const int64 Delta);
	int64 ModifyBuddyRequestedAmount(const struct FBuddyType& BuddyType, int64 Delta);
	void ModifyCounter(const struct FGameplayTag& CounterTag, const double Delta);
	struct FCurrencyOperationResult ModifyCurrencyAmount(const struct FCurrencyType& CurrencyType, const int64 Delta);
	void ModifyExperience(const int32 Delta);
	struct FInventoryOperationResult ModifyInventoryItemAmount(const struct FInventoryItemType& ItemType, const int64 Delta, const int64 ContainerID);
	void ModifyScopedCounter(const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag, double Delta);
	bool ModifyTimedEventNextOccurrence(const class FName EventName, const struct FTimespan& Delta);
	void ModifyWindowedScopedCounter(const struct FGameplayTag& WindowTag, const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag, double Delta);
	struct FPersistenceResult NewDatastore(bool bCanOverwrite);
	void OnInventoryCleared();
	void OnUserInitializeComplete(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	struct FCharacterPromotionOperationResult PromoteCharacter(const struct FGameplayTag& CharacterTag, const struct FGameplayTagContainer& SkillsToKeep, const TArray<struct FCurrencyType>& CurrenciesToReset);
	struct FBuddyPurchaseResult PurchaseBuddyCount(const struct FBuddyType& BuddyType, const int64 Count, const struct FCurrencyType& CurrencyType, const int64 Cost);
	struct FCharacterSkillOperationResult PurchaseCharacterSkill(const struct FGameplayTag& CharacterTag, const struct FGameplayTag& SkillTag, const struct FCurrencyType& CurrencyType, const int32 Cost, const bool bEnabled);
	struct FPurchaseResult PurchaseItem(const struct FInventoryItemType& ItemType, const int64 Quantity, const struct FCurrencyType& CurrencyType, const int64 Cost);
	bool RegisterSingleTimedEvent(const class FName EventName, const struct FDateTime& NextOccurrence);
	bool RegisterTimedEvent(const class FName EventName, const struct FDateTime& NextOccurrence, const struct FTimespan& RepeatPeriod, const int32 RepeatCount);
	void RegisterTimedEventCallback(const class FName EventName, const TDelegate<void(class UFWPersistenceSubsystem* Subsystem, const struct FDateTime& ExpectedOccurrence, const struct FTimespan& PastDue, int64 OccurrenceCount)>& Callback);
	int32 RemoveBuddySpawnRequest(const struct FBuddyType& BuddyType);
	struct FCharacterSkillOperationResult RemoveCharacterSkill(const struct FGameplayTag& CharacterTag, const struct FGameplayTag& SkillTag);
	void RemovePlayerUpgrade(const struct FGameplayTag& UpgradeTag);
	void ReplaceSaveWithLastKnownGood();
	void ReplaceSaveWithOldestKnownGood();
	void ResetVendorInventory(const struct FVendorIdentifier& VendorID);
	void SaveDatastore();
	int64 SetBuddyCount(const struct FBuddyType& BuddyType, const int64 Value);
	int64 SetBuddySpawnedAmount(const struct FBuddyType& BuddyType, int64 Value);
	bool SetCharacterSkills(const struct FGameplayTag& CharacterTag, const struct FGameplayTagContainer& CharacterSkills);
	struct FCharacterSkillOperationResult SetCharacterSkillState(const struct FGameplayTag& CharacterTag, const struct FGameplayTag& SkillTag, const bool bEnabled);
	struct FCurrencyOperationResult SetCurrencyAmount(const struct FCurrencyType& CurrencyType, const int64 Amount);
	void SetGameJoinPermission(const uint8 PermissionLevel);
	void SetGameplayElementSeen(const struct FGameplayTag& SeenElementTag);
	struct FInventoryOperationResult SetInventoryItemAmount(const struct FInventoryItemType& ItemType, const int64 Quantity, const int64 ContainerID, int64* OutItemInstanceID);
	bool SetItemCustomData(const int64 InstanceId, const TArray<uint8>& CustomBytes);
	void SetLastMissionResult(const ELastMissionResult InLastMissionResult, const class FString& InLastMap, const bool bIsHost);
	void SetPersistentMarker(const struct FGameplayTag& MarkerTag, const struct FTimespan& ExpiresIn);
	void SetRuntimeDataLimit(const struct FGameplayTag& LimitTag, double MinimumValue, double MaximumValue);
	bool SetSelectedCharacter(const struct FGameplayTag& CharacterTag, const struct FSoftObjectPath& CharacterPawnDef);
	void SetSelectedMap(class FName MapName);
	void SetSelectedSpawn(class FName SpawnName);
	bool SetTimedEventNextOccurrence(const class FName EventName, const struct FDateTime& NextOccurrence);
	double SetWindowedScopedCounter(const struct FGameplayTag& WindowTag, const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag, const double Value);
	EInventoryItemSplitResult SplitInventoryItem(int64 SourceInstanceID, const int64 NewItemQuantity, int64* NewInstanceID);
	struct FTradeResult Trade(const TMap<struct FInventoryItemType, int32>& InputItems, const TMap<struct FCurrencyType, int32>& InputCurrencies, const TMap<struct FInventoryItemType, int32>& ResultItems, const TMap<struct FCurrencyType, int32>& ResultCurrencies);
	void UnlockCharacter(const struct FGameplayTag& CharacterTag);
	void UnregisterTimedEventCallback(const class FName EventName);

	bool CanPromoteCharacter(const struct FGameplayTag& CharacterTag) const;
	bool DeleteItemBlueprint(const int64 ItemBlueprintID) const;
	TArray<struct FWindowedScopedCounterValue> GetAllCountersInWindowedScope(const struct FGameplayTag& WindowTag, const struct FGameplayTag& ScopeTag) const;
	TArray<struct FInventoryItemInstance> GetAllInventoryItems() const;
	TArray<struct FItemBlueprint> GetAllItemBlueprints() const;
	struct FGameplayTagContainer GetAvailableCharacterSkills(const struct FGameplayTag& CharacterTag) const;
	int64 GetBuddyCount(const struct FBuddyType& BuddyType) const;
	struct FGameplayTag GetCharacterActiveSkill(const struct FGameplayTag& CharacterTag) const;
	int64 GetCharacterPromotionLevel(const struct FGameplayTag& CharacterTag) const;
	struct FGameplayTagContainer GetCharacterSkills(const struct FGameplayTag& CharacterTag) const;
	int64 GetCurrencyAmount(const struct FCurrencyType& CurrencyType) const;
	struct FGameplayTagContainer GetDisabledCharacterSkills(const struct FGameplayTag& CharacterTag) const;
	struct FFWPersistentDurationTracker GetDurationTracker(class FName Name_0) const;
	struct FTimespan GetDurationTrackerElapsedTime(class FName Name_0) const;
	TArray<struct FFWPersistentDurationTracker> GetDurationTrackers() const;
	uint8 GetGameJoinPermission() const;
	TArray<struct FInventoryItemInstance> GetInventoryContainerItems(const int64 ContainerID) const;
	struct FInventoryItemInstance GetInventoryItem(const int64 InstanceId) const;
	int64 GetInventoryItemCount(const struct FInventoryItemType& ItemType, const int64 InContainerID, int64* GlobalQuantity) const;
	TArray<struct FItemBlueprint> GetItemTypeBlueprints(const struct FInventoryItemType& ItemType) const;
	class FString GetLastMapName() const;
	ELastMissionResult GetLastMissionResult() const;
	ELastMissionResult GetPersistedLastMissionResult() const;
	struct FTimespan GetPersistentMarkerTimeLeft(const struct FGameplayTag& MarkerTag) const;
	double GetPersistentScopedCounter(const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag) const;
	struct FGameplayTagContainer GetPlayerUpgrades() const;
	int32 GetQuestStatus(const struct FGameplayTag& QuestName) const;
	TArray<int32> GetQuestValues(const struct FGameplayTag& QuestName) const;
	void GetRuntimeDataLimit(const struct FGameplayTag& LimitTag, double* OutMinValue, double* OutMaxValue) const;
	struct FGameplayTag GetSelectedCharacter() const;
	struct FSoftObjectPath GetSelectedCharacterPawnDefinition() const;
	class FName GetSelectedMap() const;
	class FName GetSelectedSpawn() const;
	struct FDateTime GetTimedEventNextOccurrence(const class FName EventName) const;
	struct FTimespan GetTimedEventUntilNextOccurrence(class FName EventName) const;
	bool GetVendorResetTime(const struct FVendorIdentifier& VendorID, struct FTimespan* ResetTime) const;
	double GetWindowedScopedCounter(const struct FGameplayTag& WindowTag, const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag) const;
	bool HasPersistentMarker(const struct FGameplayTag& MarkerTag) const;
	bool HasPlayerUpgrade(const struct FGameplayTag& UpgradeTag) const;
	bool HasSeenGameplayElement(const struct FGameplayTag& SeenElementTag) const;
	bool HasWindowedScopedCounter(const struct FGameplayTag& WindowTag, const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag) const;
	bool IsCharacterUnlocked(const struct FGameplayTag& CharacterTag) const;
	bool IsTimedEventRegistered(class FName EventName) const;
	bool LeftUnsafelyAsHost() const;
	bool SetCharacterActiveSkill(const struct FGameplayTag& CharacterTag, const struct FGameplayTag& SkillID) const;
	bool SetItemBlueprint(struct FItemBlueprint* Value) const;
	bool ShouldClearInventory() const;
	bool WasLastExitCrash() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPersistenceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPersistenceSubsystem")
	}
	static class UFWPersistenceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPersistenceSubsystem>();
	}
};

// Class FWPersistence.FWPlayerPersistenceComponent
// 0x0358 (0x03F8 - 0x00A0)
class UFWPlayerPersistenceComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnServerLoadedPersistenceState;                    // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWindowedScopedCounterContainer        WindowedScopedCounters;                            // 0x00D0(0x0168)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x50];                                     // 0x0238(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CurrentCharacter;                                  // 0x0288(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagStackContainer             PersistentMarkers;                                 // 0x0290(0x0168)(Net, Transient, NativeAccessSpecifierPrivate)

public:
	void ClientModifyCurrencyAmount(const struct FCurrencyType& CurrencyType, const int32 Amount);
	void ClientModifyInventoryItemAmount(const struct FInventoryItemType& ItemType, const int32 Amount, int32 Container);
	void ClientSendDataBatch(const TArray<struct FCounterBatchItem>& Batch);
	void ClientSetPersistentMarkerValue(const struct FGameplayTag& MarkerTag, const bool Value, const struct FTimespan& ExpiresIn);
	void ConfirmSuccessRequiredExperience(bool bImmediateFlush);
	struct FGameplayTag GetCurrentCharacter();
	void ModifyCounter(const struct FGameplayTag& CounterTag, const double Delta, bool ImmediateFlush);
	void ModifyCurrencyAmount(const struct FCurrencyType& CurrencyType, const int32 Amount);
	void ModifyExperience(const double Delta, bool bImmediateFlush);
	void ModifyInventoryItemAmount(const struct FInventoryItemType& ItemType, const double Amount, int32 Container);
	void ModifyNamedWeaponExperience(class FName WeaponType, const double Delta, bool bImmediateFlush);
	void ModifyScopedCounter(const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag, const double Delta, bool bImmediateFlush);
	void ModifyWeaponExperience(const struct FGameplayTag& WeaponExperienceScopeTag, const double Delta);
	void ModifyWindowedScopedCounter(const struct FGameplayTag& WindowTag, const struct FGameplayTag& ScopeTag, const struct FGameplayTag& CounterTag, const double Delta, bool bImmediateFlush);
	void ServerClearScope(const struct FGameplayTag& ScopeTag);
	void ServerFlushCounters();
	void ServerLoadState(const struct FPersistentClientState& BulkState);
	void ServerSendDataBatch(const TArray<struct FCounterBatchItem>& Batch);
	void ServerSetCharacter(const struct FGameplayTag& CharacterTag);
	void ServerSetPersistentMarkerValue(const struct FGameplayTag& MarkerTag, const bool NewValue);
	void SetPersistentMarkerValue(const struct FGameplayTag& MarkerTag, const bool Value, const struct FTimespan& ExpiresIn);

	struct FTimespan GetPersistentMarkerTimeLeft(const struct FGameplayTag& MarkerTag) const;
	class UFWPersistenceSubsystem* GetSubsystem() const;
	bool HasPersistentMarker(const struct FGameplayTag& MarkerTag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerPersistenceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerPersistenceComponent")
	}
	static class UFWPlayerPersistenceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerPersistenceComponent>();
	}
};

}

