#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWPlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FWPlayer_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function FWPlayer.FWConsumableTriggerArea.GetSpawnTransform
// 0x00C0 (0x00C0 - 0x0000)
struct FWConsumableTriggerArea_GetSpawnTransform final
{
public:
	struct FTransform                             TriggeredFrom;                                     // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWConsumableTriggerArea.OverrideAttachComponent
// 0x0008 (0x0008 - 0x0000)
struct FWConsumableTriggerArea_OverrideAttachComponent final
{
public:
	class USceneComponent*                        NewAttachComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWConsumableTriggerArea.SpawnVisualsReplicated
// 0x0070 (0x0070 - 0x0000)
struct FWConsumableTriggerArea_SpawnVisualsReplicated final
{
public:
	TSubclassOf<class AActor>                     ActorToSpawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Location;                                          // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Loot.CreatePlayMontageAndWaitProxy
// 0x0030 (0x0030 - 0x0000)
struct FWPlayerGA_Loot_CreatePlayMontageAndWaitProxy final
{
public:
	class FName                                   TaskInstanceName;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           InMontageToPlay;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSection;                                      // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAbilityEnds;                              // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimRootMotionTranslationScale;                    // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTimeSeconds;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlayMontageAndWait*        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetFovADS
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerWeapon_GetFovADS final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetFovOTS
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerWeapon_GetFovOTS final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetFovSpeed
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerWeapon_GetFovSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetFovSprint
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerWeapon_GetFovSprint final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetFovSprintSpeed
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerWeapon_GetFovSprintSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.UpdateAimLag
// 0x0018 (0x0018 - 0x0000)
struct FWPlayerWeapon_UpdateAimLag final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetADSAimIsActive
// 0x0001 (0x0001 - 0x0000)
struct FWPlayerWeapon_GetADSAimIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetADSSocketTransform
// 0x0060 (0x0060 - 0x0000)
struct FWPlayerWeapon_GetADSSocketTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetFovHipFire
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerWeapon_GetFovHipFire final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetOTSADSCameraOffset
// 0x0018 (0x0018 - 0x0000)
struct FWPlayerWeapon_GetOTSADSCameraOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetOTSCameraOffset
// 0x0018 (0x0018 - 0x0000)
struct FWPlayerWeapon_GetOTSCameraOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerWeapon.GetOverTheShoulderAimIsActive
// 0x0001 (0x0001 - 0x0000)
struct FWPlayerWeapon_GetOverTheShoulderAimIsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_BuddyAI.GetBuddyTable
// 0x0008 (0x0008 - 0x0000)
struct FWPlayerGA_BuddyAI_GetBuddyTable final
{
public:
	class UDataTable*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_HitReaction.GetHitAreaFromDirection
// 0x0020 (0x0020 - 0x0000)
struct FWPlayerGA_HitReaction_GetHitAreaFromDirection final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWHitReactionArea                            ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWPlayer.FWPlayerGA_Dodge.CreatePlayMontageAndWaitProxy
// 0x0030 (0x0030 - 0x0000)
struct FWPlayerGA_Dodge_CreatePlayMontageAndWaitProxy final
{
public:
	class FName                                   TaskInstanceName;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           InMontageToPlay;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSection;                                      // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAbilityEnds;                              // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimRootMotionTranslationScale;                    // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTimeSeconds;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlayMontageAndWait*        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Dodge.OnTaskTick
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerGA_Dodge_OnTaskTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Dodge.PlayMontage
// 0x0010 (0x0010 - 0x0000)
struct FWPlayerGA_Dodge_PlayMontage final
{
public:
	class FName                                   StartSection;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlayMontageAndWait*        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayer.CanHeal
// 0x0001 (0x0001 - 0x0000)
struct FWPlayer_CanHeal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayer.CanUseConsumable
// 0x0018 (0x0018 - 0x0000)
struct FWPlayer_CanUseConsumable final
{
public:
	struct FDataTableRowHandle                    ConsumableRow;                                     // 0x0000(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWPlayer.FWPlayer.UseConsumable
// 0x0010 (0x0010 - 0x0000)
struct FWPlayer_UseConsumable final
{
public:
	struct FDataTableRowHandle                    ConsumableRow;                                     // 0x0000(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayer.UseFromTransform
// 0x0060 (0x0060 - 0x0000)
struct FWPlayer_UseFromTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerMovementComponent.ConstrainStrafe
// 0x0001 (0x0001 - 0x0000)
struct FWPlayerMovementComponent_ConstrainStrafe final
{
public:
	bool                                          ConstrainStrafeMovement;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWRecruitInterface.OnRecruitCommandedEvent
// 0x0001 (0x0001 - 0x0000)
struct FWRecruitInterface_OnRecruitCommandedEvent final
{
public:
	EFWBuddyAction                                Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_InteractSequence.PlaySequence
// 0x0018 (0x0018 - 0x0000)
struct FWPlayerGA_InteractSequence_PlaySequence final
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWCharacter*                           PlayerPawn;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWCharacter*                           TargetPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.CreatePlayMontageAndWaitProxy
// 0x0030 (0x0030 - 0x0000)
struct FWPlayerGA_Melee_CreatePlayMontageAndWaitProxy final
{
public:
	class FName                                   TaskInstanceName;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           InMontageToPlay;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSection;                                      // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAbilityEnds;                              // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimRootMotionTranslationScale;                    // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTimeSeconds;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlayMontageAndWait*        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.GetSyncKillSequence
// 0x0018 (0x0018 - 0x0000)
struct FWPlayerGA_Melee_GetSyncKillSequence final
{
public:
	class AFWCharacter*                           Attacker;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWCharacter*                           Victim;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelSequence*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.Golpe
// 0x00B0 (0x00B0 - 0x0000)
struct FWPlayerGA_Melee_Golpe final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.GolpeAttack
// 0x00B0 (0x00B0 - 0x0000)
struct FWPlayerGA_Melee_GolpeAttack final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.GolpeAttackEnd
// 0x00B0 (0x00B0 - 0x0000)
struct FWPlayerGA_Melee_GolpeAttackEnd final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.GolpeAttackStarting
// 0x00B0 (0x00B0 - 0x0000)
struct FWPlayerGA_Melee_GolpeAttackStarting final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.GolpeMissed
// 0x00B0 (0x00B0 - 0x0000)
struct FWPlayerGA_Melee_GolpeMissed final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.OnTaskTick
// 0x0004 (0x0004 - 0x0000)
struct FWPlayerGA_Melee_OnTaskTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.PlayMontage
// 0x0010 (0x0010 - 0x0000)
struct FWPlayerGA_Melee_PlayMontage final
{
public:
	class FName                                   StartSection;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlayMontageAndWait*        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWPlayer.FWPlayerGA_Melee.PlaySequence
// 0x0018 (0x0018 - 0x0000)
struct FWPlayerGA_Melee_PlaySequence final
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWCharacter*                           Attacker;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFWCharacter*                           Victim;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

