#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWPlayer

#include "Basic.hpp"

#include "FWPlayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FWGameCore_structs.hpp"
#include "FWGameCore_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "GameplayAbilities_classes.hpp"
#include "FWAICore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class FWPlayer.FWBaseConsumableAbility
// 0x0018 (0x03D0 - 0x03B8)
class UFWBaseConsumableAbility : public UFWGameplayAbility
{
public:
	bool                                          ManuallyActivate;                                  // 0x03B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ConsumableRow;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ActivateConsumable();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWBaseConsumableAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWBaseConsumableAbility")
	}
	static class UFWBaseConsumableAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWBaseConsumableAbility>();
	}
};

// Class FWPlayer.FWBaseTriggerConsumableAbility
// 0x0000 (0x03D0 - 0x03D0)
class UFWBaseTriggerConsumableAbility final : public UFWBaseConsumableAbility
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWBaseTriggerConsumableAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWBaseTriggerConsumableAbility")
	}
	static class UFWBaseTriggerConsumableAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWBaseTriggerConsumableAbility>();
	}
};

// Class FWPlayer.FWBuddyAIMarkerActor
// 0x0028 (0x02B8 - 0x0290)
class AFWBuddyAIMarkerActor : public AActor
{
public:
	class APawn*                                  AttachToPawn;                                      // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWBuddyAction                                BuddyAction;                                       // 0x0298(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBuddyIcon;                                      // 0x0299(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29A[0x1E];                                     // 0x029A(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWBuddyAIMarkerActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWBuddyAIMarkerActor")
	}
	static class AFWBuddyAIMarkerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWBuddyAIMarkerActor>();
	}
};

// Class FWPlayer.FWConsumableTriggerArea
// 0x0080 (0x05E0 - 0x0560)
class UFWConsumableTriggerArea final : public UBoxComponent
{
public:
	TMulticastInlineDelegate<void(class AActor* Actor)> TriggerAreaActorSpawnedDelegate;             // 0x0558(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSubclassOf<class AActor>, struct FConsumableTriggerData> TriggerActorToConsumableData;     // 0x0570(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                     SpawnLocations;                                    // 0x05C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x10];                                     // 0x05D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FTransform GetSpawnTransform(const struct FTransform& TriggeredFrom);
	void OverrideAttachComponent(class USceneComponent* NewAttachComponent);
	void SpawnVisualsReplicated(TSubclassOf<class AActor> ActorToSpawn, const struct FTransform& Location);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWConsumableTriggerArea")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWConsumableTriggerArea")
	}
	static class UFWConsumableTriggerArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWConsumableTriggerArea>();
	}
};

// Class FWPlayer.FWEnhancedInputComponent
// 0x0000 (0x0160 - 0x0160)
class UFWEnhancedInputComponent final : public UEnhancedInputComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWEnhancedInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWEnhancedInputComponent")
	}
	static class UFWEnhancedInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWEnhancedInputComponent>();
	}
};

// Class FWPlayer.FWEnhancedPlayerInput
// 0x0000 (0x07F0 - 0x07F0)
class UFWEnhancedPlayerInput final : public UEnhancedPlayerInput
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWEnhancedPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWEnhancedPlayerInput")
	}
	static class UFWEnhancedPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWEnhancedPlayerInput>();
	}
};

// Class FWPlayer.FWInputDefinition
// 0x0088 (0x00D0 - 0x0048)
class UFWInputDefinition final : public UFWDataDefinition
{
public:
	class UInputAction*                           InputMove;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputLookStick;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputLookMouse;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputTraversal;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputFire;                                         // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputPickup;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputCycleActiveSkill;                             // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputShowMouseCursor;                              // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputEquipFragGrenade;                             // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputEquipSmokeGrenade;                            // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputCycleAmmoType;                                // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputEquipPrimaryWeapon;                           // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputEquipSecondaryWeapon;                         // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputLeanLeft;                                     // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputLeanRight;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFWInputAction>                 AbilityInputActions;                               // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWInputDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWInputDefinition")
	}
	static class UFWInputDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWInputDefinition>();
	}
};

// Class FWPlayer.FWPlayerCameraManager
// 0x0020 (0x24E0 - 0x24C0)
class AFWPlayerCameraManager final : public APlayerCameraManager
{
public:
	uint8                                         Pad_24C0[0x20];                                    // 0x24C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerCameraManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerCameraManager")
	}
	static class AFWPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWPlayerCameraManager>();
	}
};

// Class FWPlayer.FWPlayerGameplayAbility_Down
// 0x0058 (0x0410 - 0x03B8)
class UFWPlayerGameplayAbility_Down : public UFWGameplayAbility
{
public:
	struct FFWAbilityMontageData                  MontageData;                                       // 0x03B8(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     IndicatorActorClass;                               // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IndicatorActorAttachBone;                          // 0x03E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BleedoutTime;                                      // 0x03E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DownMessageText;                                   // 0x03F0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 IndicatorActor;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAbilityTask_Down*                    DownTask;                                          // 0x0408(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGameplayAbility_Down")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGameplayAbility_Down")
	}
	static class UFWPlayerGameplayAbility_Down* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGameplayAbility_Down>();
	}
};

// Class FWPlayer.FWPlayerGA_Loot
// 0x0030 (0x03E8 - 0x03B8)
class UFWPlayerGA_Loot : public UFWGameplayAbility
{
public:
	class UAbilityTask_PlayMontageAndWait*        MontageTask;                                       // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           MontageStartToPlay;                                // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           MontageStartReverseToPlay;                         // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           MontageLoopToPlay;                                 // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWCharacter*                           CurrentPlayerCharacter;                            // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0x8];                                      // 0x03E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CallEndAbility();
	class UAbilityTask_PlayMontageAndWait* CreatePlayMontageAndWaitProxy(class FName TaskInstanceName, class UAnimMontage* InMontageToPlay, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, float StartTimeSeconds);
	void OnCompleted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_Loot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_Loot")
	}
	static class UFWPlayerGA_Loot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_Loot>();
	}
};

// Class FWPlayer.FWAbilityTask_Down
// 0x0018 (0x0098 - 0x0080)
class UFWAbilityTask_Down final : public UAbilityTask
{
public:
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWAbilityTask_Down")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWAbilityTask_Down")
	}
	static class UFWAbilityTask_Down* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWAbilityTask_Down>();
	}
};

// Class FWPlayer.FWPlayerGameplayAbility_MedKit
// 0x0010 (0x03E0 - 0x03D0)
class UFWPlayerGameplayAbility_MedKit : public UFWBaseConsumableAbility
{
public:
	TSubclassOf<class UFWGameplayEffect>          GameplayEffectClass;                               // 0x03D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           GameplayCueTag;                                    // 0x03D8(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGameplayAbility_MedKit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGameplayAbility_MedKit")
	}
	static class UFWPlayerGameplayAbility_MedKit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGameplayAbility_MedKit>();
	}
};

// Class FWPlayer.FWPlayerWeapon
// 0x0000 (0x0000 - 0x0000)
class IFWPlayerWeapon final
{
public:
	float GetFovADS();
	float GetFovOTS();
	float GetFovSpeed();
	float GetFovSprint();
	float GetFovSprintSpeed();
	struct FVector2D UpdateAimLag(float DeltaTime);

	bool GetADSAimIsActive() const;
	struct FTransform GetADSSocketTransform() const;
	float GetFovHipFire() const;
	struct FVector GetOTSADSCameraOffset() const;
	struct FVector GetOTSCameraOffset() const;
	bool GetOverTheShoulderAimIsActive() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerWeapon")
	}
	static class IFWPlayerWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWPlayerWeapon>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWPlayer.FWPlayerGameplayAbility_Revive
// 0x0020 (0x03D8 - 0x03B8)
class UFWPlayerGameplayAbility_Revive : public UFWGameplayAbility
{
public:
	float                                         InputHeldTime;                                     // 0x03B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFWPlayerGameplayAbility_Reviving> RevivingAbilityClass;                       // 0x03C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAbilityTask_WaitInputHeld*           WaitInputHeldTask;                                 // 0x03C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGameplayAbility_Revive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGameplayAbility_Revive")
	}
	static class UFWPlayerGameplayAbility_Revive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGameplayAbility_Revive>();
	}
};

// Class FWPlayer.FWPlayerGameplayAbility_Reviving
// 0x0038 (0x03F0 - 0x03B8)
class UFWPlayerGameplayAbility_Reviving : public UFWGameplayAbility
{
public:
	struct FFWAbilityMontageData                  MontageData;                                       // 0x03B8(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFWGameplayEffect>          GameplayEffectClass;                               // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ReviveMessageText;                                 // 0x03E0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGameplayAbility_Reviving")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGameplayAbility_Reviving")
	}
	static class UFWPlayerGameplayAbility_Reviving* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGameplayAbility_Reviving>();
	}
};

// Class FWPlayer.FWPlayerGA_BuddyAI
// 0x00E8 (0x04A0 - 0x03B8)
class UFWPlayerGA_BuddyAI : public UFWGameplayAbility
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistance;                                       // 0x03C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerLineRadius;                                  // 0x03C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRadius;                                       // 0x03C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerPushOutDistance;                             // 0x03CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         MarkerActorClassPath;                              // 0x03D0(0x0020)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class AFWBuddyAIMarkerActor>      MarkerActorClass;                                  // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFWBuddyAIMarkerActor*>          MarkerActors;                                      // 0x03F8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        BuddyDTPath;                                       // 0x0408(0x0020)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             BuddyDT;                                           // 0x0428(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class APawn*>                          SpawnedPawns;                                      // 0x0430(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AFWBuddyAIMarkerActor*>          SpawnedPawnMarkers;                                // 0x0440(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFWAISpawnSettings                     SpawnSettings;                                     // 0x0450(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x10];                                     // 0x0478(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        MontageTask;                                       // 0x0488(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           OrderMontage;                                      // 0x0490(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDataTable* GetBuddyTable();

	void OnCompleted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_BuddyAI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_BuddyAI")
	}
	static class UFWPlayerGA_BuddyAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_BuddyAI>();
	}
};

// Class FWPlayer.FWPlayerGA_HitReaction
// 0x0010 (0x03C8 - 0x03B8)
class UFWPlayerGA_HitReaction : public UFWGameplayAbility
{
public:
	uint8                                         Pad_3B8[0x10];                                     // 0x03B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EFWHitReactionArea GetHitAreaFromDirection(const struct FVector& Direction);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_HitReaction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_HitReaction")
	}
	static class UFWPlayerGA_HitReaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_HitReaction>();
	}
};

// Class FWPlayer.FWPlayerGA_Dodge
// 0x0020 (0x03D8 - 0x03B8)
class UFWPlayerGA_Dodge : public UFWGameplayAbility
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAbilityTask_TaskOnTick*              TaskOnTick;                                        // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           MontageToPlay;                                     // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWCharacter*                           CurrentPlayerCharacter;                            // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UAbilityTask_PlayMontageAndWait* CreatePlayMontageAndWaitProxy(class FName TaskInstanceName, class UAnimMontage* InMontageToPlay, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, float StartTimeSeconds);
	void K2_OnBlendOut();
	void K2_OnCancelled();
	void K2_OnCompleted();
	void K2_OnInterrupted();
	void OnBlendOut();
	void OnCancelled();
	void OnCompleted();
	void OnInterrupted();
	void OnTaskTick(float DeltaTime);
	class UAbilityTask_PlayMontageAndWait* PlayMontage(class FName StartSection);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_Dodge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_Dodge")
	}
	static class UFWPlayerGA_Dodge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_Dodge>();
	}
};

// Class FWPlayer.FWPlayerGA_Sprint
// 0x0000 (0x03B8 - 0x03B8)
class UFWPlayerGA_Sprint final : public UFWGameplayAbility
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_Sprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_Sprint")
	}
	static class UFWPlayerGA_Sprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_Sprint>();
	}
};

// Class FWPlayer.FWPlayer
// 0x0000 (0x0000 - 0x0000)
class IFWPlayer final
{
public:
	bool CanHeal();
	bool CanUseConsumable(const struct FDataTableRowHandle& ConsumableRow);
	void UseConsumable(const struct FDataTableRowHandle& ConsumableRow);
	struct FTransform UseFromTransform();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayer")
	}
	static class IFWPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWPlayer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWPlayer.FWPlayerMovementComponent
// 0x0010 (0x0FD0 - 0x0FC0)
class UFWPlayerMovementComponent final : public UFWCharacterMovementComponent
{
public:
	float                                         FallSpeed;                                         // 0x0FB8(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentFallSpeed;                                  // 0x0FBC(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPassedApex;                                       // 0x0FC0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bConstrainStrafe;                                  // 0x0FC1(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FC2[0xE];                                      // 0x0FC2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConstrainStrafe(const bool ConstrainStrafeMovement);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerMovementComponent")
	}
	static class UFWPlayerMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerMovementComponent>();
	}
};

// Class FWPlayer.FWRecruitInterface
// 0x0000 (0x0000 - 0x0000)
class IFWRecruitInterface final
{
public:
	void OnRecruitCommandedEvent(EFWBuddyAction Action);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWRecruitInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWRecruitInterface")
	}
	static class IFWRecruitInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFWRecruitInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FWPlayer.FWPlayerGameplayAbility_Traversal
// 0x0028 (0x03E0 - 0x03B8)
class UFWPlayerGameplayAbility_Traversal : public UFWGameplayAbility
{
public:
	bool                                          bCanJump;                                          // 0x03B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanMantleMid;                                     // 0x03B9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanMantleHigh;                                    // 0x03BA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanVault;                                         // 0x03BB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallingCanMantleMid;                              // 0x03BC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallingCanMantleHigh;                             // 0x03BD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallingCanVault;                                  // 0x03BE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAirTraversal;                                     // 0x03BF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SyncTargetPoint;                                   // 0x03C0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanActivateOverride;                              // 0x03D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetTraversalStates();
	void StartJumping();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGameplayAbility_Traversal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGameplayAbility_Traversal")
	}
	static class UFWPlayerGameplayAbility_Traversal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGameplayAbility_Traversal>();
	}
};

// Class FWPlayer.FWPlayerGA_ChangeSkin
// 0x0188 (0x0540 - 0x03B8)
class UFWPlayerGA_ChangeSkin : public UFWGameplayAbility
{
public:
	TMap<struct FGameplayTag, class ULevelSequence*> PlayerLevelSequences;                           // 0x03B8(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SequenceTransform;                                 // 0x0410(0x0060)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWCharacter*                           PlayerPawn;                                        // 0x0470(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0478(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_480[0xC0];                                     // 0x0480(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSequenceEnd();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_ChangeSkin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_ChangeSkin")
	}
	static class UFWPlayerGA_ChangeSkin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_ChangeSkin>();
	}
};

// Class FWPlayer.FWPlayerGA_InteractSequence
// 0x00E8 (0x04A0 - 0x03B8)
class alignas(0x10) UFWPlayerGA_InteractSequence : public UFWGameplayAbility
{
public:
	TArray<struct FFWPlayerGA_InteractSequenceTarget> PlayerTargetSequences;                         // 0x03B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class AFWCharacter*                           SequencePlayerPawn;                                // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWCharacter*                           SequenceTargetPawn;                                // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWPlayerController*                    SequencePlayerController;                          // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0xC0];                                     // 0x03E0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSequenceEnd();
	void PlaySequence(class ULevelSequence* Sequence, class AFWCharacter* PlayerPawn, class AFWCharacter* TargetPawn);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_InteractSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_InteractSequence")
	}
	static class UFWPlayerGA_InteractSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_InteractSequence>();
	}
};

// Class FWPlayer.FWPlayerGA_Melee
// 0x0130 (0x04E8 - 0x03B8)
class UFWPlayerGA_Melee : public UFWGameplayAbility
{
public:
	TMap<struct FGameplayTag, struct FFWPlayerGA_MeleePlayerSyncKill> SyncKillPawnSequences;         // 0x03B8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class AFWCharacter*                           SequenceAttacker;                                  // 0x0408(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWCharacter*                           SequenceVictim;                                    // 0x0410(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFWPlayerController*                    SequenceAttackerController;                        // 0x0418(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0420(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilityTask_WaitGameplayEvent*         WaitGameplayEventTask;                             // 0x0428(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilityTask_WaitGameplayEvent*         WaitGameplayEventTaskGGPO;                         // 0x0430(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilityTask_WaitGameplayEvent*         WaitGameplayEventTaskGulpeActive;                  // 0x0438(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilityTask_WaitGameplayEvent*         WaitGameplayEventTaskGulpeDeadFish;                // 0x0440(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFWAbilityTask_TaskOnTick*              TaskOnTick;                                        // 0x0448(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x58];                                     // 0x0450(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWWeaponBase*                          CurrentWeapon;                                     // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           GolpeHitReactionTag;                               // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  GolpeHitReactionTagContainer;                      // 0x04B8(0x0020)(NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E0[0x8];                                      // 0x04E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAbilityTask_PlayMontageAndWait* CreatePlayMontageAndWaitProxy(class FName TaskInstanceName, class UAnimMontage* InMontageToPlay, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, float StartTimeSeconds);
	class ULevelSequence* GetSyncKillSequence(class AFWCharacter* Attacker, class AFWCharacter** Victim);
	void Golpe(const struct FGameplayEventData& Payload);
	void GolpeAttack(const struct FGameplayEventData& Payload);
	void GolpeAttackEnd(const struct FGameplayEventData& Payload);
	void GolpeAttackStarting(const struct FGameplayEventData& Payload);
	void GolpeMissed(const struct FGameplayEventData& Payload);
	void K2_OnBlendOut();
	void K2_OnCancelled();
	void K2_OnCompleted();
	void K2_OnInterrupted();
	void OnBlendOut();
	void OnCancelled();
	void OnCompleted();
	void OnInterrupted();
	void OnSequenceEnd();
	void OnTaskTick(float DeltaTime);
	class UAbilityTask_PlayMontageAndWait* PlayMontage(class FName StartSection);
	void PlaySequence(class ULevelSequence* Sequence, class AFWCharacter* Attacker, class AFWCharacter* Victim);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_Melee")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_Melee")
	}
	static class UFWPlayerGA_Melee* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_Melee>();
	}
};

// Class FWPlayer.FWPlayerGA_StationaryGun
// 0x0010 (0x03C8 - 0x03B8)
class UFWPlayerGA_StationaryGun : public UFWGameplayAbility
{
public:
	class AFWWeaponBase*                          StationaryWeapon;                                  // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        PlayerSnapSceneComponent;                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FWPlayerGA_StationaryGun")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FWPlayerGA_StationaryGun")
	}
	static class UFWPlayerGA_StationaryGun* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFWPlayerGA_StationaryGun>();
	}
};

}

