#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWQuestSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWQuestSystem_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FWQuestSystem.FWQuest.GetQuestDisplayName
// 0x0010 (0x0010 - 0x0000)
struct FWQuest_GetQuestDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuest.GetQuestDisplayRewardText
// 0x0010 (0x0010 - 0x0000)
struct FWQuest_GetQuestDisplayRewardText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuest.GetQuestDisplayText
// 0x0010 (0x0010 - 0x0000)
struct FWQuest_GetQuestDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuest.GetQuestStatus
// 0x0001 (0x0001 - 0x0000)
struct FWQuest_GetQuestStatus final
{
public:
	EFWQuestStatus                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestComponent.ClientOnAIKilled
// 0x0018 (0x0018 - 0x0000)
struct FWQuestComponent_ClientOnAIKilled final
{
public:
	class APlayerController*                      InstigatorController;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           KilledPawnTag;                                     // 0x0008(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           KilledPawnFaction;                                 // 0x0010(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestComponent.ClientOnItemDropped
// 0x0018 (0x0018 - 0x0000)
struct FWQuestComponent_ClientOnItemDropped final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ItemRowHandle;                                     // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestComponent.ClientOnItemPickedUp
// 0x0018 (0x0018 - 0x0000)
struct FWQuestComponent_ClientOnItemPickedUp final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ItemRowHandle;                                     // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestComponent.ClientOnPlayerExtracted
// 0x0008 (0x0008 - 0x0000)
struct FWQuestComponent_ClientOnPlayerExtracted final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestComponent.ServerActivateQuest
// 0x0008 (0x0008 - 0x0000)
struct FWQuestComponent_ServerActivateQuest final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestComponent.ServerDeactivateQuest
// 0x0008 (0x0008 - 0x0000)
struct FWQuestComponent_ServerDeactivateQuest final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestSubsystem.ActivateQuest
// 0x0010 (0x0010 - 0x0000)
struct FWQuestSubsystem_ActivateQuest final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWQuestSystem.FWQuestSubsystem.CanActivateQuest
// 0x0010 (0x0010 - 0x0000)
struct FWQuestSubsystem_CanActivateQuest final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWQuestSystem.FWQuestSubsystem.DeactivateQuest
// 0x0010 (0x0010 - 0x0000)
struct FWQuestSubsystem_DeactivateQuest final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWQuestSystem.FWQuestSubsystem.DebugForceQuestToState
// 0x0010 (0x0010 - 0x0000)
struct FWQuestSubsystem_DebugForceQuestToState final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFWQuestStatus                                NewStatus;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWQuestSystem.FWQuestSubsystem.GetAllQuests
// 0x0010 (0x0010 - 0x0000)
struct FWQuestSubsystem_GetAllQuests final
{
public:
	TArray<struct FGameplayTag>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestSubsystem.GetQuestByTag
// 0x0010 (0x0010 - 0x0000)
struct FWQuestSubsystem_GetQuestByTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWQuest*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestSubsystem.GetQuestByTagString
// 0x0018 (0x0018 - 0x0000)
struct FWQuestSubsystem_GetQuestByTagString final
{
public:
	class FString                                 TagString;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFWQuest*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestSubsystem.ItemsAlreadyInStash
// 0x0018 (0x0018 - 0x0000)
struct FWQuestSubsystem_ItemsAlreadyInStash final
{
public:
	struct FDataTableRowHandle                    ItemRowHandle;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWQuestSystem.FWQuestSubsystem.LoadQuestData
// 0x0008 (0x0008 - 0x0000)
struct FWQuestSubsystem_LoadQuestData final
{
public:
	class UFWQuest*                               Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWQuestSystem.FWQuestTaskActor.CompleteQuestTask
// 0x0001 (0x0001 - 0x0000)
struct FWQuestTaskActor_CompleteQuestTask final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

