#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWSession

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FWSession.FWGameInstance.GetExtracted
// 0x0001 (0x0001 - 0x0000)
struct FWGameInstance_GetExtracted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.GetLeftHost
// 0x0001 (0x0001 - 0x0000)
struct FWGameInstance_GetLeftHost final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.GetOverrideSpawnLocation
// 0x0020 (0x0020 - 0x0000)
struct FWGameInstance_GetOverrideSpawnLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FWSession.FWGameInstance.GetPreviousMap
// 0x0010 (0x0010 - 0x0000)
struct FWGameInstance_GetPreviousMap final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.SetListenServerEnable
// 0x0001 (0x0001 - 0x0000)
struct FWGameInstance_SetListenServerEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.SetOverrideSpawnLocation
// 0x0018 (0x0018 - 0x0000)
struct FWGameInstance_SetOverrideSpawnLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.SetPlayerStartTag
// 0x0008 (0x0008 - 0x0000)
struct FWGameInstance_SetPlayerStartTag final
{
public:
	class FName                                   InPlayerStartTag;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.GetHubWorldMap
// 0x0008 (0x0008 - 0x0000)
struct FWGameInstance_GetHubWorldMap final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.GetPlayerStartTag
// 0x0008 (0x0008 - 0x0000)
struct FWGameInstance_GetPlayerStartTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FWSession.FWGameInstance.GetSessionHostHubTravelOptions
// 0x0018 (0x0018 - 0x0000)
struct FWGameInstance_GetSessionHostHubTravelOptions final
{
public:
	bool                                          bListen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

