#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AI_HitReaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWAICore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_HitReaction.GA_AI_HitReaction_C
// 0x0020 (0x04E8 - 0x04C8)
class UGA_AI_HitReaction_C : public UFWAIGameplayAbility_HitReaction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharacterDamage_C*                     DamageFromGoreSystem;                              // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit_React_Manager_;                                // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_AI_HitReactManager_C*              Hit_React_Manager;                                 // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Evaluate_Hit_React_Manager(bool* Hit_React_Blocked_by_Manager_);
	void ExecuteUbergraph_GA_AI_HitReaction(int32 EntryPoint);
	void Has_Hit_React_Manager_();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnBlendOut_27E73E5D462612E63A85CB93BA36655A();
	void OnCancelled_27E73E5D462612E63A85CB93BA36655A();
	void OnCompleted_27E73E5D462612E63A85CB93BA36655A();
	void OnInterrupted_27E73E5D462612E63A85CB93BA36655A();
	void StartGoreSystem();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_AI_HitReaction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_AI_HitReaction_C")
	}
	static class UGA_AI_HitReaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_HitReaction_C>();
	}
};

}

