#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AI_Traversal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWAICore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_Traversal.GA_AI_Traversal_C
// 0x0038 (0x0410 - 0x03D8)
class UGA_AI_Traversal_C final : public UFWAIGameplayAbility_Traversal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWCharacterAnimationDefinition*        Anim_Data;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWGameCharacter*                       This_FWGame_Character;                             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWCharacterAnimationDefinition*        This_Animation_Definition;                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                Motion_Warp;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Reset_Traversal_States_;                           // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Restore_Walk_Mode_;                                // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWCharacter*                           This_FWCharacter;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AI_Traversal(int32 EntryPoint);
	void GetAnimationData(bool* Valid_);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_668D988E4A5F918C54263B8D86CA1DA6();
	void OnBlendOut_D6C95D5C494B5E1661CFFB90AF222E7A();
	void OnBlendOut_ECECE47D48F0AFC3DB4CFEA3DE5009EB();
	void OnCancelled_668D988E4A5F918C54263B8D86CA1DA6();
	void OnCancelled_D6C95D5C494B5E1661CFFB90AF222E7A();
	void OnCancelled_ECECE47D48F0AFC3DB4CFEA3DE5009EB();
	void OnCompleted_668D988E4A5F918C54263B8D86CA1DA6();
	void OnCompleted_D6C95D5C494B5E1661CFFB90AF222E7A();
	void OnCompleted_ECECE47D48F0AFC3DB4CFEA3DE5009EB();
	void OnInterrupted_668D988E4A5F918C54263B8D86CA1DA6();
	void OnInterrupted_D6C95D5C494B5E1661CFFB90AF222E7A();
	void OnInterrupted_ECECE47D48F0AFC3DB4CFEA3DE5009EB();
	void SetSyncPoint(bool* Valid_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_AI_Traversal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_AI_Traversal_C")
	}
	static class UGA_AI_Traversal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_Traversal_C>();
	}
};

}

