#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_Down

#include "Basic.hpp"

#include "FWPlayer_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Player_Down.GA_Player_Down_C
// 0x0028 (0x0438 - 0x0410)
class UGA_Player_Down_C final : public UFWPlayerGameplayAbility_Down
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Bleedout_Time_for_Timer;                           // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_ReviveTimer_C*                      Revive_Countdown_Widget;                           // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Retry_Attempts;                                    // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckDeathTimer;                                   // 0x0430(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Check_For_Dead();
	void ExecuteUbergraph_GA_Player_Down(int32 EntryPoint);
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void UpdatePlayerDownedMarkers();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Player_Down_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Player_Down_C")
	}
	static class UGA_Player_Down_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Player_Down_C>();
	}
};

}

