#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_HitReaction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FWPlayer_structs.hpp"
#include "FWPlayer_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Player_HitReaction.GA_Player_HitReaction_C
// 0x01A8 (0x0570 - 0x03C8)
class UGA_Player_HitReaction_C final : public UFWPlayerGA_HitReaction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class FName, class USoundBase*>          SB_HitReact_SC;                                    // 0x03D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SB_Tinnitus_SC;                                    // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_HitReact;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Hit_Reaction_Invuln_Window;                        // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Cool_Down_Timer;                                   // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerBase_C*                       This_Player;                                       // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Montage_Timer;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Hit_Reaction_Montage;                              // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelTransform;                                      // 0x0460(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFalldown;                                        // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HitReactSection;                                   // 0x04C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Quadrant;                                          // 0x04CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _SpineDirection;                                   // 0x04D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           GetUpFromFaceUp;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           GetUpFromFaceDown;                                 // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_Tinnitus;                                     // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_No_Crouch;                                   // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Force_No_Crouch_Ticks;                             // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Was_Knocked_Down;                                  // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Get_Up_Montage;                                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Montage_Speed;                                     // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          This_Player_s_Anim_Instance;                       // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPC_ControllerAimAssist_C*             My_Player_s_Input_Component;                       // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Mash;                                          // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_FailSafe;                                      // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Starting_Loc;                                      // 0x0548(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Root_Motion_Translation_Scale;                     // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Restored_from_Ragdoll_;                            // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Adjust_Montage_Speeds(int32 Speed_Value);
	void Audio_AbiltyStarted();
	void Crouch_Check();
	void Detect_if_player_is_in_mesh();
	void ExecuteUbergraph_GA_Player_HitReaction(int32 EntryPoint);
	void FAILSAFE();
	void Falldown_Gate();
	class UAnimMontage* GetHitReactionMontage(bool* Valid_);
	void GetSFX(class USoundBase** SoundBase);
	void IsCurrentMontageActive(bool* RetVal);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Mash_Update(int32 Button_Mash_Count);
	void Montage_Backup_Check();
	void OnBlendOut_84BE72854BF4AB2A0D7580AA41BB6B26();
	void OnBlendOut_8AD2D6734AF850190D9DFFB9683C50E2();
	void OnCancelled_84BE72854BF4AB2A0D7580AA41BB6B26();
	void OnCancelled_8AD2D6734AF850190D9DFFB9683C50E2();
	void OnCompleted_84BE72854BF4AB2A0D7580AA41BB6B26();
	void OnCompleted_8AD2D6734AF850190D9DFFB9683C50E2();
	void OnInterrupted_84BE72854BF4AB2A0D7580AA41BB6B26();
	void OnInterrupted_8AD2D6734AF850190D9DFFB9683C50E2();
	void PlayHitReactAnim();
	void PlayHitReactSFX();
	void Pull_from_OTH();
	void Safety_to_make_sure_we_ain_t_locked_out();
	void Set_Root_Motion_Translation_Scale();
	void Stop_Hit_Reaction_Montage_Backup();
	void Toggle_Tracking_Button_Mash(bool Track_Button_Mash_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Player_HitReaction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Player_HitReaction_C")
	}
	static class UGA_Player_HitReaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Player_HitReaction_C>();
	}
};

}

