#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_Sprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWGameCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Player_Sprint.GA_Player_Sprint_C
// 0x0050 (0x0408 - 0x03B8)
class UGA_Player_Sprint_C final : public UFWGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PreviousMaxWalkSpeed;                              // 0x03C0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrajectoryGenerator*                   TrajectoryGenerator;                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFWPlayerMovementComponent*             PlayerMovementComponent;                           // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x03D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerBase_C*                       Our_Player;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Control_Timer;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Ability_Ending;                                    // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinMaxDirection;                                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled_Over_Shoulder_Aim;                        // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Abort_OTShoulder();
	void Control_Monitor();
	void Detect_Ability_Start(class UFWGameplayAbility* Ability, class AActor* Ability_Owner, int32 Traversal_INT);
	void ExecuteUbergraph_GA_Player_Sprint(int32 EntryPoint);
	void GetFWCharacter(bool* Valid_, class AFWCharacter** RetVal);
	float GetMaxSprintSpeed(bool* Valid_);
	void GetPlayerMovementComponent(bool* Valid_, class UFWPlayerMovementComponent** RetVal);
	void GetTrajectoryComponent(bool* Valid_, class UTrajectoryGenerator** RetVal);
	void Inform_Ability_Started();
	bool IsAccleratating();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Not_in_air_(bool* On_ground_);
	void OnRelease_48702AD74072475E6D75F581D2AC4508(float TimeHeld);
	void OnTick_F4DD0A6F4F850BEDB05C47876475487E(float DeltaTime);
	void ResetMaxWalkSpeed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Player_Sprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Player_Sprint_C")
	}
	static class UGA_Player_Sprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Player_Sprint_C>();
	}
};

}

