#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_MedKit

#include "Basic.hpp"

#include "FWPlayer_classes.hpp"
#include "Engine_structs.hpp"
#include "ENUM_ConsumableType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Player_MedKit.GA_Player_MedKit_C
// 0x00D8 (0x04B8 - 0x03E0)
class UGA_Player_MedKit_C final : public UFWPlayerGameplayAbility_MedKit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Failsafe_Timer;                                    // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerBase_C*                       As_BP_Player_Base;                                 // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             My_Consumable_Mesh_SOFT;                           // 0x0400(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMesh*                            My_Consumable_Mesh;                                // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ENUM_ConsumableType                           Consumable_Type;                                   // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              SB_Injection_Consumable_SB;                        // 0x0438(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        AC_Injection_Consumable_SB;                        // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_Consumable;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           Legal_Player_Classes;                              // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           Old_Man_Montage;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Bag_Man_Montage;                                   // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Scav_Girl_Montage;                                 // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Shaman_Montage;                                    // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Mask_Man_Montage;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Gunhead_Montage;                                   // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Audio_Locked_;                                     // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Abort_on_Gunhead();
	void Allowed_Player_Classes(bool* Allowed_Player_Class_);
	void _Disable_Movement(bool Allow_Movement_);
	void ExecuteUbergraph_GA_Player_MedKit(int32 EntryPoint);
	void FailsafeEnd();
	void _Unhide_Gun(bool Show_Gun_);
	void Identify_Consumable_Model();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_5EC58DA144F4B25634C6DB8BE2335134(class FName NotifyName);
	void OnCompleted_5EC58DA144F4B25634C6DB8BE2335134(class FName NotifyName);
	void OnInterrupted_5EC58DA144F4B25634C6DB8BE2335134(class FName NotifyName);
	void OnLoaded_382712B14346DA38F0305989C32BB507(class UObject* Loaded);
	void OnNotifyBegin_5EC58DA144F4B25634C6DB8BE2335134(class FName NotifyName);
	void OnNotifyEnd_5EC58DA144F4B25634C6DB8BE2335134(class FName NotifyName);
	void Pick_Montage();
	void Play_Audio();
	void Replicate_Montage();
	void StopAudio();
	void Unlock_Failsfe();
	void Unlock_Audio();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Player_MedKit_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Player_MedKit_C")
	}
	static class UGA_Player_MedKit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Player_MedKit_C>();
	}
};

}

