#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_ChangeSkin

#include "Basic.hpp"

#include "FWPlayer_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Player_ChangeSkin.GA_Player_ChangeSkin_C
// 0x0030 (0x0570 - 0x0540)
class UGA_Player_ChangeSkin_C final : public UFWPlayerGA_ChangeSkin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundMix*                              SCMM_Spawn;                                        // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SCMM_Spawn_Silence;                                // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MenuCheck;                                         // 0x0558(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Valid_Levels;                                      // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Player_ChangeSkin(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void MenuCheckTick();
	void Valid_World_(bool* In_HUB_World_);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Player_ChangeSkin_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Player_ChangeSkin_C")
	}
	static class UGA_Player_ChangeSkin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Player_ChangeSkin_C>();
	}
};

}

