#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Stunned

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWAICore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Stunned.GA_Stunned_C
// 0x0068 (0x0448 - 0x03E0)
class UGA_Stunned_C final : public UFWAIGA_Stunned
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftObjectPtr<class UAnimMontage>>    Montages;                                          // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFWGameCharacter*                       Stunned_AI;                                        // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Stunned_AI_s_Mesh;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimInstance*                          Stunned_AI_s_Anim_Inst;                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Unstun_;                                       // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           AI_that_can_Unstun;                                // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Min_Stun_Time;                                     // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Stun_Time;                                     // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Blend_Out_Time;                                // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Blend_Out_Time;                                // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found_Montage_;                                    // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Collect_Vars();
	void ExecuteUbergraph_GA_Stunned(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Stunned_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Stunned_C")
	}
	static class UGA_Stunned_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Stunned_C>();
	}
};

}

