#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Weapon_Fire_Burst

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWGameCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Weapon_Fire_Burst.GA_Weapon_Fire_Burst_C
// 0x0030 (0x03E8 - 0x03B8)
class UGA_Weapon_Fire_Burst_C final : public UFWGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWWeaponUserComponent*                 WeaponComponent;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFWWeaponBase*                          CurrentWeapon;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponDefinition*                    CurrentWeaponDefinition;                           // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Starting_Ammo;                                     // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ending_Ammo;                                       // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shots_to_Fire;                                     // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          First_Shot_Out;                                    // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Onest_person_extreme_angle_check(bool* Allow_Anim_);
	int32 CalculateBurstAmmo();
	void Check_if_Ability_Allowed(bool* Allow_Ability_);
	void ExecuteUbergraph_GA_Weapon_Fire_Burst(int32 EntryPoint);
	void Fire_Shot();
	class UFWWeaponUserComponent* GetWeaponComponent();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_07D75901487A1264282FB1876844E9B7();
	void OnCancelled_07D75901487A1264282FB1876844E9B7();
	void OnCompleted_07D75901487A1264282FB1876844E9B7();
	void OnInterrupted_07D75901487A1264282FB1876844E9B7();
	void Report_Weapon_Down();
	void Revert_Speed_Mod_on_Weapon();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Weapon_Fire_Burst_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Weapon_Fire_Burst_C")
	}
	static class UGA_Weapon_Fire_Burst_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Weapon_Fire_Burst_C>();
	}
};

}

