#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Weapon_Throw_CycleAmmo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWGameCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Weapon_Throw_CycleAmmo.GA_Weapon_Throw_CycleAmmo_C
// 0x0030 (0x03E8 - 0x03B8)
class UGA_Weapon_Throw_CycleAmmo_C final : public UFWGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWWeaponUserComponent*                 WeaponComponent;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFWWeaponBase*                          Grenade_Throwing_Weapon;                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponDefinition*                    CurrentWeaponDefinition;                           // 0x03D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWGamePlayerCharacter*                 Weapon_Owner;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Failsafe_Timer;                                    // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_if_Ability_Allowed(bool* Allow_Ability_);
	void ExecuteUbergraph_GA_Weapon_Throw_CycleAmmo(int32 EntryPoint);
	void FailsafeEnd();
	void Get_Throw_Weapon(class UFWWeaponUserComponent* FWWeaponUser, bool* Success_);
	class UFWWeaponUserComponent* GetWeaponComponent(bool* Success_);
	void Inform_Weapon_of_Use();
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Weapon_Throw_CycleAmmo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Weapon_Throw_CycleAmmo_C")
	}
	static class UGA_Weapon_Throw_CycleAmmo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Weapon_Throw_CycleAmmo_C>();
	}
};

}

