#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Weapon_Fire_Auto

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWGameCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Weapon_Fire_Auto.GA_Weapon_Fire_Auto_C
// 0x0028 (0x03E0 - 0x03B8)
class UGA_Weapon_Fire_Auto_C final : public UFWGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWWeaponUserComponent*                 WeaponComponent;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFWWeaponBase*                          CurrentWeapon;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponDefinition*                    CurrentWeaponDefinition;                           // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalController;                                 // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAbilityEnded;                                     // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Onest_person_extreme_angle_check(bool* Allow_Anim_);
	void Check_if_Ability_Allowed(bool* Allow_Ability_);
	void ExecuteUbergraph_GA_Weapon_Fire_Auto(int32 EntryPoint);
	void FireRepeat();
	class UFWWeaponUserComponent* GetWeaponComponent();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_A3C7182A4B016B1E0D141DB7BB7908D7();
	void OnCancelled_A3C7182A4B016B1E0D141DB7BB7908D7();
	void OnCompleted_A3C7182A4B016B1E0D141DB7BB7908D7();
	void OnInterrupted_A3C7182A4B016B1E0D141DB7BB7908D7();
	void Report_Weapon_Down();
	void Revert_Speed_Mod_on_Weapon();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Weapon_Fire_Auto_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Weapon_Fire_Auto_C")
	}
	static class UGA_Weapon_Fire_Auto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Weapon_Fire_Auto_C>();
	}
};

}

