#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Weapon_ADS_GunHead

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Weapon_ADS_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Weapon_ADS_GunHead.GA_Weapon_ADS_GunHead_C
// 0x0028 (0x0428 - 0x0400)
class UGA_Weapon_ADS_GunHead_C final : public UGA_Weapon_ADS_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Weapon_ADS_GunHead_C;            // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFWGamePlayerCharacter*                 My_Character;                                      // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Gunhead_Set_OverTheShoulder;                       // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           reloadCheckTimer;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Gunhead_ADS_safety_timer;                          // 0x0420(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckForReload();
	void ExecuteUbergraph_GA_Weapon_ADS_GunHead(int32 EntryPoint);
	void Gunhead_ADS_safety();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Weapon_ADS_GunHead_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Weapon_ADS_GunHead_C")
	}
	static class UGA_Weapon_ADS_GunHead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Weapon_ADS_GunHead_C>();
	}
};

}

