#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Weapon_ADS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWGameCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Weapon_ADS.GA_Weapon_ADS_C
// 0x0048 (0x0400 - 0x03B8)
class UGA_Weapon_ADS_C : public UFWGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PreviousMaxSpeed;                                  // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFWCharacter*                           FWCharacter;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWWeaponBase*                          CurrentWeapon;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFWPlayerCameraManager*                 FWPlayerCameraManager;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Updated_Player_Speed;                              // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ADS_Backup_Timer;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWWeaponUserComponent*                 Player_s_Weapon_User_Component;                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Inventory_Open_;                                   // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Set_Player_Rotation_ADS(bool In_ADS_);
	void _Set_Current_Weapon(bool* Success_);
	void Backup_Check_for_ADS();
	void GetFWPlayerCameraManager(class AFWPlayerCameraManager** RetVal);
	void GetFWCharacter(class AFWCharacter** RetVal);
	void ResetPlayerSpeedADS();
	void SetPlayerSpeedADS();
	void GetWeaponComponent(class UFWWeaponUserComponent** RetVal, bool* InventoryOpen_);
	void GetChararcterMovementComponent(class UCharacterMovementComponent** RetVal);
	void GetPlayerCharacter(class AFWGamePlayerCharacter** RetVal);
	void OnRelease_87DF8B874AD58B74444AB59048C5C4BC(float TimeHeld);
	void ExecuteUbergraph_GA_Weapon_ADS(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Weapon_ADS_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Weapon_ADS_C")
	}
	static class UGA_Weapon_ADS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Weapon_ADS_C>();
	}
};

}

