#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameplayCameras.CameraInstantiableObject
// 0x0000 (0x0028 - 0x0028)
class UCameraInstantiableObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraInstantiableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraInstantiableObject")
	}
	static class UCameraInstantiableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraInstantiableObject>();
	}
};

// Class GameplayCameras.LegacyCameraShake
// 0x0110 (0x01F0 - 0x00E0)
class ULegacyCameraShake : public UCameraShakeBase
{
public:
	float                                         OscillationDuration;                               // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscillationBlendInTime;                            // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscillationBlendOutTime;                           // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FROscillator                           RotOscillation;                                    // 0x00E4(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVOscillator                           LocOscillation;                                    // 0x0108(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFOscillator                           FOVOscillation;                                    // 0x012C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AnimPlayRate;                                      // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimScale;                                         // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBlendInTime;                                   // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBlendOutTime;                                  // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomAnimSegmentDuration;                         // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationSequence*               AnimSequence;                                      // 0x0150(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRandomAnimSegment : 1;                            // 0x0158(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OscillatorTimeRemaining;                           // 0x015C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_160[0x78];                                     // 0x0160(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class USequenceCameraShakePattern*            SequenceShakePattern;                              // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x10];                                     // 0x01E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULegacyCameraShake* StartLegacyCameraShake(class APlayerCameraManager* PlayerCameraManager, TSubclassOf<class ULegacyCameraShake> ShakeClass, float Scale, ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot);
	static class ULegacyCameraShake* StartLegacyCameraShakeFromSource(class APlayerCameraManager* PlayerCameraManager, TSubclassOf<class ULegacyCameraShake> ShakeClass, class UCameraShakeSourceComponent* SourceComponent, float Scale, ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot);

	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, const struct FMinimalViewInfo& POV, struct FMinimalViewInfo* ModifiedPOV);
	void ReceivePlayShake(float Scale);
	void ReceiveStopShake(bool bImmediately);

	bool ReceiveIsFinished() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LegacyCameraShake")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LegacyCameraShake")
	}
	static class ULegacyCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShake>();
	}
};

// Class GameplayCameras.LegacyCameraShakePattern
// 0x0000 (0x0028 - 0x0028)
class ULegacyCameraShakePattern final : public UCameraShakePattern
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LegacyCameraShakePattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LegacyCameraShakePattern")
	}
	static class ULegacyCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShakePattern>();
	}
};

// Class GameplayCameras.LegacyCameraShakeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class ULegacyCameraShakeFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ULegacyCameraShake* Conv_LegacyCameraShake(class UCameraShakeBase* CameraShake);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LegacyCameraShakeFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LegacyCameraShakeFunctionLibrary")
	}
	static class ULegacyCameraShakeFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShakeFunctionLibrary>();
	}
};

// Class GameplayCameras.CameraAnimationCameraModifier
// 0x0018 (0x0060 - 0x0048)
class UCameraAnimationCameraModifier final : public UCameraModifier
{
public:
	TArray<struct FActiveCameraAnimationInfo>     ActiveAnimations;                                  // 0x0048(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint16                                        NextInstanceSerialNumber;                          // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifier(const class UObject* WorldContextObject, int32 PlayerIndex);
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifierFromID(const class UObject* WorldContextObject, int32 ControllerId);
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifierFromPlayerController(const class APlayerController* PlayerController);

	struct FCameraAnimationHandle PlayCameraAnimation(class UCameraAnimationSequence* Sequence, const struct FCameraAnimationParams& Params_0);
	void StopAllCameraAnimations(bool bImmediate);
	void StopAllCameraAnimationsOf(class UCameraAnimationSequence* Sequence, bool bImmediate);
	void StopCameraAnimation(const struct FCameraAnimationHandle& Handle, bool bImmediate);

	bool IsCameraAnimationActive(const struct FCameraAnimationHandle& Handle) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraAnimationCameraModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraAnimationCameraModifier")
	}
	static class UCameraAnimationCameraModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAnimationCameraModifier>();
	}
};

// Class GameplayCameras.GameplayCamerasFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameplayCamerasFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UCameraAnimationCameraModifier* Conv_CameraAnimationCameraModifier(class APlayerCameraManager* PlayerCameraManager);
	static ECameraAnimationPlaySpace Conv_CameraAnimationPlaySpace(ECameraShakePlaySpace CameraShakePlaySpace);
	static ECameraShakePlaySpace Conv_CameraShakePlaySpace(ECameraAnimationPlaySpace CameraAnimationPlaySpace);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCamerasFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCamerasFunctionLibrary")
	}
	static class UGameplayCamerasFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCamerasFunctionLibrary>();
	}
};

// Class GameplayCameras.CameraNode
// 0x0008 (0x0030 - 0x0028)
class UCameraNode : public UCameraInstantiableObject
{
public:
	bool                                          bIsEnabled;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraNode")
	}
	static class UCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNode>();
	}
};

// Class GameplayCameras.BlendCameraNode
// 0x0000 (0x0030 - 0x0030)
class UBlendCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendCameraNode")
	}
	static class UBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendCameraNode>();
	}
};

// Class GameplayCameras.BlendStackCameraNode
// 0x0018 (0x0048 - 0x0030)
class UBlendStackCameraNode final : public UCameraNode
{
public:
	bool                                          bAutoPop;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendFirstCameraMode;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x16];                                      // 0x0032(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendStackCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendStackCameraNode")
	}
	static class UBlendStackCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraNode>();
	}
};

// Class GameplayCameras.BlendStackRootCameraNode
// 0x0020 (0x0050 - 0x0030)
class UBlendStackRootCameraNode final : public UCameraNode
{
public:
	class UBlendCameraNode*                       Blend;                                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraNode*                            RootNode;                                          // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendStackRootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendStackRootCameraNode")
	}
	static class UBlendStackRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackRootCameraNode>();
	}
};

// Class GameplayCameras.CameraAsset
// 0x0028 (0x0050 - 0x0028)
class UCameraAsset final : public UObject
{
public:
	class UCameraDirector*                        CameraDirector;                                    // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCameraModeTransition>          EnterTransitions;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FCameraModeTransition>          ExitTransitions;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraAsset")
	}
	static class UCameraAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAsset>();
	}
};

// Class GameplayCameras.CameraDirector
// 0x0000 (0x0028 - 0x0028)
class UCameraDirector : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraDirector")
	}
	static class UCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirector>();
	}
};

// Class GameplayCameras.CameraEvaluationContext
// 0x0080 (0x00A8 - 0x0028)
class UCameraEvaluationContext : public UObject
{
public:
	class UCameraAsset*                           CameraAsset;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraEvaluationContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraEvaluationContext")
	}
	static class UCameraEvaluationContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraEvaluationContext>();
	}
};

// Class GameplayCameras.CameraMode
// 0x0028 (0x0050 - 0x0028)
class UCameraMode final : public UObject
{
public:
	class UCameraNode*                            RootNode;                                          // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCameraModeTransition>          EnterTransitions;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FCameraModeTransition>          ExitTransitions;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraMode")
	}
	static class UCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraMode>();
	}
};

// Class GameplayCameras.CameraModeTransitionCondition
// 0x0000 (0x0028 - 0x0028)
class UCameraModeTransitionCondition final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraModeTransitionCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraModeTransitionCondition")
	}
	static class UCameraModeTransitionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModeTransitionCondition>();
	}
};

// Class GameplayCameras.CameraSystemEvaluator
// 0x0160 (0x0188 - 0x0028)
class UCameraSystemEvaluator final : public UObject
{
public:
	class URootCameraNode*                        RootNode;                                          // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x158];                                     // 0x0030(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraSystemEvaluator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraSystemEvaluator")
	}
	static class UCameraSystemEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraSystemEvaluator>();
	}
};

// Class GameplayCameras.RootCameraNode
// 0x0000 (0x0030 - 0x0030)
class URootCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RootCameraNode")
	}
	static class URootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootCameraNode>();
	}
};

// Class GameplayCameras.DefaultRootCameraNode
// 0x0020 (0x0050 - 0x0030)
class UDefaultRootCameraNode final : public URootCameraNode
{
public:
	class UCameraNode*                            BaseLayer;                                         // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraNode*                            MainLayer;                                         // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraNode*                            GlobalLayer;                                       // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraNode*                            VisualLayer;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultRootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultRootCameraNode")
	}
	static class UDefaultRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultRootCameraNode>();
	}
};

// Class GameplayCameras.SingleCameraDirector
// 0x0008 (0x0030 - 0x0028)
class USingleCameraDirector final : public UCameraDirector
{
public:
	class UCameraMode*                            CameraMode;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleCameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleCameraDirector")
	}
	static class USingleCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleCameraDirector>();
	}
};

// Class GameplayCameras.GameplayCameraActor
// 0x0010 (0x02A0 - 0x0290)
class AGameplayCameraActor final : public AActor
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayCameraComponent*               CameraComponent;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UGameplayCameraComponent* GetCameraComponent() const;
	class USceneComponent* GetSceneComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraActor")
	}
	static class AGameplayCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraActor>();
	}
};

// Class GameplayCameras.GameplayCameraComponent
// 0x0010 (0x0240 - 0x0230)
class UGameplayCameraComponent final : public USceneComponent
{
public:
	class UCameraAsset*                           Camera;                                            // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayCameraComponentEvaluationContext* EvaluationContext;                              // 0x0238(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ActivateCamera(int32 PlayerIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraComponent")
	}
	static class UGameplayCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraComponent>();
	}
};

// Class GameplayCameras.GameplayCameraComponentEvaluationContext
// 0x0000 (0x00A8 - 0x00A8)
class UGameplayCameraComponentEvaluationContext final : public UCameraEvaluationContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraComponentEvaluationContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraComponentEvaluationContext")
	}
	static class UGameplayCameraComponentEvaluationContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraComponentEvaluationContext>();
	}
};

// Class GameplayCameras.GameplayCameraSystemActor
// 0x0010 (0x02A0 - 0x0290)
class AGameplayCameraSystemActor final : public AActor
{
public:
	class UGameplayCameraSystemComponent*         CameraSystemComponent;                             // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAutoReceiveInput                             AutoActivateForPlayer;                             // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateForPlayer(int32 PlayerIndex);

	class UGameplayCameraSystemComponent* GetCameraSystemComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraSystemActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraSystemActor")
	}
	static class AGameplayCameraSystemActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraSystemActor>();
	}
};

// Class GameplayCameras.GameplayCameraSystemComponent
// 0x0010 (0x0240 - 0x0230)
class UGameplayCameraSystemComponent final : public USceneComponent
{
public:
	class UCameraSystemEvaluator*                 Evaluator;                                         // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCameraSystemEvaluator* GetCameraSystemEvaluator();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraSystemComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraSystemComponent")
	}
	static class UGameplayCameraSystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraSystemComponent>();
	}
};

// Class GameplayCameras.GameplayCamerasSubsystem
// 0x0000 (0x0030 - 0x0030)
class UGameplayCamerasSubsystem final : public UWorldSubsystem
{
public:
	struct FCameraAnimationHandle PlayCameraAnimation(class APlayerController* PlayerController, class UCameraAnimationSequence* Sequence, const struct FCameraAnimationParams& Params_0);
	void StopAllCameraAnimations(class APlayerController* PlayerController, bool bImmediate);
	void StopAllCameraAnimationsOf(class APlayerController* PlayerController, class UCameraAnimationSequence* Sequence, bool bImmediate);
	void StopCameraAnimation(class APlayerController* PlayerController, const struct FCameraAnimationHandle& Handle, bool bImmediate);

	bool IsCameraAnimationActive(class APlayerController* PlayerController, const struct FCameraAnimationHandle& Handle) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCamerasSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCamerasSubsystem")
	}
	static class UGameplayCamerasSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCamerasSubsystem>();
	}
};

// Class GameplayCameras.SimpleBlendCameraNode
// 0x0008 (0x0038 - 0x0030)
class USimpleBlendCameraNode : public UBlendCameraNode
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleBlendCameraNode")
	}
	static class USimpleBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleBlendCameraNode>();
	}
};

// Class GameplayCameras.SimpleFixedTimeBlendCameraNode
// 0x0008 (0x0040 - 0x0038)
class USimpleFixedTimeBlendCameraNode : public USimpleBlendCameraNode
{
public:
	float                                         BlendTime;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleFixedTimeBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleFixedTimeBlendCameraNode")
	}
	static class USimpleFixedTimeBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleFixedTimeBlendCameraNode>();
	}
};

// Class GameplayCameras.LinearBlendCameraNode
// 0x0000 (0x0040 - 0x0040)
class ULinearBlendCameraNode final : public USimpleFixedTimeBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LinearBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LinearBlendCameraNode")
	}
	static class ULinearBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinearBlendCameraNode>();
	}
};

// Class GameplayCameras.PopBlendCameraNode
// 0x0000 (0x0030 - 0x0030)
class UPopBlendCameraNode final : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PopBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PopBlendCameraNode")
	}
	static class UPopBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopBlendCameraNode>();
	}
};

// Class GameplayCameras.SmoothBlendCameraNode
// 0x0008 (0x0048 - 0x0040)
class USmoothBlendCameraNode final : public USimpleFixedTimeBlendCameraNode
{
public:
	ESmoothCameraBlendType                        BlendType;                                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmoothBlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmoothBlendCameraNode")
	}
	static class USmoothBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmoothBlendCameraNode>();
	}
};

// Class GameplayCameras.ArrayCameraNode
// 0x0010 (0x0040 - 0x0030)
class UArrayCameraNode final : public UCameraNode
{
public:
	TArray<class UCameraNode*>                    Children;                                          // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArrayCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArrayCameraNode")
	}
	static class UArrayCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArrayCameraNode>();
	}
};

// Class GameplayCameras.OffsetCameraNode
// 0x0018 (0x0048 - 0x0030)
class UOffsetCameraNode final : public UCameraNode
{
public:
	struct FVector3d                              Offset;                                            // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OffsetCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OffsetCameraNode")
	}
	static class UOffsetCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetCameraNode>();
	}
};

// Class GameplayCameras.CompositeCameraShakePattern
// 0x0010 (0x0038 - 0x0028)
class UCompositeCameraShakePattern final : public UCameraShakePattern
{
public:
	TArray<class UCameraShakePattern*>            ChildPatterns;                                     // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CompositeCameraShakePattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CompositeCameraShakePattern")
	}
	static class UCompositeCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeCameraShakePattern>();
	}
};

// Class GameplayCameras.DefaultCameraShakeBase
// 0x0000 (0x00E0 - 0x00E0)
class UDefaultCameraShakeBase final : public UCameraShakeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultCameraShakeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultCameraShakeBase")
	}
	static class UDefaultCameraShakeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultCameraShakeBase>();
	}
};

// Class GameplayCameras.SimpleCameraShakePattern
// 0x0030 (0x0058 - 0x0028)
class USimpleCameraShakePattern : public UCameraShakePattern
{
public:
	float                                         duration;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x24];                                      // 0x0034(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleCameraShakePattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleCameraShakePattern")
	}
	static class USimpleCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleCameraShakePattern>();
	}
};

// Class GameplayCameras.PerlinNoiseCameraShakePattern
// 0x0080 (0x00D8 - 0x0058)
class UPerlinNoiseCameraShakePattern final : public USimpleCameraShakePattern
{
public:
	float                                         LocationAmplitudeMultiplier;                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationFrequencyMultiplier;                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     X;                                                 // 0x0060(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Y;                                                 // 0x0068(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Z;                                                 // 0x0070(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RotationAmplitudeMultiplier;                       // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationFrequencyMultiplier;                       // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     pitch;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Yaw;                                               // 0x0088(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Roll;                                              // 0x0090(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     FOV;                                               // 0x0098(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x38];                                      // 0x00A0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PerlinNoiseCameraShakePattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PerlinNoiseCameraShakePattern")
	}
	static class UPerlinNoiseCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerlinNoiseCameraShakePattern>();
	}
};

// Class GameplayCameras.WaveOscillatorCameraShakePattern
// 0x00A0 (0x00F8 - 0x0058)
class UWaveOscillatorCameraShakePattern final : public USimpleCameraShakePattern
{
public:
	float                                         LocationAmplitudeMultiplier;                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationFrequencyMultiplier;                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        X;                                                 // 0x0060(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Y;                                                 // 0x006C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Z;                                                 // 0x0078(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RotationAmplitudeMultiplier;                       // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationFrequencyMultiplier;                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        pitch;                                             // 0x008C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Yaw;                                               // 0x0098(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Roll;                                              // 0x00A4(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        FOV;                                               // 0x00B0(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x3C];                                      // 0x00BC(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaveOscillatorCameraShakePattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaveOscillatorCameraShakePattern")
	}
	static class UWaveOscillatorCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaveOscillatorCameraShakePattern>();
	}
};

// Class GameplayCameras.TestCameraShake
// 0x0000 (0x00E0 - 0x00E0)
class UTestCameraShake final : public UCameraShakeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestCameraShake")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestCameraShake")
	}
	static class UTestCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestCameraShake>();
	}
};

// Class GameplayCameras.ConstantCameraShakePattern
// 0x0030 (0x0088 - 0x0058)
class UConstantCameraShakePattern final : public USimpleCameraShakePattern
{
public:
	struct FVector                                LocationOffset;                                    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConstantCameraShakePattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConstantCameraShakePattern")
	}
	static class UConstantCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConstantCameraShakePattern>();
	}
};

}

