#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryCollectionNodes

#include "Basic.hpp"

#include "DataflowCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FractureEngine_structs.hpp"
#include "Chaos_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"


namespace SDK
{

// Enum GeometryCollectionNodes.EFloatArrayToIntArrayFunctionEnum
// NumValues: 0x0007
enum class EFloatArrayToIntArrayFunctionEnum : uint8
{
	Dataflow_FloatToInt_Function_Floor       = 0,
	Dataflow_FloatToInt_Function_Ceil        = 1,
	Dataflow_FloatToInt_Function_Round       = 2,
	Dataflow_FloatToInt_Function_Truncate    = 3,
	Dataflow_FloatToInt_NonZeroToIndex       = 4,
	Dataflow_FloatToInt_ZeroToIndex          = 5,
	Dataflow_Max                             = 6,
};

// Enum GeometryCollectionNodes.ECompareOperation1Enum
// NumValues: 0x0006
enum class ECompareOperation1Enum : uint8
{
	Dataflow_Compare_Equal                   = 0,
	Dataflow_Compare_Smaller                 = 1,
	Dataflow_Compare_SmallerOrEqual          = 2,
	Dataflow_Compare_Greater                 = 3,
	Dataflow_Compare_GreaterOrEqual          = 4,
	Dataflow_Max                             = 5,
};

// Enum GeometryCollectionNodes.EStatisticsOperationEnum
// NumValues: 0x0007
enum class EStatisticsOperationEnum : uint8
{
	Dataflow_EStatisticsOperationEnum_Min    = 0,
	Dataflow_EStatisticsOperationEnum_Max    = 1,
	Dataflow_EStatisticsOperationEnum_Mean   = 2,
	Dataflow_EStatisticsOperationEnum_Median = 3,
	Dataflow_EStatisticsOperationEnum_Mode   = 4,
	Dataflow_EStatisticsOperationEnum_Sum    = 5,
	Dataflow_Max                             = 6,
};

// Enum GeometryCollectionNodes.EDataflowFieldFalloffType
// NumValues: 0x0006
enum class EDataflowFieldFalloffType : uint8
{
	Dataflow_FieldFalloffType_None           = 0,
	Dataflow_FieldFalloffType_Linear         = 1,
	Dataflow_FieldFalloffType_Inverse        = 2,
	Dataflow_FieldFalloffType_Squared        = 3,
	Dataflow_FieldFalloffType_Logarithmic    = 4,
	Dataflow_Max                             = 5,
};

// Enum GeometryCollectionNodes.EDataflowSetMaskConditionType
// NumValues: 0x0004
enum class EDataflowSetMaskConditionType : uint8
{
	Dataflow_SetMaskConditionType_Always     = 0,
	Dataflow_SetMaskConditionType_IFF_NOT_Interior = 1,
	Dataflow_SetMaskConditionType_IFF_NOT_Exterior = 2,
	Dataflow_Max                             = 3,
};

// Enum GeometryCollectionNodes.EDataflowWaveFunctionType
// NumValues: 0x0005
enum class EDataflowWaveFunctionType : uint8
{
	Dataflow_WaveFunctionType_Cosine         = 0,
	Dataflow_WaveFunctionType_Gaussian       = 1,
	Dataflow_WaveFunctionType_Falloff        = 2,
	Dataflow_WaveFunctionType_Decay          = 3,
	Dataflow_Max                             = 4,
};

// Enum GeometryCollectionNodes.EDataflowFloatFieldOperationType
// NumValues: 0x0007
enum class EDataflowFloatFieldOperationType : uint8
{
	Dataflow_FloatFieldOperationType_Multiply = 0,
	Dataflow_FloatFieldFalloffType_Divide    = 1,
	Dataflow_FloatFieldFalloffType_Add       = 2,
	Dataflow_FloatFieldFalloffType_Substract = 3,
	Dataflow_FloatFieldFalloffType_Min       = 4,
	Dataflow_FloatFieldFalloffType_Max       = 5,
	Dataflow_Max                             = 6,
};

// Enum GeometryCollectionNodes.EDataflowVectorFieldOperationType
// NumValues: 0x0006
enum class EDataflowVectorFieldOperationType : uint8
{
	Dataflow_VectorFieldOperationType_Multiply = 0,
	Dataflow_VectorFieldFalloffType_Divide   = 1,
	Dataflow_VectorFieldFalloffType_Add      = 2,
	Dataflow_VectorFieldFalloffType_Substract = 3,
	Dataflow_VectorFieldFalloffType_CrossProduct = 4,
	Dataflow_Max                             = 5,
};

// Enum GeometryCollectionNodes.ESetMaterialOperationTypeEnum
// NumValues: 0x0003
enum class ESetMaterialOperationTypeEnum : uint8
{
	Dataflow_SetMaterialOperationType_Add    = 0,
	Dataflow_SetMaterialOperationType_Insert = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.EConvexOverlapRemovalMethodEnum
// NumValues: 0x0005
enum class EConvexOverlapRemovalMethodEnum : uint8
{
	Dataflow_EConvexOverlapRemovalMethod_None = 0,
	Dataflow_EConvexOverlapRemovalMethod_All = 1,
	Dataflow_EConvexOverlapRemovalMethod_OnlyClusters = 2,
	Dataflow_EConvexOverlapRemovalMethod_OnlyClustersVsClusters = 3,
	Dataflow_Max                             = 4,
};

// Enum GeometryCollectionNodes.ENegativeSpaceSampleMethodDataflowEnum
// NumValues: 0x0003
enum class ENegativeSpaceSampleMethodDataflowEnum : uint8
{
	Uniform                                  = 0,
	VoxelSearch                              = 1,
	ENegativeSpaceSampleMethodDataflowEnum_MAX = 2,
};

// Enum GeometryCollectionNodes.EClusterSizeMethodEnum
// NumValues: 0x0005
enum class EClusterSizeMethodEnum : uint8
{
	Dataflow_ClusterSizeMethod_ByNumber      = 0,
	Dataflow_ClusterSizeMethod_ByFractionOfInput = 1,
	Dataflow_ClusterSizeMethod_BySize        = 2,
	Dataflow_ClusterSizeMethod_ByGrid        = 3,
	Dataflow_Max                             = 4,
};

// Enum GeometryCollectionNodes.EClusterNeighborSelectionMethodEnum
// NumValues: 0x0003
enum class EClusterNeighborSelectionMethodEnum : uint8
{
	Dataflow_ClusterNeighborSelectionMethod_LargestNeighbor = 0,
	Dataflow_ClusterNeighborSelectionMethod_NearestCenter = 1,
	Dataflow_ClusterNeighborSelectionMethod_MAX = 2,
};

// Enum GeometryCollectionNodes.EFloatToIntFunctionEnum
// NumValues: 0x0005
enum class EFloatToIntFunctionEnum : uint8
{
	Dataflow_FloatToInt_Function_Floor       = 0,
	Dataflow_FloatToInt_Function_Ceil        = 1,
	Dataflow_FloatToInt_Function_Round       = 2,
	Dataflow_FloatToInt_Function_Truncate    = 3,
	Dataflow_Max                             = 4,
};

// Enum GeometryCollectionNodes.EVisibiltyOptionsEnum
// NumValues: 0x0003
enum class EVisibiltyOptionsEnum : uint8
{
	Dataflow_VisibilityOptions_Visible       = 0,
	Dataflow_VisibilityOptions_Invisible     = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.EMakeBoxDataTypeEnum
// NumValues: 0x0003
enum class EMakeBoxDataTypeEnum : uint8
{
	Dataflow_MakeBox_DataType_MinMax         = 0,
	Dataflow_MakeBox_DataType_CenterSize     = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.EMathConstantsEnum
// NumValues: 0x000F
enum class EMathConstantsEnum : uint8
{
	Dataflow_MathConstants_Pi                = 0,
	Dataflow_MathConstants_HalfPi            = 1,
	Dataflow_MathConstants_TwoPi             = 2,
	Dataflow_MathConstants_FourPi            = 3,
	Dataflow_MathConstants_InvPi             = 4,
	Dataflow_MathConstants_InvTwoPi          = 5,
	Dataflow_MathConstants_Sqrt2             = 6,
	Dataflow_MathConstants_InvSqrt2          = 7,
	Dataflow_MathConstants_Sqrt3             = 8,
	Dataflow_MathConstants_InvSqrt3          = 9,
	Dataflow_FloatToInt_Function_E           = 10,
	Dataflow_FloatToInt_Function_Gamma       = 11,
	Dataflow_FloatToInt_Function_GoldenRatio = 12,
	Dataflow_FloatToInt_Function_ZeroTolerance = 13,
	Dataflow_Max                             = 14,
};

// Enum GeometryCollectionNodes.EMeshBooleanOperationEnum
// NumValues: 0x0004
enum class EMeshBooleanOperationEnum : uint8
{
	Dataflow_MeshBoolean_Union               = 0,
	Dataflow_MeshBoolean_Intersect           = 1,
	Dataflow_MeshBoolean_Difference          = 2,
	Dataflow_Max                             = 3,
};

// Enum GeometryCollectionNodes.EBoxLengthMeasurementMethod
// NumValues: 0x0007
enum class EBoxLengthMeasurementMethod : uint8
{
	XAxis                                    = 0,
	YAxis                                    = 1,
	ZAxis                                    = 2,
	ShortestAxis                             = 3,
	LongestAxis                              = 4,
	Diagonal                                 = 5,
	EBoxLengthMeasurementMethod_MAX          = 6,
};

// Enum GeometryCollectionNodes.ERotationOrderEnum
// NumValues: 0x0007
enum class ERotationOrderEnum : uint8
{
	Dataflow_RotationOrder_XYZ               = 0,
	Dataflow_RotationOrder_YZX               = 1,
	Dataflow_RotationOrder_ZXY               = 2,
	Dataflow_RotationOrder_XZY               = 3,
	Dataflow_RotationOrder_YXZ               = 4,
	Dataflow_RotationOrder_ZYX               = 5,
	Dataflow_Max                             = 6,
};

// Enum GeometryCollectionNodes.ECompareOperationEnum
// NumValues: 0x0006
enum class ECompareOperationEnum : uint8
{
	Dataflow_Compare_Equal                   = 0,
	Dataflow_Compare_Smaller                 = 1,
	Dataflow_Compare_SmallerOrEqual          = 2,
	Dataflow_Compare_Greater                 = 3,
	Dataflow_Compare_GreaterOrEqual          = 4,
	Dataflow_Max                             = 5,
};

// Enum GeometryCollectionNodes.EAnchorStateEnum
// NumValues: 0x0003
enum class EAnchorStateEnum : uint8
{
	Dataflow_AnchorState_Anchored            = 0,
	Dataflow_AnchorState_NotAnchored         = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.EProximityMethodEnum
// NumValues: 0x0003
enum class EProximityMethodEnum : uint8
{
	Dataflow_ProximityMethod_Precise         = 0,
	Dataflow_ProximityMethod_ConvexHull      = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.EProximityContactFilteringMethodEnum
// NumValues: 0x0004
enum class EProximityContactFilteringMethodEnum : uint8
{
	Dataflow_ProximityContactFilteringMethod_ProjectedBoundsOverlap = 0,
	Dataflow_ProximityContactFilteringMethod_ConvexHullSharp = 1,
	Dataflow_ProximityContactFilteringMethod_ConvexHullArea = 2,
	Dataflow_Max                             = 3,
};

// Enum GeometryCollectionNodes.EConnectionContactAreaMethodEnum
// NumValues: 0x0003
enum class EConnectionContactAreaMethodEnum : uint8
{
	Dataflow_ConnectionContactAreaMethod_None = 0,
	Dataflow_ProximityContactFilteringMethod_ConvexHullArea = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.EStandardGroupNameEnum
// NumValues: 0x0008
enum class EStandardGroupNameEnum : uint8
{
	Dataflow_EStandardGroupNameEnum_Transform = 0,
	Dataflow_EStandardGroupNameEnum_Geometry = 1,
	Dataflow_EStandardGroupNameEnum_Faces    = 2,
	Dataflow_EStandardGroupNameEnum_Vertices = 3,
	Dataflow_EStandardGroupNameEnum_Material = 4,
	Dataflow_EStandardGroupNameEnum_Breaking = 5,
	Dataflow_EStandardGroupNameEnum_Custom   = 6,
	Dataflow_Max                             = 7,
};

// Enum GeometryCollectionNodes.ECustomAttributeTypeEnum
// NumValues: 0x0019
enum class ECustomAttributeTypeEnum : uint8
{
	Dataflow_CustomAttributeType_UInt8       = 0,
	Dataflow_CustomAttributeType_Int32       = 1,
	Dataflow_CustomAttributeType_Float       = 2,
	Dataflow_CustomAttributeType_Double      = 3,
	Dataflow_CustomAttributeType_Bool        = 4,
	Dataflow_CustomAttributeType_String      = 5,
	Dataflow_CustomAttributeType_Vector2f    = 6,
	Dataflow_CustomAttributeType_Vector3f    = 7,
	Dataflow_CustomAttributeType_Vector3d    = 8,
	Dataflow_CustomAttributeType_Vector4f    = 9,
	Dataflow_CustomAttributeType_LinearColor = 10,
	Dataflow_CustomAttributeType_Transform   = 11,
	Dataflow_CustomAttributeType_Quat4f      = 12,
	Dataflow_CustomAttributeType_Box         = 13,
	Dataflow_CustomAttributeType_Guid        = 14,
	Dataflow_CustomAttributeType_Int32Set    = 15,
	Dataflow_CustomAttributeType_Int32Array  = 16,
	Dataflow_CustomAttributeType_IntVector   = 17,
	Dataflow_CustomAttributeType_IntVector2  = 18,
	Dataflow_CustomAttributeType_IntVector4  = 19,
	Dataflow_CustomAttributeType_IntVector2Array = 20,
	Dataflow_CustomAttributeType_FloatArray  = 21,
	Dataflow_CustomAttributeType_Vector2fArray = 22,
	Dataflow_CustomAttributeType_FVector3fArray = 23,
	Dataflow_Max                             = 24,
};

// Enum GeometryCollectionNodes.ESetOperationEnum
// NumValues: 0x0005
enum class ESetOperationEnum : uint8
{
	Dataflow_SetOperation_AND                = 0,
	Dataflow_SetOperation_OR                 = 1,
	Dataflow_SetOperation_XOR                = 2,
	Dataflow_SetOperation_Subtract           = 3,
	Dataflow_Max                             = 4,
};

// Enum GeometryCollectionNodes.ERangeSettingEnum
// NumValues: 0x0003
enum class ERangeSettingEnum : uint8
{
	Dataflow_RangeSetting_InsideRange        = 0,
	Dataflow_RangeSetting_OutsideRange       = 1,
	Dataflow_Max                             = 2,
};

// Enum GeometryCollectionNodes.ESelectSubjectTypeEnum
// NumValues: 0x0004
enum class ESelectSubjectTypeEnum : uint8
{
	Dataflow_SelectSubjectType_Vertices      = 0,
	Dataflow_SelectSubjectType_BoundingBox   = 1,
	Dataflow_SelectSubjectType_Centroid      = 2,
	Dataflow_Max                             = 3,
};

// ScriptStruct GeometryCollectionNodes.ClearConvexHullsDataflowNode
// 0x00D0 (0x01B8 - 0x00E8)
struct FClearConvexHullsDataflowNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x00E8(0x00B0)(NativeAccessSpecifierPublic)
	struct FDataflowTransformSelection            TransformSelection;                                // 0x0198(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.GetFloatArrayElementDataflowNode
// 0x0020 (0x0108 - 0x00E8)
struct FGetFloatArrayElementDataflowNode final : public FDataflowNode
{
public:
	int32                                         Index;                                             // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FloatArray;                                        // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.CrossProductDataflowNode
// 0x0048 (0x0130 - 0x00E8)
struct FCrossProductDataflowNode final : public FDataflowNode
{
public:
	struct FVector                                VectorA;                                           // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VectorB;                                           // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.FloatArrayToIntArrayDataflowNode
// 0x0028 (0x0110 - 0x00E8)
struct FFloatArrayToIntArrayDataflowNode final : public FDataflowNode
{
public:
	EFloatArrayToIntArrayFunctionEnum             Function;                                          // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FloatArray;                                        // 0x00F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntArray;                                          // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.GetArrayElementDataflowNode
// 0x0030 (0x0118 - 0x00E8)
struct FGetArrayElementDataflowNode final : public FDataflowNode
{
public:
	int32                                         Index;                                             // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Points;                                            // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.BoxToMeshDataflowNode
// 0x0048 (0x0130 - 0x00E8)
struct FBoxToMeshDataflowNode final : public FDataflowNode
{
public:
	struct FBox                                   Box;                                               // 0x00E8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           Mesh;                                              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriangleCount;                                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.GetNumArrayElementsDataflowNode
// 0x0048 (0x0130 - 0x00E8)
struct FGetNumArrayElementsDataflowNode final : public FDataflowNode
{
public:
	TArray<float>                                 FloatArray;                                        // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntArray;                                          // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Points;                                            // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector3f>                      Vector3fArray;                                     // 0x0118(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumElements;                                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.AutoClusterDataflowNode
// 0x0100 (0x01E8 - 0x00E8)
struct FAutoClusterDataflowNode final : public FDataflowNode
{
public:
	EClusterSizeMethodEnum                        ClusterSizeMethod;                                 // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ClusterSites;                                      // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClusterFraction;                                   // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiteSize;                                          // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClusterGridWidth;                                  // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClusterGridDepth;                                  // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClusterGridHeight;                                 // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DriftIterations;                                   // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumSize;                                       // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferConvexity;                                  // 0x010C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConcavityTolerance;                                // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoCluster;                                       // 0x0114(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnforceSiteParameters;                             // 0x0115(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AvoidIsolated;                                     // 0x0116(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FManagedArrayCollection                Collection;                                        // 0x0118(0x00B0)(NativeAccessSpecifierPublic)
	struct FDataflowTransformSelection            TransformSelection;                                // 0x01C8(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.BoolArrayToFaceSelectionDataflowNode
// 0x0030 (0x0118 - 0x00E8)
struct FBoolArrayToFaceSelectionDataflowNode final : public FDataflowNode
{
public:
	TArray<bool>                                  BoolAttributeData;                                 // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowFaceSelection                 FaceSelection;                                     // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.ClusterMagnetDataflowNode
// 0x00D8 (0x01C0 - 0x00E8)
struct FClusterMagnetDataflowNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x00E8(0x00B0)(NativeAccessSpecifierPublic)
	struct FDataflowTransformSelection            TransformSelection;                                // 0x0198(0x0020)(NativeAccessSpecifierPublic)
	int32                                         Iterations;                                        // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.WrapDataflowNode
// 0x0010 (0x00F8 - 0x00E8)
struct FWrapDataflowNode final : public FDataflowNode
{
public:
	float                                         float_0;                                           // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Min;                                               // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.FloatArrayToVertexSelectionDataflowNode
// 0x0038 (0x0120 - 0x00E8)
struct FFloatArrayToVertexSelectionDataflowNode final : public FDataflowNode
{
public:
	TArray<float>                                 FloatArray;                                        // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ECompareOperation1Enum                        Operation;                                         // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Threshold;                                         // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               VertexSelection;                                   // 0x0100(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.FloatArrayNormalizeDataflowNode
// 0x0048 (0x0130 - 0x00E8)
struct FFloatArrayNormalizeDataflowNode final : public FDataflowNode
{
public:
	TArray<float>                                 InFloatArray;                                      // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               Selection;                                         // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 OutFloatArray;                                     // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.NoiseFieldDataflowNode
// 0x00C8 (0x01B0 - 0x00E8)
struct FNoiseFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0120(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 FieldFloatResult;                                  // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0xC];                                      // 0x01A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.MakeLiteralBoolDataflowNode
// 0x0008 (0x00F0 - 0x00E8)
struct FMakeLiteralBoolDataflowNode final : public FDataflowNode
{
public:
	bool                                          Value;                                             // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bool;                                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.VectorArrayNormalizeDataflowNode
// 0x0048 (0x0130 - 0x00E8)
struct FVectorArrayNormalizeDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector>                        InVectorArray;                                     // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               Selection;                                         // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        OutVectorArray;                                    // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.ClusterMergeToNeighborsDataflowNode
// 0x00E0 (0x01C8 - 0x00E8)
struct FClusterMergeToNeighborsDataflowNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x00E8(0x00B0)(NativeAccessSpecifierPublic)
	struct FDataflowTransformSelection            TransformSelection;                                // 0x0198(0x0020)(NativeAccessSpecifierPublic)
	EClusterNeighborSelectionMethodEnum           NeighborSelectionMethod;                           // 0x01B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinVolumeCubeRoot;                                 // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyToConnected;                                  // 0x01C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlySameParent;                                   // 0x01C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.UnionIntArraysDataflowNode
// 0x0030 (0x0118 - 0x00E8)
struct FUnionIntArraysDataflowNode final : public FDataflowNode
{
public:
	TArray<int32>                                 InArray1;                                          // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 InArray2;                                          // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutArray;                                          // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.RandomUnitVectorInConeDataflowNode
// 0x0040 (0x0128 - 0x00E8)
struct FRandomUnitVectorInConeDataflowNode final : public FDataflowNode
{
public:
	bool                                          bDeterministic;                                    // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RandomSeed;                                        // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ConeDirection;                                     // 0x00F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConeHalfAngle;                                     // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.RemoveFloatArrayElementDataflowNode
// 0x0018 (0x0100 - 0x00E8)
struct FRemoveFloatArrayElementDataflowNode final : public FDataflowNode
{
public:
	int32                                         Index;                                             // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveOrder;                                    // 0x00EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FloatArray;                                        // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.FloatArrayComputeStatisticsDataflowNode
// 0x0048 (0x0130 - 0x00E8)
struct FFloatArrayComputeStatisticsDataflowNode final : public FDataflowNode
{
public:
	TArray<float>                                 FloatArray;                                        // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowTransformSelection            TransformSelection;                                // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	EStatisticsOperationEnum                      OperationName;                                     // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Indices;                                           // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.SumVectorFieldDataflowNode
// 0x0088 (0x0170 - 0x00E8)
struct FSumVectorFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<float>                                 FieldFloat;                                        // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldFloatRemap;                                   // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        FieldVectorLeft;                                   // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemapLeft;                                    // 0x0118(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        FieldVectorRight;                                  // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemapRight;                                   // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowVectorFieldOperationType             Operation;                                         // 0x014C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSwapVectorInputs;                                 // 0x014D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        FieldVectorResult;                                 // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0160(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.AddDataflowNode
// 0x0010 (0x00F8 - 0x00E8)
struct FAddDataflowNode final : public FDataflowNode
{
public:
	float                                         FloatA;                                            // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatB;                                            // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.GeometryCollectionTerminalDataflowNode
// 0x00D0 (0x01B8 - 0x00E8)
struct FGeometryCollectionTerminalDataflowNode final : public FDataflowTerminalNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x00E8(0x00B0)(NativeAccessSpecifierPublic)
	TArray<class UMaterial*>                      Materials;                                         // 0x0198(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionAutoInstanceMesh> InstancedMeshes;                              // 0x01A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.VectorToStringDataflowNode
// 0x0028 (0x0110 - 0x00E8)
struct FVectorToStringDataflowNode final : public FDataflowNode
{
public:
	struct FVector                                Vector;                                            // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String;                                            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.GetGeometryCollectionAssetDataflowNode
// 0x0008 (0x00F0 - 0x00E8)
struct FGetGeometryCollectionAssetDataflowNode final : public FDataflowNode
{
public:
	class UGeometryCollection*                    Asset;                                             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.ArcTan2DataflowNode
// 0x0010 (0x00F8 - 0x00E8)
struct FArcTan2DataflowNode final : public FDataflowNode
{
public:
	float                                         Y;                                                 // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         X;                                                 // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.GetGeometryCollectionSourcesDataflowNode
// 0x0018 (0x0100 - 0x00E8)
struct FGetGeometryCollectionSourcesDataflowNode final : public FDataflowNode
{
public:
	class UGeometryCollection*                    Asset;                                             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionSource>      Sources;                                           // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.CreateGeometryCollectionFromSourcesDataflowNode
// 0x00E0 (0x01C8 - 0x00E8)
struct FCreateGeometryCollectionFromSourcesDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FGeometryCollectionSource>      Sources;                                           // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection;                                        // 0x00F8(0x00B0)(NativeAccessSpecifierPublic)
	TArray<class UMaterial*>                      Materials;                                         // 0x01A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionAutoInstanceMesh> InstancedMeshes;                              // 0x01B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.MaterialsInfoDataflowNode
// 0x0020 (0x0108 - 0x00E8)
struct FMaterialsInfoDataflowNode final : public FDataflowNode
{
public:
	TArray<class UMaterial*>                      Materials;                                         // 0x00E8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class FString                                 String;                                            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.SafeDivideDataflowNode
// 0x0010 (0x00F8 - 0x00E8)
struct FSafeDivideDataflowNode : public FDataflowNode
{
public:
	float                                         FloatA;                                            // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatB;                                            // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.DivideDataflowNode
// 0x0000 (0x00F8 - 0x00F8)
struct FDivideDataflowNode final : public FSafeDivideDataflowNode
{
};

// ScriptStruct GeometryCollectionNodes.StaticMeshToCollectionDataflowNode
// 0x00E0 (0x01C8 - 0x00E8)
struct FStaticMeshToCollectionDataflowNode final : public FDataflowNode
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetInternalFromMaterialIndex;                     // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitComponents;                                  // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FManagedArrayCollection                Collection;                                        // 0x00F8(0x00B0)(NativeAccessSpecifierPublic)
	TArray<class UMaterial*>                      Materials;                                         // 0x01A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionAutoInstanceMesh> InstancedMeshes;                              // 0x01B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.IntToFloatDataflowNode
// 0x0008 (0x00F0 - 0x00E8)
struct FIntToFloatDataflowNode final : public FDataflowNode
{
public:
	int32                                         int_0;                                             // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         float_0;                                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.RadialFalloffFieldDataflowNode
// 0x00C8 (0x01B0 - 0x00E8)
struct FRadialFalloffFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	struct FSphere                                Sphere;                                            // 0x0118(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Translation;                                       // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowFieldFalloffType                     FalloffType;                                       // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x0168(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0178(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               FieldSelectionMask;                                // 0x0188(0x0020)(NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.MeshToCollectionDataflowNode
// 0x00B8 (0x01A0 - 0x00E8)
struct FMeshToCollectionDataflowNode final : public FDataflowNode
{
public:
	class UDynamicMesh*                           Mesh;                                              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection;                                        // 0x00F0(0x00B0)(NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.BoxFalloffFieldDataflowNode
// 0x0128 (0x0210 - 0x00E8)
struct FBoxFalloffFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	struct FBox                                   Box;                                               // 0x0118(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0150(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x01B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowFieldFalloffType                     FalloffType;                                       // 0x01C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x01C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x01D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               FieldSelectionMask;                                // 0x01E8(0x0020)(NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.FieldMakeDenseFloatArrayDataflowNode
// 0x0038 (0x0120 - 0x00E8)
struct FFieldMakeDenseFloatArrayDataflowNode final : public FDataflowNode
{
public:
	TArray<float>                                 FieldFloatInput;                                   // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 FieldFloatResult;                                  // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryCollectionNodes.PlaneFalloffFieldDataflowNode
// 0x00E0 (0x01C8 - 0x00E8)
struct FPlaneFalloffFieldDataflowNode final : public FDataflowNode
{
public:
	TArray<struct FVector3f>                      SamplePositions;                                   // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               SampleIndices;                                     // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0118(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0130(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Translation;                                       // 0x0150(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRange;                                          // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowFieldFalloffType                     FalloffType;                                       // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FieldFloatResult;                                  // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FieldRemap;                                        // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDataflowVertexSelection               FieldSelectionMask;                                // 0x01A0(0x0020)(NativeAccessSpecifierPublic)
	int32                                         NumSamplePositions;                                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryCollectionNodes.MakeMaterialsArrayDataflowNode
// 0x0010 (0x00F8 - 0x00E8)
struct FMakeMaterialsArrayDataflowNode final : public FDataflowNode
{
