#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUB_V6_WP

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HUB_V6_WP.HUB_V6_WP_C
// 0x0128 (0x03C0 - 0x0298)
class AHUB_V6_WP_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMediaPlayer*                           MP_GlitchTitleRed;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MP_SquareCyborg;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MP_CityScan;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_AmmoStation_SC;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bunco_Unlock_Quest_Row;                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_D85ED3013E74D57402_1550926547_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_D8BBC1A5A9021D1702_1934361889_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SideQuest_BluePrintInterface_LordossBayonet_C* BP_SideQuest_BluePrintInterface_LordossBayonet_C_UAID_D85ED3013E74DA7402_1706196191_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_D85ED3013E74D57402_1961409588_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           BP_Usable_C_UAID_D8BBC1A5A902473502_1684486005_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           BP_Usable_C_UAID_D85ED3013E74D97402_1452856914_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_D8BBC1A5A90222AC02_2060606202_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           BP_Usable_C_UAID_D8BBC1A5A90229AC02_1719825434_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_50EBF6D32CE35E1402_1480476162_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_D8BBC1A5A902E7AB02_2050390818_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_D8BBC1A5A902E7AB02_2060244819_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_7085C2D62A89F4D101_1898705119_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_30D042EF2BB757ED01_1682368745_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_30D042EF2BB75EED01_1709762977_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_30D042EF2BB761ED01_1455231506_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_30D042EF2BB761ED01_1455236507_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       StaticMeshActor_UAID_04421A8D352E65ED01_1106395337_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerStart_C*                      BP_PlayerStart_C_UAID_D8BBC1A5A902DEB101_1283519146_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerStart_C*                      BP_PlayerStart_C_UAID_D8BBC1A5A902DEB101_1281810145_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerStart_C*                      BP_PlayerStart_C_UAID_D8BBC1A5A902DEB101_1268996144_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerStart_C*                      BP_PlayerStart_C_UAID_D8BBC1A5A902DEB101_1286821147_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           BP_Usable_C_UAID_D8BBC1A5A902C58B02_1680493981_ExecuteUbergraph_HUB_V6_WP_RefProperty; // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       StaticMeshActor_UAID_04421A8D352E4FED01_1954298341_Ammo_Station_SFX_MERGED_RefProperty; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequenceActor_UAID_50EBF6D32CE31E2202_2001335679_Do_we_have_water_guards__MERGED_RefProperty; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             _Show_Water_Guards_MERGED_RefProperty;             // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             _Show_Water_Guards_MERGED_RefProperty_0;           // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     _Show_Water_Guards_MERGED_RefProperty_1;           // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     _Show_Water_Guards_MERGED_RefProperty_2;           // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     _Show_Water_Guards_MERGED_RefProperty_3;           // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    _Show_Water_Guards_MERGED_RefProperty_4;           // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Usable_C*                           BP_Usable_C_UAID_D8BBC1A5A902C58B02_1680493981_Handle_Lift_MERGED_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ALL_HideSittingLordoss();
	void ALL_RemoveBayonet();
	void Ammo_Station_SFX(int32 Open_);
	void Audio_BeginPlay_Multicast();
	void Audio_BeginPlay_Server();
	void BayonetSequenceFinished();
	void BndEvt__HUB_V6_WP_BP_Usable_C_UAID_D85ED3013E74D97402_1452856914_K2Node_ActorBoundEvent_0_IWasUsed__DelegateSignature(class AActor* Player_That_Used_Me, class AActor* Usable);
	void BndEvt__HUB_V6_WP_TriggerBox_UAID_D85ED3013E749A1F02_1970944339_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__HUB_V6_WP_TriggerVolume_UAID_7085C2D62A89F5D101_1899406296_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void Check_LordossState();
	void CheckForLoadingScreen();
	void CLIENTS_Hide_Water_Bots();
	void CLIENTS_Show_Water_Bots();
	void Do_we_have_water_guards_();
	void ExecuteUbergraph_HUB_V6_WP(int32 EntryPoint);
	void Handle_Lift(bool* Lift_is_valid_);
	void _Show_Water_Guards(bool Show_);
	void Hide_all_but_one_LS(class ALevelSequenceActor* Sequence_to_show, bool Loop_Shown_, TArray<class ALevelSequenceActor*>& Sequences_to_hide);
	void InitiateLordossQuestLogic();
	void Is_SPECIFIC_PLAYER_skin_intro_playing_(class AActor* Player, bool* Sequence_Playing_);
	void Lift_Used(class AActor* Player_That_Used_Me, class AActor* Usable);
	void Octo_On_Back_Used(class AActor* Player_That_Used_Me, class AActor* Usable);
	void OnMessageReceived_44C51EAC4A3575964B2AB2801558F10A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_8A93AD0448F34E6ED28C39A04405083D(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_E50CF6A04102444A01CC8EAA45E4F91F(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnMessageReceived_EC4034B74B9C33671A4281967CD6036A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnPlayerLeft_Audio();
	void OnRep_IsBayonetRemoved();
	void PlayerJoined();
	void PlayerJoined_Audio();
	void Ready_61519C6B47044AB09FAC4F9520D3C08A(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void ReceiveBeginPlay();
	void SERVER_Hide_Water_Bots();
	void SERVER_Show_Water_Bots();
	void UnlockBuncoQuests();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HUB_V6_WP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUB_V6_WP_C")
	}
	static class AHUB_V6_WP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHUB_V6_WP_C>();
	}
};

}

