#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interface_MenuManager

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Enum_NavigationAction_structs.hpp"
#include "Struct_NavigationKeyAction_structs.hpp"


namespace SDK::Params
{

// Function Interface_MenuManager.Interface_MenuManager_C.Call_On_TabChanged
// 0x0008 (0x0008 - 0x0000)
struct Interface_MenuManager_C_Call_On_TabChanged final
{
public:
	class UWidget*                                TabReference;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Get_ContentToFit
// 0x0010 (0x0010 - 0x0000)
struct Interface_MenuManager_C_Get_ContentToFit final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildIndex;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Get_FocusedName
// 0x0008 (0x0008 - 0x0000)
struct Interface_MenuManager_C_Get_FocusedName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Get_Navigables
// 0x0010 (0x0010 - 0x0000)
struct Interface_MenuManager_C_Get_Navigables final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Get_NavigationInfo
// 0x0058 (0x0058 - 0x0000)
struct Interface_MenuManager_C_Get_NavigationInfo final
{
public:
	struct FStruct_NavigationKeyAction            ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Get_TabButtons
// 0x0010 (0x0010 - 0x0000)
struct Interface_MenuManager_C_Get_TabButtons final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Get_TabConstructorReference
// 0x0008 (0x0008 - 0x0000)
struct Interface_MenuManager_C_Get_TabConstructorReference final
{
public:
	class UWB_TabMenuConstructor_C*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.IsBeginPlayScreenEnd?
// 0x0001 (0x0001 - 0x0000)
struct Interface_MenuManager_C_IsBeginPlayScreenEnd_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.IsFocusable?
// 0x0001 (0x0001 - 0x0000)
struct Interface_MenuManager_C_IsFocusable_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.IsFocused?
// 0x0001 (0x0001 - 0x0000)
struct Interface_MenuManager_C_IsFocused_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.OnNavigationCalled
// 0x0002 (0x0002 - 0x0000)
struct Interface_MenuManager_C_OnNavigationCalled final
{
public:
	Enum_NavigationAction                         Navigation;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Receive_Pressed_Key
// 0x0020 (0x0020 - 0x0000)
struct Interface_MenuManager_C_Receive_Pressed_Key final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Toggle_Focus
// 0x0001 (0x0001 - 0x0000)
struct Interface_MenuManager_C_Toggle_Focus final
{
public:
	bool                                          Focused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_MenuManager.Interface_MenuManager_C.Toggle_Widget
// 0x0010 (0x0010 - 0x0000)
struct Interface_MenuManager_C_Toggle_Widget final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

