#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interface_UMS_GameInstance

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "Enum_InputMode_structs.hpp"
#include "Enum_MenuHandlerType_structs.hpp"
#include "Enum_WidgetAnimType_structs.hpp"


namespace SDK::Params
{

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Add_MenuToViewport
// 0x0001 (0x0001 - 0x0000)
struct Interface_UMS_GameInstance_C_Add_MenuToViewport final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.AddQuestProfile
// 0x000C (0x000C - 0x0000)
struct Interface_UMS_GameInstance_C_AddQuestProfile final
{
public:
	struct FQuestProfile                          NewQuestProfile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          QuestAdded;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Call_Open_Level
// 0x0028 (0x0028 - 0x0000)
struct Interface_UMS_GameInstance_C_Call_Open_Level final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StreamLevelName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Options;                                           // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Absolute;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Construct_MenuSystem
// 0x0001 (0x0001 - 0x0000)
struct Interface_UMS_GameInstance_C_Construct_MenuSystem final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Display_MenuContent
// 0x0002 (0x0002 - 0x0000)
struct Interface_UMS_GameInstance_C_Display_MenuContent final
{
public:
	Enum_MenuHandlerType                          MenuType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_WidgetAnimType                           AnimationType;                                     // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Get_Master_Widget
// 0x0008 (0x0008 - 0x0000)
struct Interface_UMS_GameInstance_C_Get_Master_Widget final
{
public:
	class UWB_MenuMaster_C*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.GetExtractionTags
// 0x0010 (0x0010 - 0x0000)
struct Interface_UMS_GameInstance_C_GetExtractionTags final
{
public:
	TArray<class FName>                           ExtractionTags;                                    // 0x0000(0x0010)(Parm, OutParm)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.GetLevels
// 0x0010 (0x0010 - 0x0000)
struct Interface_UMS_GameInstance_C_GetLevels final
{
public:
	TArray<class FName>                           Levels;                                            // 0x0000(0x0010)(Parm, OutParm)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.GetMapID
// 0x0008 (0x0008 - 0x0000)
struct Interface_UMS_GameInstance_C_GetMapID final
{
public:
	class FName                                   MapID;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.GetQuestProfiles
// 0x0010 (0x0010 - 0x0000)
struct Interface_UMS_GameInstance_C_GetQuestProfiles final
{
public:
	TArray<struct FQuestProfile>                  QuestProfiles;                                     // 0x0000(0x0010)(Parm, OutParm)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.GetSpawnPointTag
// 0x0008 (0x0008 - 0x0000)
struct Interface_UMS_GameInstance_C_GetSpawnPointTag final
{
public:
	class FName                                   SpawnPointTag;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Load_Save_Game
// 0x0008 (0x0008 - 0x0000)
struct Interface_UMS_GameInstance_C_Load_Save_Game final
{
public:
	class USaveGame_UltimateMenuSystem_C*         SaveGameObjectToLoad;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.RemoveQuestProfile
// 0x0008 (0x0008 - 0x0000)
struct Interface_UMS_GameInstance_C_RemoveQuestProfile final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bQuestRemoved;                                     // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.SetExtractionPoints
// 0x0010 (0x0010 - 0x0000)
struct Interface_UMS_GameInstance_C_SetExtractionPoints final
{
public:
	TArray<class FName>                           ExtractionPoints;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.SetLevel
// 0x001C (0x001C - 0x0000)
struct Interface_UMS_GameInstance_C_SetLevel final
{
public:
	class FName                                   MainLevelName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MapID;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpawnPointMapName;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MapSet;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.SetSpawnPointTag
// 0x0014 (0x0014 - 0x0000)
struct Interface_UMS_GameInstance_C_SetSpawnPointTag final
{
public:
	class FName                                   SpawnPointTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpawnPointMapName;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set;                                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Try_Create_Session
// 0x0018 (0x0018 - 0x0000)
struct Interface_UMS_GameInstance_C_Try_Create_Session final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PublicConnections;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseLAN;                                           // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LevelName;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Try_Join_Session
// 0x0120 (0x0120 - 0x0000)
struct Interface_UMS_GameInstance_C_Try_Join_Session final
{
public:
	struct FBlueprintSessionResult                SessionInfo;                                       // 0x0000(0x0120)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Update_InputMode
// 0x0002 (0x0002 - 0x0000)
struct Interface_UMS_GameInstance_C_Update_InputMode final
{
public:
	Enum_InputMode                                NewInputMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Update_MenuType
// 0x0001 (0x0001 - 0x0000)
struct Interface_UMS_GameInstance_C_Update_MenuType final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Interface_UMS_GameInstance.Interface_UMS_GameInstance_C.Get_Current_MenuType
// 0x0001 (0x0001 - 0x0000)
struct Interface_UMS_GameInstance_C_Get_Current_MenuType final
{
public:
	Enum_MenuHandlerType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

