#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IrisCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "IrisCore_structs.hpp"


namespace SDK
{

// Class IrisCore.DataStream
// 0x0000 (0x0028 - 0x0028)
class UDataStream : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataStream")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataStream")
	}
	static class UDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataStream>();
	}
};

// Class IrisCore.DataStreamDefinitions
// 0x0018 (0x0040 - 0x0028)
class UDataStreamDefinitions final : public UObject
{
public:
	TArray<struct FDataStreamDefinition>          DataStreamDefinitions;                             // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataStreamDefinitions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataStreamDefinitions")
	}
	static class UDataStreamDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataStreamDefinitions>();
	}
};

// Class IrisCore.DataStreamManager
// 0x0008 (0x0030 - 0x0028)
class UDataStreamManager final : public UDataStream
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataStreamManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataStreamManager")
	}
	static class UDataStreamManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataStreamManager>();
	}
};

// Class IrisCore.NetObjectFilterConfig
// 0x0008 (0x0030 - 0x0028)
class UNetObjectFilterConfig : public UObject
{
public:
	ENetFilterType                                FilterType;                                        // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectFilterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectFilterConfig")
	}
	static class UNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFilterConfig>();
	}
};

// Class IrisCore.FilterOutNetObjectFilterConfig
// 0x0000 (0x0030 - 0x0030)
class UFilterOutNetObjectFilterConfig final : public UNetObjectFilterConfig
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FilterOutNetObjectFilterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FilterOutNetObjectFilterConfig")
	}
	static class UFilterOutNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilterOutNetObjectFilterConfig>();
	}
};

// Class IrisCore.NetObjectFilter
// 0x0028 (0x0050 - 0x0028)
class UNetObjectFilter : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectFilter")
	}
	static class UNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFilter>();
	}
};

// Class IrisCore.FilterOutNetObjectFilter
// 0x0000 (0x0050 - 0x0050)
class UFilterOutNetObjectFilter final : public UNetObjectFilter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FilterOutNetObjectFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FilterOutNetObjectFilter")
	}
	static class UFilterOutNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilterOutNetObjectFilter>();
	}
};

// Class IrisCore.IrisObjectReferencePackageMap
// 0x0008 (0x00E8 - 0x00E0)
class UIrisObjectReferencePackageMap final : public UPackageMap
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisObjectReferencePackageMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisObjectReferencePackageMap")
	}
	static class UIrisObjectReferencePackageMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisObjectReferencePackageMap>();
	}
};

// Class IrisCore.NetObjectPrioritizer
// 0x0000 (0x0028 - 0x0028)
class UNetObjectPrioritizer : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectPrioritizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectPrioritizer")
	}
	static class UNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectPrioritizer>();
	}
};

// Class IrisCore.LocationBasedNetObjectPrioritizer
// 0x0038 (0x0060 - 0x0028)
class ULocationBasedNetObjectPrioritizer : public UNetObjectPrioritizer
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocationBasedNetObjectPrioritizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocationBasedNetObjectPrioritizer")
	}
	static class ULocationBasedNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocationBasedNetObjectPrioritizer>();
	}
};

// Class IrisCore.NetBlobHandler
// 0x0010 (0x0038 - 0x0028)
class UNetBlobHandler : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetBlobHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetBlobHandler")
	}
	static class UNetBlobHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetBlobHandler>();
	}
};

// Class IrisCore.NetBlobHandlerDefinitions
// 0x0010 (0x0038 - 0x0028)
class UNetBlobHandlerDefinitions final : public UObject
{
public:
	TArray<struct FNetBlobHandlerDefinition>      NetBlobHandlerDefinitions;                         // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetBlobHandlerDefinitions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetBlobHandlerDefinitions")
	}
	static class UNetBlobHandlerDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetBlobHandlerDefinitions>();
	}
};

// Class IrisCore.NetObjectBlobHandler
// 0x0000 (0x0038 - 0x0038)
class UNetObjectBlobHandler final : public UNetBlobHandler
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectBlobHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectBlobHandler")
	}
	static class UNetObjectBlobHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectBlobHandler>();
	}
};

// Class IrisCore.NetObjectConnectionFilterConfig
// 0x0008 (0x0038 - 0x0030)
class UNetObjectConnectionFilterConfig final : public UNetObjectFilterConfig
{
public:
	uint16                                        MaxObjectCount;                                    // 0x0030(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectConnectionFilterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectConnectionFilterConfig")
	}
	static class UNetObjectConnectionFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectConnectionFilterConfig>();
	}
};

// Class IrisCore.NetObjectConnectionFilter
// 0x0050 (0x00A0 - 0x0050)
class UNetObjectConnectionFilter final : public UNetObjectFilter
{
public:
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectConnectionFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectConnectionFilter")
	}
	static class UNetObjectConnectionFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectConnectionFilter>();
	}
};

// Class IrisCore.NetObjectPrioritizerConfig
// 0x0000 (0x0028 - 0x0028)
class UNetObjectPrioritizerConfig : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectPrioritizerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectPrioritizerConfig")
	}
	static class UNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.NetObjectCountLimiterConfig
// 0x0018 (0x0040 - 0x0028)
class UNetObjectCountLimiterConfig : public UNetObjectPrioritizerConfig
{
public:
	ENetObjectCountLimiterMode                    Mode;                                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxObjectCount;                                    // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OwningConnectionPriority;                          // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOwnedObjectsFastLane;                       // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectCountLimiterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectCountLimiterConfig")
	}
	static class UNetObjectCountLimiterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectCountLimiterConfig>();
	}
};

// Class IrisCore.NetObjectCountLimiter
// 0x0068 (0x0090 - 0x0028)
class UNetObjectCountLimiter final : public UNetObjectPrioritizer
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectCountLimiter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectCountLimiter")
	}
	static class UNetObjectCountLimiter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectCountLimiter>();
	}
};

// Class IrisCore.NetObjectFilterDefinitions
// 0x0010 (0x0038 - 0x0028)
class UNetObjectFilterDefinitions final : public UObject
{
public:
	TArray<struct FNetObjectFilterDefinition>     NetObjectFilterDefinitions;                        // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectFilterDefinitions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectFilterDefinitions")
	}
	static class UNetObjectFilterDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectFilterDefinitions>();
	}
};

// Class IrisCore.NetObjectGridFilterConfig
// 0x0060 (0x0090 - 0x0030)
class UNetObjectGridFilterConfig final : public UNetObjectFilterConfig
{
public:
	uint32                                        ViewPosRelevancyFrameCount;                        // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        DefaultFrameCountBeforeCulling;                    // 0x0034(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CellSizeX;                                         // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSizeY;                                         // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCullDistance;                                   // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultCullDistance;                               // 0x0044(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinPos;                                            // 0x0048(0x0018)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxPos;                                            // 0x0060(0x0018)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseExactCullDistance;                             // 0x0078(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNetObjectGridFilterProfile>    FilterProfiles;                                    // 0x0080(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectGridFilterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectGridFilterConfig")
	}
	static class UNetObjectGridFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridFilterConfig>();
	}
};

// Class IrisCore.NetObjectGridFilter
// 0x00B0 (0x0100 - 0x0050)
class UNetObjectGridFilter : public UNetObjectFilter
{
public:
	uint8                                         Pad_50[0xB0];                                      // 0x0050(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectGridFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectGridFilter")
	}
	static class UNetObjectGridFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridFilter>();
	}
};

// Class IrisCore.NetObjectGridWorldLocFilter
// 0x0008 (0x0108 - 0x0100)
class UNetObjectGridWorldLocFilter final : public UNetObjectGridFilter
{
public:
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectGridWorldLocFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectGridWorldLocFilter")
	}
	static class UNetObjectGridWorldLocFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridWorldLocFilter>();
	}
};

// Class IrisCore.NetObjectGridFragmentLocFilter
// 0x0050 (0x0150 - 0x0100)
class UNetObjectGridFragmentLocFilter final : public UNetObjectGridFilter
{
public:
	uint8                                         Pad_100[0x50];                                     // 0x0100(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectGridFragmentLocFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectGridFragmentLocFilter")
	}
	static class UNetObjectGridFragmentLocFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridFragmentLocFilter>();
	}
};

// Class IrisCore.NetObjectPrioritizerDefinitions
// 0x0010 (0x0038 - 0x0028)
class UNetObjectPrioritizerDefinitions final : public UObject
{
public:
	TArray<struct FNetObjectPrioritizerDefinition> NetObjectPrioritizerDefinitions;                  // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetObjectPrioritizerDefinitions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetObjectPrioritizerDefinitions")
	}
	static class UNetObjectPrioritizerDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectPrioritizerDefinitions>();
	}
};

// Class IrisCore.NetRPCHandler
// 0x0008 (0x0040 - 0x0038)
class UNetRPCHandler final : public UNetBlobHandler
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetRPCHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetRPCHandler")
	}
	static class UNetRPCHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetRPCHandler>();
	}
};

// Class IrisCore.NetTokenDataStream
// 0x0050 (0x0078 - 0x0028)
class UNetTokenDataStream final : public UDataStream
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetTokenDataStream")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetTokenDataStream")
	}
	static class UNetTokenDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetTokenDataStream>();
	}
};

// Class IrisCore.NopNetObjectFilterConfig
// 0x0000 (0x0030 - 0x0030)
class UNopNetObjectFilterConfig final : public UNetObjectFilterConfig
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NopNetObjectFilterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NopNetObjectFilterConfig")
	}
	static class UNopNetObjectFilterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNopNetObjectFilterConfig>();
	}
};

// Class IrisCore.NopNetObjectFilter
// 0x0000 (0x0050 - 0x0050)
class UNopNetObjectFilter final : public UNetObjectFilter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NopNetObjectFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NopNetObjectFilter")
	}
	static class UNopNetObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNopNetObjectFilter>();
	}
};

// Class IrisCore.ReplicationBridge
// 0x00E8 (0x0110 - 0x0028)
class UReplicationBridge : public UObject
{
public:
	uint8                                         Pad_28[0xE8];                                      // 0x0028(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplicationBridge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplicationBridge")
	}
	static class UReplicationBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationBridge>();
	}
};

// Class IrisCore.ObjectReplicationBridge
// 0x0440 (0x0550 - 0x0110)
class UObjectReplicationBridge : public UReplicationBridge
{
public:
	uint8                                         Pad_110[0x440];                                    // 0x0110(0x0440)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectReplicationBridge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectReplicationBridge")
	}
	static class UObjectReplicationBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectReplicationBridge>();
	}
};

// Class IrisCore.ObjectReplicationBridgeConfig
// 0x0088 (0x00B0 - 0x0028)
class UObjectReplicationBridgeConfig final : public UObject
{
public:
	TArray<struct FObjectReplicationBridgePollConfig> PollConfigs;                                   // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicationBridgeFilterConfig> FilterConfigs;                               // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicationBridgePrioritizerConfig> PrioritizerConfigs;                     // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicationBridgeDeltaCompressionConfig> DeltaCompressionConfigs;           // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FObjectReplicatedBridgeCriticalClassConfig> CriticalClassConfigs;                  // 0x0068(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bAllClassesCritical;                               // 0x0078(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FObjectReplicationBridgeTypeStatsConfig> TypeStatsConfigs;                         // 0x0080(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FName                                   DefaultSpatialFilterName;                          // 0x0090(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   RequiredNetDriverChannelClassName;                 // 0x0098(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           CriticalActorClasses;                              // 0x00A0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectReplicationBridgeConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectReplicationBridgeConfig")
	}
	static class UObjectReplicationBridgeConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectReplicationBridgeConfig>();
	}
};

// Class IrisCore.SequentialPartialNetBlobHandlerConfig
// 0x0008 (0x0030 - 0x0028)
class USequentialPartialNetBlobHandlerConfig : public UObject
{
public:
	uint32                                        MaxPartBitCount;                                   // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        MaxPartCount;                                      // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SequentialPartialNetBlobHandlerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SequentialPartialNetBlobHandlerConfig")
	}
	static class USequentialPartialNetBlobHandlerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequentialPartialNetBlobHandlerConfig>();
	}
};

// Class IrisCore.PartialNetObjectAttachmentHandlerConfig
// 0x0010 (0x0040 - 0x0030)
class UPartialNetObjectAttachmentHandlerConfig final : public USequentialPartialNetBlobHandlerConfig
{
public:
	uint32                                        BitCountSplitThreshold;                            // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ClientUnreliableBitCountSplitThreshold;            // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        ServerUnreliableBitCountSplitThreshold;            // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PartialNetObjectAttachmentHandlerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PartialNetObjectAttachmentHandlerConfig")
	}
	static class UPartialNetObjectAttachmentHandlerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartialNetObjectAttachmentHandlerConfig>();
	}
};

// Class IrisCore.SequentialPartialNetBlobHandler
// 0x0010 (0x0048 - 0x0038)
class USequentialPartialNetBlobHandler : public UNetBlobHandler
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SequentialPartialNetBlobHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SequentialPartialNetBlobHandler")
	}
	static class USequentialPartialNetBlobHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequentialPartialNetBlobHandler>();
	}
};

// Class IrisCore.PartialNetObjectAttachmentHandler
// 0x0000 (0x0048 - 0x0048)
class UPartialNetObjectAttachmentHandler final : public USequentialPartialNetBlobHandler
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PartialNetObjectAttachmentHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PartialNetObjectAttachmentHandler")
	}
	static class UPartialNetObjectAttachmentHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartialNetObjectAttachmentHandler>();
	}
};

// Class IrisCore.ReplicationDataStream
// 0x0010 (0x0038 - 0x0028)
class UReplicationDataStream final : public UDataStream
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplicationDataStream")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplicationDataStream")
	}
	static class UReplicationDataStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationDataStream>();
	}
};

// Class IrisCore.ReplicationSystem
// 0x0030 (0x0058 - 0x0028)
class UReplicationSystem final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UReplicationBridge*                     ReplicationBridge;                                 // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplicationSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplicationSystem")
	}
	static class UReplicationSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationSystem>();
	}
};

// Class IrisCore.SphereNetObjectPrioritizerConfig
// 0x0018 (0x0040 - 0x0028)
class USphereNetObjectPrioritizerConfig : public UNetObjectPrioritizerConfig
{
public:
	float                                         InnerRadius;                                       // 0x0028(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterRadius;                                       // 0x002C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerPriority;                                     // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterPriority;                                     // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutsidePriority;                                   // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SphereNetObjectPrioritizerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SphereNetObjectPrioritizerConfig")
	}
	static class USphereNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.SphereNetObjectPrioritizer
// 0x0008 (0x0068 - 0x0060)
class USphereNetObjectPrioritizer : public ULocationBasedNetObjectPrioritizer
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SphereNetObjectPrioritizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SphereNetObjectPrioritizer")
	}
	static class USphereNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereNetObjectPrioritizer>();
	}
};

// Class IrisCore.SphereWithOwnerBoostNetObjectPrioritizerConfig
// 0x0008 (0x0048 - 0x0040)
class USphereWithOwnerBoostNetObjectPrioritizerConfig final : public USphereNetObjectPrioritizerConfig
{
public:
	float                                         OwnerPriorityBoost;                                // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SphereWithOwnerBoostNetObjectPrioritizerConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SphereWithOwnerBoostNetObjectPrioritizerConfig")
	}
	static class USphereWithOwnerBoostNetObjectPrioritizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereWithOwnerBoostNetObjectPrioritizerConfig>();
	}
};

// Class IrisCore.SphereWithOwnerBoostNetObjectPrioritizer
// 0x0038 (0x00A0 - 0x0068)
class USphereWithOwnerBoostNetObjectPrioritizer final : public USphereNetObjectPrioritizer
{
public:
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SphereWithOwnerBoostNetObjectPrioritizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SphereWithOwnerBoostNetObjectPrioritizer")
	}
	static class USphereWithOwnerBoostNetObjectPrioritizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphereWithOwnerBoostNetObjectPrioritizer>();
	}
};

// Class IrisCore.ReplicationStateDescriptorConfig
// 0x0010 (0x0038 - 0x0028)
class UReplicationStateDescriptorConfig final : public UObject
{
public:
	TArray<struct FSupportsStructNetSerializerConfig> SupportsStructNetSerializerList;               // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplicationStateDescriptorConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplicationStateDescriptorConfig")
	}
	static class UReplicationStateDescriptorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplicationStateDescriptorConfig>();
	}
};

}

