#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Manager_QuestTarget

#include "Basic.hpp"

#include "Struct_TargetInteraction_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Manager_QuestTarget.Manager_QuestTarget_C
// 0x0090 (0x0130 - 0x00A0)
class UManager_QuestTarget_C final : public UActorComponent
{
public:
	class ABP_QuestManager_C*                     QuestManager;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UBoxComponent*>                  InteractionBoxes;                                  // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsInteractable;                                    // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetName;                                        // 0x00BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Interaction_Widget_C*               InteractionWidget;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       InteractionWidgetComponent;                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_Manager_Constructed;                            // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class FName OverlappedBoxTag, class APawn* ByPawn)> On_QuestTarget_Interacted; // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsQuestGiver;                                      // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_TargetInteraction>      InteractionZones;                                  // 0x0100(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(class APawn* ByPawn, class FName OverlappedBoxTag)> On_QuestTarget_Begin_Overlap; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class APawn* ByPawn, class FName OverlappedBoxTag)> On_QuestTarget_End_Overlap; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct_Interaction_Widget();
	void Construct_InteractionBox();
	void On_Interaction_Begin_Overlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void On_Interaction_End_Overlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void On_Quest_Target_Destroyed(class AActor* Actor, EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_Interaction_Enabled(class FName Tag, bool Enabled);
	void Toggle_InteractionWidget(bool bNewVisibility);
	void Try_Finish_Objective(class FName ObjectiveTag, class AActor* PlayerPawn, bool* Success);

	struct FStruct_TargetInteraction Get_InteractionZone_By_Tag(class FName Tag) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Manager_QuestTarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Manager_QuestTarget_C")
	}
	static class UManager_QuestTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UManager_QuestTarget_C>();
	}
};

}

