#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuActor

#include "Basic.hpp"

#include "EMapMode_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MenuActor.MenuActor_C
// 0x0040 (0x02D0 - 0x0290)
class AMenuActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_Missions_C*                        MissionsMenuRef;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandler;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_MissionPointButton_C*              HorrorModeButton;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HorrorModeEnabled;                                 // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RegularModeEnabled;                                // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MissionPointButton_C*              RegularModeButton;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMapMode                                      SelectedMode;                                      // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckForMissionsMenu();
	void CreateHorrorModeButton(class UWBP_MissionPointButton_C** HorrorModeButton_0);
	void CreateRegularModeButton(class UWBP_MissionPointButton_C** RegularModeButton_0);
	void ExecuteUbergraph_MenuActor(int32 EntryPoint);
	void ModeButtonOnPressed(class UWBP_MissionPointButton_C* ModeButton, bool ModeState, bool* Result);
	void OnHorrorModeButtonPressed();
	void OnMissionsMenuFound(class UWBP_Missions_C* MissionsMenuRef_0);
	void OnRegularModeButtonPressed();
	void ReceiveBeginPlay();
	void SetSelectedMode();
	void UncheckButton(class UWBP_MissionPointButton_C* ModeButton);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MenuActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MenuActor_C")
	}
	static class AMenuActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMenuActor_C>();
	}
};

}

