#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelingComponents

#include "Basic.hpp"

#include "ModelingComponents_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "GeometryFramework_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ModelingComponents.MeshTopologySelectionMechanic
// 0x0B00 (0x0B30 - 0x0030)
class alignas(0x10) UMeshTopologySelectionMechanic : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshTopologySelectionMechanicProperties* Properties;                                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x60];                                      // 0x0080(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UMouseHoverBehavior*                    HoverBehavior;                                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickOrDragInputBehavior*        ClickOrDragBehavior;                               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URectangleMarqueeMechanic*              MarqueeMechanic;                                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMarqueeSelectionUpdateType                   MarqueeSelectionUpdateType;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x604];                                     // 0x00FC(0x0604)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  PreviewGeometryActor;                              // 0x0700(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTriangleSetComponent*                  DrawnTriangleSetComponent;                         // 0x0708(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_710[0x50];                                     // 0x0710(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     HighlightedFaceMaterial;                           // 0x0760(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_768[0x3C8];                                    // 0x0768(0x03C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshTopologySelectionMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshTopologySelectionMechanic")
	}
	static class UMeshTopologySelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTopologySelectionMechanic>();
	}
};

// Class ModelingComponents.BoundarySelectionMechanic
// 0x0000 (0x0B30 - 0x0B30)
class UBoundarySelectionMechanic final : public UMeshTopologySelectionMechanic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BoundarySelectionMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BoundarySelectionMechanic")
	}
	static class UBoundarySelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoundarySelectionMechanic>();
	}
};

// Class ModelingComponents.DynamicMeshCommitter
// 0x0000 (0x0000 - 0x0000)
class IDynamicMeshCommitter final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMeshCommitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMeshCommitter")
	}
	static class IDynamicMeshCommitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMeshCommitter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.DynamicMeshProvider
// 0x0000 (0x0000 - 0x0000)
class IDynamicMeshProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMeshProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMeshProvider")
	}
	static class IDynamicMeshProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDynamicMeshProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.PersistentDynamicMeshSource
// 0x0000 (0x0000 - 0x0000)
class IPersistentDynamicMeshSource final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PersistentDynamicMeshSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PersistentDynamicMeshSource")
	}
	static class IPersistentDynamicMeshSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPersistentDynamicMeshSource>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.GeometrySelectionVisualizationProperties
// 0x0060 (0x0108 - 0x00A8)
class UGeometrySelectionVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bEnableShowTriangleROIBorder;                      // 0x00A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableShowEdgeSelectionVertices;                  // 0x00A9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionElementType                 SelectionElementType;                              // 0x00AA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionTopologyType                SelectionTopologyType;                             // 0x00AB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSelection;                                    // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTriangleROIBorder;                            // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHidden;                                       // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEdgeSelectionVertices;                        // 0x00AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineThickness;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointSize;                                         // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 FaceColor;                                         // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 LineColor;                                         // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 PointColor;                                        // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TriangleROIBorderColor;                            // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     TriangleMaterial;                                  // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LineMaterial;                                      // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PointMaterial;                                     // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TriangleMaterialShowingHidden;                     // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LineMaterialShowingHidden;                         // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PointMaterialShowingHidden;                        // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometrySelectionVisualizationProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometrySelectionVisualizationProperties")
	}
	static class UGeometrySelectionVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionVisualizationProperties>();
	}
};

// Class ModelingComponents.InteractiveToolActivity
// 0x0000 (0x0030 - 0x0030)
class UInteractiveToolActivity : public UInteractionMechanic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractiveToolActivity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractiveToolActivity")
	}
	static class UInteractiveToolActivity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveToolActivity>();
	}
};

// Class ModelingComponents.ToolActivityHost
// 0x0000 (0x0000 - 0x0000)
class IToolActivityHost final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ToolActivityHost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ToolActivityHost")
	}
	static class IToolActivityHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<IToolActivityHost>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.MeshTopologySelectionMechanicProperties
// 0x0018 (0x00C0 - 0x00A8)
class UMeshTopologySelectionMechanicProperties : public UInteractiveToolPropertySet
{
public:
	bool                                          bSelectVertices;                                   // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdges;                                      // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectFaces;                                      // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeLoops;                                  // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeRings;                                  // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitBackFaces;                                     // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMarquee;                                    // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarqueeIgnoreOcclusion;                           // 0x00AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferProjectedElement;                           // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectDownRay;                                    // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOcclusion;                                  // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3[0xD];                                       // 0x00B3(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InvertSelection();
	void SelectAll();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshTopologySelectionMechanicProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshTopologySelectionMechanicProperties")
	}
	static class UMeshTopologySelectionMechanicProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTopologySelectionMechanicProperties>();
	}
};

// Class ModelingComponents.GeometrySelectionEditCommandArguments
// 0x0020 (0x0050 - 0x0030)
class UGeometrySelectionEditCommandArguments final : public UInteractiveCommandArguments
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometrySelectionEditCommandArguments")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometrySelectionEditCommandArguments")
	}
	static class UGeometrySelectionEditCommandArguments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommandArguments>();
	}
};

// Class ModelingComponents.GeometrySelectionEditCommandResult
// 0x0078 (0x00A0 - 0x0028)
class UGeometrySelectionEditCommandResult final : public UInteractiveCommandResult
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometrySelectionEditCommandResult")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometrySelectionEditCommandResult")
	}
	static class UGeometrySelectionEditCommandResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommandResult>();
	}
};

// Class ModelingComponents.GeometrySelectionEditCommand
// 0x0000 (0x0028 - 0x0028)
class UGeometrySelectionEditCommand : public UInteractiveCommand
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometrySelectionEditCommand")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometrySelectionEditCommand")
	}
	static class UGeometrySelectionEditCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometrySelectionEditCommand>();
	}
};

// Class ModelingComponents.ToolHostCustomizationAPI
// 0x0000 (0x0000 - 0x0000)
class IToolHostCustomizationAPI final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ToolHostCustomizationAPI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ToolHostCustomizationAPI")
	}
	static class IToolHostCustomizationAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<IToolHostCustomizationAPI>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ModelingComponents.VoxelProperties
// 0x0018 (0x00C0 - 0x00A8)
class UVoxelProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         VoxelCount;                                        // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSimplify;                                     // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveInternalSurfaces;                           // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SimplifyMaxErrorFactor;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CubeRootMinComponentVolume;                        // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoxelProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoxelProperties")
	}
	static class UVoxelProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelProperties>();
	}
};

// Class ModelingComponents.MultiSelectionMeshEditingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UMultiSelectionMeshEditingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiSelectionMeshEditingToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiSelectionMeshEditingToolBuilder")
	}
	static class UMultiSelectionMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiSelectionMeshEditingToolBuilder>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseCreateFromSelectedToolBuilder : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedToolBuilder")
	}
	static class UBaseCreateFromSelectedToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedToolBuilder>();
	}
};

// Class ModelingComponents.OnAcceptHandleSourcesPropertiesBase
// 0x0000 (0x00A8 - 0x00A8)
class UOnAcceptHandleSourcesPropertiesBase : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnAcceptHandleSourcesPropertiesBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnAcceptHandleSourcesPropertiesBase")
	}
	static class UOnAcceptHandleSourcesPropertiesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesPropertiesBase>();
	}
};

// Class ModelingComponents.OnAcceptHandleSourcesProperties
// 0x0008 (0x00B0 - 0x00A8)
class UOnAcceptHandleSourcesProperties : public UOnAcceptHandleSourcesPropertiesBase
{
public:
	EHandleSourcesMethod                          HandleInputs;                                      // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnAcceptHandleSourcesProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnAcceptHandleSourcesProperties")
	}
	static class UOnAcceptHandleSourcesProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesProperties>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedHandleSourceProperties
// 0x0028 (0x00D8 - 0x00B0)
class UBaseCreateFromSelectedHandleSourceProperties final : public UOnAcceptHandleSourcesProperties
{
public:
	EBaseCreateFromSelectedTargetType             OutputWriteTo;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutputNewName;                                     // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputExistingName;                                // 0x00C8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedHandleSourceProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedHandleSourceProperties")
	}
	static class UBaseCreateFromSelectedHandleSourceProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedHandleSourceProperties>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedCollisionProperties
// 0x0008 (0x00B0 - 0x00A8)
class UBaseCreateFromSelectedCollisionProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bTransferCollision;                                // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedCollisionProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedCollisionProperties")
	}
	static class UBaseCreateFromSelectedCollisionProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedCollisionProperties>();
	}
};

// Class ModelingComponents.TransformInputsToolProperties
// 0x0008 (0x00B0 - 0x00A8)
class UTransformInputsToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bShowTransformGizmo;                               // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TransformInputsToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TransformInputsToolProperties")
	}
	static class UTransformInputsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransformInputsToolProperties>();
	}
};

// Class ModelingComponents.MultiSelectionMeshEditingTool
// 0x0008 (0x00B8 - 0x00B0)
class UMultiSelectionMeshEditingTool : public UMultiSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiSelectionMeshEditingTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiSelectionMeshEditingTool")
	}
	static class UMultiSelectionMeshEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiSelectionMeshEditingTool>();
	}
};

// Class ModelingComponents.BaseCreateFromSelectedTool
// 0x0050 (0x0108 - 0x00B8)
class UBaseCreateFromSelectedTool : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformInputsToolProperties*         TransformProperties;                               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCreateMeshObjectTypeProperties*        OutputTypeProperties;                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseCreateFromSelectedHandleSourceProperties* HandleSourcesProperties;                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseCreateFromSelectedCollisionProperties* CollisionProperties;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTransformProxy*>                TransformProxies;                                  // 0x00E8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UCombinedTransformGizmo*>        TransformGizmos;                                   // 0x00F8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedTool")
	}
	static class UBaseCreateFromSelectedTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedTool>();
	}
};

// Class ModelingComponents.BaseMeshProcessingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseMeshProcessingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMeshProcessingToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMeshProcessingToolBuilder")
	}
	static class UBaseMeshProcessingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingToolBuilder>();
	}
};

// Class ModelingComponents.BaseMeshProcessingTool
// 0x0358 (0x0400 - 0x00A8)
class alignas(0x10) UBaseMeshProcessingTool : public USingleSelectionTool
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x330];                                     // 0x00D0(0x0330)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMeshProcessingTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMeshProcessingTool")
	}
	static class UBaseMeshProcessingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingTool>();
	}
};

// Class ModelingComponents.BaseVoxelTool
// 0x0018 (0x0120 - 0x0108)
class UBaseVoxelTool : public UBaseCreateFromSelectedTool
{
public:
	class UVoxelProperties*                       VoxProperties;                                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseVoxelTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseVoxelTool")
	}
	static class UBaseVoxelTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseVoxelTool>();
	}
};

// Class ModelingComponents.MeshSurfacePointMeshEditingToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshSurfacePointMeshEditingToolBuilder : public UMeshSurfacePointToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshSurfacePointMeshEditingToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshSurfacePointMeshEditingToolBuilder")
	}
	static class UMeshSurfacePointMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSurfacePointMeshEditingToolBuilder>();
	}
};

// Class ModelingComponents.SingleSelectionMeshEditingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class USingleSelectionMeshEditingToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleSelectionMeshEditingToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleSelectionMeshEditingToolBuilder")
	}
	static class USingleSelectionMeshEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleSelectionMeshEditingToolBuilder>();
	}
};

// Class ModelingComponents.SingleSelectionMeshEditingTool
// 0x0008 (0x00B0 - 0x00A8)
class USingleSelectionMeshEditingTool : public USingleSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleSelectionMeshEditingTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleSelectionMeshEditingTool")
	}
	static class USingleSelectionMeshEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleSelectionMeshEditingTool>();
	}
};

// Class ModelingComponents.SingleTargetWithSelectionToolBuilder
// 0x0000 (0x0028 - 0x0028)
class USingleTargetWithSelectionToolBuilder : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleTargetWithSelectionToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleTargetWithSelectionToolBuilder")
	}
	static class USingleTargetWithSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleTargetWithSelectionToolBuilder>();
	}
};

// Class ModelingComponents.SingleTargetWithSelectionTool
// 0x0078 (0x0120 - 0x00A8)
class USingleTargetWithSelectionTool : public USingleSelectionTool
{
public:
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x60];                                      // 0x00B0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometrySelectionVisualizationProperties* GeometrySelectionVizProperties;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       GeometrySelectionViz;                              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleTargetWithSelectionTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleTargetWithSelectionTool")
	}
	static class USingleTargetWithSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleTargetWithSelectionTool>();
	}
};

// Class ModelingComponents.DynamicMeshReplacementChangeTarget
// 0x0030 (0x0058 - 0x0028)
class UDynamicMeshReplacementChangeTarget final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMeshReplacementChangeTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMeshReplacementChangeTarget")
	}
	static class UDynamicMeshReplacementChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshReplacementChangeTarget>();
	}
};

// Class ModelingComponents.OctreeDynamicMeshComponent
// 0x0110 (0x06D0 - 0x05C0)
class UOctreeDynamicMeshComponent final : public UBaseDynamicMeshComponent
{
public:
	uint8                                         Pad_5C0[0x50];                                     // 0x05C0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           MeshObject;                                        // 0x0610(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_618[0xB8];                                     // 0x0618(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDynamicMesh(class UDynamicMesh* NewMesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OctreeDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OctreeDynamicMeshComponent")
	}
	static class UOctreeDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOctreeDynamicMeshComponent>();
	}
};

// Class ModelingComponents.LineSetComponent
// 0x0080 (0x05D0 - 0x0550)
class ULineSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     LineMaterial;                                      // 0x0550(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0558(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_591[0x3F];                                     // 0x0591(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LineSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LineSetComponent")
	}
	static class ULineSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineSetComponent>();
	}
};

// Class ModelingComponents.MeshElementsVisualizerProperties
// 0x0030 (0x00D8 - 0x00A8)
class UMeshElementsVisualizerProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bVisible;                                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBorders;                                      // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowUVSeams;                                      // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNormalSeams;                                  // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTangentSeams;                                 // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowColorSeams;                                   // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThicknessScale;                                    // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 WireframeColor;                                    // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BoundaryEdgeColor;                                 // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 UVSeamColor;                                       // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 NormalSeamColor;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TangentSeamColor;                                  // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ColorSeamColor;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustDepthBiasUsingMeshSize;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshElementsVisualizerProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshElementsVisualizerProperties")
	}
	static class UMeshElementsVisualizerProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshElementsVisualizerProperties>();
	}
};

// Class ModelingComponents.PreviewGeometry
// 0x00F8 (0x0120 - 0x0028)
class UPreviewGeometry : public UObject
{
public:
	class APreviewGeometryActor*                  ParentActor;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UTriangleSetComponent*> TriangleSets;                                  // 0x0030(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FString, class ULineSetComponent*> LineSets;                                          // 0x0080(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FString, class UPointSetComponent*> PointSets;                                        // 0x00D0(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	class ULineSetComponent* AddLineSet(const class FString& LineSetIdentifier);
	class UPointSetComponent* AddPointSet(const class FString& PointSetIdentifier);
	class UTriangleSetComponent* AddTriangleSet(const class FString& TriangleSetIdentifier);
	void CreateInWorld(class UWorld* World, const struct FTransform& WithTransform);
	void Disconnect();
	class ULineSetComponent* FindLineSet(const class FString& LineSetIdentifier);
	class UPointSetComponent* FindPointSet(const class FString& PointSetIdentifier);
	class UTriangleSetComponent* FindTriangleSet(const class FString& TriangleSetIdentifier);
	void RemoveAllLineSets(bool bDestroy);
	void RemoveAllPointSets(bool bDestroy);
	void RemoveAllTriangleSets(bool bDestroy);
	bool RemoveLineSet(const class FString& LineSetIdentifier, bool bDestroy);
	bool RemovePointSet(const class FString& PointSetIdentifier, bool bDestroy);
	bool RemoveTriangleSet(const class FString& TriangleSetIdentifier, bool bDestroy);
	void SetAllLineSetsMaterial(class UMaterialInterface* Material);
	void SetAllPointSetsMaterial(class UMaterialInterface* Material);
	bool SetLineSetMaterial(const class FString& LineSetIdentifier, class UMaterialInterface* NewMaterial);
	bool SetLineSetVisibility(const class FString& LineSetIdentifier, bool bVisible);
	bool SetPointSetMaterial(const class FString& PointSetIdentifier, class UMaterialInterface* NewMaterial);
	bool SetPointSetVisibility(const class FString& PointSetIdentifier, bool bVisible);

	class APreviewGeometryActor* GetActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewGeometry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewGeometry")
	}
	static class UPreviewGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewGeometry>();
	}
};

// Class ModelingComponents.MeshElementsVisualizer
// 0x0028 (0x0148 - 0x0120)
class UMeshElementsVisualizer final : public UPreviewGeometry
{
public:
	class UMeshElementsVisualizerProperties*      Settings;                                          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshWireframeComponent*                WireframeComponent;                                // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x18];                                     // 0x0130(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshElementsVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshElementsVisualizer")
	}
	static class UMeshElementsVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshElementsVisualizer>();
	}
};

// Class ModelingComponents.MeshWireframeComponent
// 0x00B0 (0x0600 - 0x0550)
class UMeshWireframeComponent final : public UMeshComponent
{
public:
	float                                         LineDepthBias;                                     // 0x0550(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineDepthBiasSizeScale;                            // 0x0554(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThicknessScale;                                    // 0x0558(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWireframe;                                  // 0x055C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55D[0x3];                                      // 0x055D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 WireframeColor;                                    // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WireframeThickness;                                // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableBoundaryEdges;                              // 0x0568(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 BoundaryEdgeColor;                                 // 0x056C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoundaryEdgeThickness;                             // 0x0570(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUVSeams;                                    // 0x0574(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 UVSeamColor;                                       // 0x0578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UVSeamThickness;                                   // 0x057C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalSeams;                                // 0x0580(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 NormalSeamColor;                                   // 0x0584(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalSeamThickness;                               // 0x0588(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTangentSeams;                               // 0x058C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 TangentSeamColor;                                  // 0x0590(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TangentSeamThickness;                              // 0x0594(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableColorSeams;                                 // 0x0598(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 ColorSeamColor;                                    // 0x059C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ColorSeamThickness;                                // 0x05A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LineMaterial;                                      // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       LocalBounds;                                       // 0x05B0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5E8[0x18];                                     // 0x05E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshWireframeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshWireframeComponent")
	}
	static class UMeshWireframeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshWireframeComponent>();
	}
};

// Class ModelingComponents.PointSetComponent
// 0x0080 (0x05D0 - 0x0550)
class UPointSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     PointMaterial;                                     // 0x0550(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0558(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_591[0x3F];                                     // 0x0591(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PointSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PointSetComponent")
	}
	static class UPointSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointSetComponent>();
	}
};

// Class ModelingComponents.PreviewMesh
// 0x0118 (0x0140 - 0x0028)
class alignas(0x10) UPreviewMesh : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBuildSpatialDataStructure;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0xE8];                                      // 0x0058(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewMesh")
	}
	static class UPreviewMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewMesh>();
	}
};

// Class ModelingComponents.PolyEditPreviewMesh
// 0x0340 (0x0480 - 0x0140)
class UPolyEditPreviewMesh final : public UPreviewMesh
{
public:
	uint8                                         Pad_140[0x340];                                    // 0x0140(0x0340)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PolyEditPreviewMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PolyEditPreviewMesh")
	}
	static class UPolyEditPreviewMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolyEditPreviewMesh>();
	}
};

// Class ModelingComponents.PreviewGeometryActor
// 0x0000 (0x0298 - 0x0298)
class APreviewGeometryActor final : public AInternalToolFrameworkActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewGeometryActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewGeometryActor")
	}
	static class APreviewGeometryActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreviewGeometryActor>();
	}
};

// Class ModelingComponents.TriangleSetComponent
// 0x0100 (0x0650 - 0x0550)
class UTriangleSetComponent final : public UMeshComponent
{
public:
	struct FBoxSphereBounds                       Bounds;                                            // 0x0550(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_589[0xC7];                                     // 0x0589(0x00C7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TriangleSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TriangleSetComponent")
	}
	static class UTriangleSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTriangleSetComponent>();
	}
};

// Class ModelingComponents.UVLayoutPreviewProperties
// 0x0028 (0x00D0 - 0x00A8)
class UUVLayoutPreviewProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bEnabled;                                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EUVLayoutPreviewSide                          Side;                                              // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Offset;                                            // 0x00B8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UVLayoutPreviewProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UVLayoutPreviewProperties")
	}
	static class UUVLayoutPreviewProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVLayoutPreviewProperties>();
	}
};

// Class ModelingComponents.UVLayoutPreview
// 0x0148 (0x0170 - 0x0028)
class alignas(0x10) UUVLayoutPreview final : public UObject
{
public:
