#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionSymphony

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum MotionSymphony.EMSHyperExtensionFixMethod
// NumValues: 0x0004
enum class EMSHyperExtensionFixMethod : uint8
{
	None                                     = 0,
	MoveFootTowardsThigh                     = 1,
	MoveFootUnderThigh                       = 2,
	EMSHyperExtensionFixMethod_MAX           = 3,
};

// Enum MotionSymphony.EDecouplerClampMode
// NumValues: 0x0003
enum class EDecouplerClampMode : uint8
{
	None                                     = 0,
	Hard                                     = 1,
	EDecouplerClampMode_MAX                  = 2,
};

// Enum MotionSymphony.ETransitionDirectionMethod
// NumValues: 0x0003
enum class ETransitionDirectionMethod : uint8
{
	Manual                                   = 0,
	RootMotion                               = 1,
	ETransitionDirectionMethod_MAX           = 2,
};

// Enum MotionSymphony.ETransitionMatchingOrder
// NumValues: 0x0003
enum class ETransitionMatchingOrder : uint8
{
	TransitionPriority                       = 0,
	PoseAndTransitionCombined                = 1,
	ETransitionMatchingOrder_MAX             = 2,
};

// Enum MotionSymphony.EDistanceMatchingUseCase
// NumValues: 0x0003
enum class EDistanceMatchingUseCase : uint8
{
	None                                     = 0,
	Strict                                   = 1,
	EDistanceMatchingUseCase_MAX             = 2,
};

// Enum MotionSymphony.EDistanceMatchType
// NumValues: 0x0005
enum class EDistanceMatchType : uint8
{
	None                                     = 0,
	Backward                                 = 1,
	Forward                                  = 2,
	Both                                     = 3,
	EDistanceMatchType_MAX                   = 4,
};

// Enum MotionSymphony.EDistanceMatchBasis
// NumValues: 0x0003
enum class EDistanceMatchBasis : uint8
{
	Positional                               = 0,
	Rotational                               = 1,
	EDistanceMatchBasis_MAX                  = 2,
};

// Enum MotionSymphony.EDistanceMatchTrigger
// NumValues: 0x0008
enum class EDistanceMatchTrigger : uint8
{
	None                                     = 0,
	Start                                    = 1,
	Stop                                     = 2,
	Plant                                    = 3,
	Jump                                     = 4,
	TurnInPlace                              = 5,
	Pivot                                    = 6,
	EDistanceMatchTrigger_MAX                = 7,
};

// Enum MotionSymphony.ETrajectoryPreProcessMethod
// NumValues: 0x0005
enum class ETrajectoryPreProcessMethod : uint8
{
	None                                     = 0,
	IgnoreEdges                              = 1,
	Extrapolate                              = 2,
	Animation                                = 3,
	ETrajectoryPreProcessMethod_MAX          = 4,
};

// Enum MotionSymphony.EJointVelocityCalculationMethod
// NumValues: 0x0003
enum class EJointVelocityCalculationMethod : uint8
{
	BodyIndependent                          = 0,
	BodyDependent                            = 1,
	EJointVelocityCalculationMethod_MAX      = 2,
};

// Enum MotionSymphony.EAllAxis
// NumValues: 0x0007
enum class EAllAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	NegX                                     = 3,
	NegY                                     = 4,
	NegZ                                     = 5,
	EAllAxis_MAX                             = 6,
};

// Enum MotionSymphony.EMotionMatchingMode
// NumValues: 0x0004
enum class EMotionMatchingMode : uint8
{
	MotionMatching                           = 0,
	DistanceMatching                         = 1,
	Action                                   = 2,
	EMotionMatchingMode_MAX                  = 3,
};

// Enum MotionSymphony.EPoseSearchFlag
// NumValues: 0x0005
enum class EPoseSearchFlag : uint8
{
	Searchable                               = 0,
	NextNatural                              = 1,
	EdgePose                                 = 2,
	DoNotUse                                 = 3,
	EPoseSearchFlag_MAX                      = 4,
};

// Enum MotionSymphony.EBlendStatus
// NumValues: 0x0005
enum class EBlendStatus : uint8
{
	Inactive                                 = 0,
	Chosen                                   = 1,
	Dominant                                 = 2,
	Decay                                    = 3,
	EBlendStatus_MAX                         = 4,
};

// Enum MotionSymphony.ETransitionMethod
// NumValues: 0x0003
enum class ETransitionMethod : uint8
{
	None                                     = 0,
	Inertialization                          = 1,
	ETransitionMethod_MAX                    = 2,
};

// Enum MotionSymphony.EPastTrajectoryMode
// NumValues: 0x0003
enum class EPastTrajectoryMode : uint8
{
	ActualHistory                            = 0,
	CopyFromCurrentPose                      = 1,
	EPastTrajectoryMode_MAX                  = 2,
};

// Enum MotionSymphony.EMotionAnimAssetType
// NumValues: 0x0005
enum class EMotionAnimAssetType : uint8
{
	None                                     = 0,
	Sequence                                 = 1,
	BlendSpace                               = 2,
	Composite                                = 3,
	EMotionAnimAssetType_MAX                 = 4,
};

// Enum MotionSymphony.EMotionMatchingSearchQuality
// NumValues: 0x0003
enum class EMotionMatchingSearchQuality : uint8
{
	Performance                              = 0,
	Quality                                  = 1,
	EMotionMatchingSearchQuality_MAX         = 2,
};

// Enum MotionSymphony.ETrajectoryMoveMode
// NumValues: 0x0003
enum class ETrajectoryMoveMode : uint8
{
	Standard                                 = 0,
	Strafe                                   = 1,
	ETrajectoryMoveMode_MAX                  = 2,
};

// Enum MotionSymphony.ETrajectoryModel
// NumValues: 0x0003
enum class ETrajectoryModel : uint8
{
	Spring                                   = 0,
	UECharacterMovement                      = 1,
	ETrajectoryModel_MAX                     = 2,
};

// Enum MotionSymphony.ETrajectoryControlMode
// NumValues: 0x0003
enum class ETrajectoryControlMode : uint8
{
	PlayerControlled                         = 0,
	AIControlled                             = 1,
	ETrajectoryControlMode_MAX               = 2,
};

// Enum MotionSymphony.EPoseCategory
// NumValues: 0x0003
enum class EPoseCategory : uint8
{
	Quality                                  = 0,
	Responsiveness                           = 1,
	EPoseCategory_MAX                        = 2,
};

// Enum MotionSymphony.EMSFootLockId
// NumValues: 0x0009
enum class EMSFootLockId : uint8
{
	LeftFoot                                 = 0,
	RightFoot                                = 1,
	Foot3                                    = 2,
	Foot4                                    = 3,
	Foot5                                    = 4,
	Foot6                                    = 5,
	Foot7                                    = 6,
	Foot8                                    = 7,
	EMSFootLockId_MAX                        = 8,
};

// Enum MotionSymphony.EMotionCalibrationType
// NumValues: 0x0003
enum class EMotionCalibrationType : uint8
{
	Multiplier                               = 0,
	Override                                 = 1,
	EMotionCalibrationType_MAX               = 2,
};

// Enum MotionSymphony.EMSStrideVectorMethod
// NumValues: 0x0003
enum class EMSStrideVectorMethod : uint8
{
	ManualVelocity                           = 0,
	ActorVelocity                            = 1,
	EMSStrideVectorMethod_MAX                = 2,
};

// Enum MotionSymphony.EMSFootLockState
// NumValues: 0x0004
enum class EMSFootLockState : uint8
{
	Unlocked                                 = 0,
	Locked                                   = 1,
	TimeLocked                               = 2,
	EMSFootLockState_MAX                     = 3,
};

// Enum MotionSymphony.ETrajectoryErrorWarpMode
// NumValues: 0x0004
enum class ETrajectoryErrorWarpMode : uint8
{
	Disabled                                 = 0,
	Standard                                 = 1,
	Strafe                                   = 2,
	ETrajectoryErrorWarpMode_MAX             = 3,
};

// ScriptStruct MotionSymphony.AnimChannelState
// 0x0050 (0x0050 - 0x0000)
struct FAnimChannelState final
{
public:
	int32                                         AnimId;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionAnimAssetType                          AnimType;                                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartPoseId;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BlendSpacePosition;                                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimTime;                                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMirrored;                                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimLength;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x14];                                      // 0x0034(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CachedTriangulationIndex;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.MotionRecordData
// 0x0028 (0x0028 - 0x0000)
struct FMotionRecordData final
{
public:
	class UMotionMatchConfig*                     MotionMatchConfig;                                 // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 RecordedPoseArray;                                 // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<float>                                 FeatureCacheData;                                  // 0x0018(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.AnimNode_MotionRecorder
// 0x0058 (0x0068 - 0x0010)
struct FAnimNode_MotionRecorder final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRetargetPose;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMotionMatchConfig*>             MotionConfigs;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMotionMatchConfig*>             CopyConfigs;                                       // 0x0058(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
};

// ScriptStruct MotionSymphony.AnimNode_MSDistanceMatching
// 0x0050 (0x0098 - 0x0048)
struct FAnimNode_MSDistanceMatching final : public FAnimNode_SequencePlayer
{
public:
	float                                         DesiredDistance;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DistanceCurveName;                                 // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNegateDistanceCurve;                              // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistanceMatchType                            MovementType;                                      // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceLimit;                                     // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestinationReachedThreshold;                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothRate;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothTimeThreshold;                               // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x28];                                      // 0x0068(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      LastAnimSequenceUsed;                              // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct MotionSymphony.MSFootLockLimbDefinition
// 0x0100 (0x0100 - 0x0000)
struct alignas(0x10) FMSFootLockLimbDefinition final
{
public:
	struct FBoneReference                         FootBone;                                          // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         ToeBone;                                           // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         IkTarget;                                          // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LimbBoneCount;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xCC];                                      // 0x0034(0x00CC)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.AnimNode_MSFootLocker
// 0x0268 (0x0330 - 0x00C8)
struct FAnimNode_MSFootLocker final : public FAnimNode_SkeletalControlBase
{
public:
	bool                                          bLeftFootLock;                                     // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightFootLock;                                    // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMSHyperExtensionFixMethod                    LegHyperExtensionFixMethod;                        // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AllowLegExtensionRatio;                            // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LockReleaseSmoothTime;                             // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMSFootLockLimbDefinition              LeftFootDefinition;                                // 0x00E0(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FMSFootLockLimbDefinition              RightFootDefinition;                               // 0x01E0(0x0100)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x50];                                     // 0x02E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.MotionMatchingInputData
// 0x0010 (0x0010 - 0x0000)
struct FMotionMatchingInputData final
{
public:
	TArray<float>                                 DesiredInputArray;                                 // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.CalibrationData
// 0x0010 (0x0010 - 0x0000)
struct FCalibrationData final
{
public:
	TArray<float>                                 Weights;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.AnimNode_MSMotionMatching
// 0x01A8 (0x01E0 - 0x0038)
struct FAnimNode_MSMotionMatching final : public FAnimNode_AssetPlayerBase
{
public:
	struct FMotionMatchingInputData               InputData;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bUserForcePoseSearch;                              // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateInterval;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamePoseTolerance;                                 // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackRate;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideQualityVsResponsivenessRatio;              // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionDataAsset*                       MotionData;                                        // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionCalibration*                     UserCalibration;                                   // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCalibrationData>               FinalCalibrationSets;                              // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EMotionMatchingSearchQuality                  SearchQuality;                                     // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETransitionMethod                             TransitionMethod;                                  // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPastTrajectoryMode                           PastTrajectoryMode;                                // 0x0082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendInputResponse;                               // 0x0083(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputResponseBlendMagnitude;                       // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFavourCurrentPose;                                // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentPoseFavour;                                 // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextNaturalRange;                                  // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNextNaturalToleranceTest;                         // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFavourNextNatural;                                // 0x0095(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NextNaturalFavour;                                 // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableToleranceTest;                              // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PositionTolerance;                                 // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationTolerance;                                 // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredMotionTags;                                // 0x00A8(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x118];                                     // 0x00C8(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.PoseMatchData
// 0x0010 (0x0010 - 0x0000)
struct FPoseMatchData final
{
public:
	int32                                         PoseId;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimId;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMirror;                                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.AnimNode_PoseMatchBase
// 0x00B0 (0x00F8 - 0x0048)
struct FAnimNode_PoseMatchBase : public FAnimNode_SequencePlayer
{
public:
	float                                         PoseInterval;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PosesEndTime;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionMatchConfig*                     PoseConfig;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionCalibration*                     Calibration;                                       // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMirroring;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPoseMatchData>                 Poses;                                             // 0x0078(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FCalibrationData                       FinalCalibration;                                  // 0x0088(0x0010)(Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 PoseMatrix;                                        // 0x0098(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FCalibrationData                       StandardDeviation;                                 // 0x00A8(0x0010)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x40];                                      // 0x00B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.DistanceMatchingNodeData
// 0x001C (0x001C - 0x0000)
struct FDistanceMatchingNodeData final
{
public:
	class FName                                   DistanceCurveName;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNegateDistanceCurve;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistanceMatchType                            MovementType;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceLimit;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestinationReachedThreshold;                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothRate;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothTimeThreshold;                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.AnimNode_MultiPoseMatching
// 0x0050 (0x0148 - 0x00F8)
struct FAnimNode_MultiPoseMatching final : public FAnimNode_PoseMatchBase
{
public:
	TArray<class UAnimSequence*>                  Animations;                                        // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EDistanceMatchingUseCase                      DistanceMatchingUseCase;                           // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DesiredDistance;                                   // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDistanceMatchingNodeData              DistanceMatchData;                                 // 0x0110(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x1C];                                     // 0x012C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.AnimNode_PoseMatching
// 0x0000 (0x00F8 - 0x00F8)
struct FAnimNode_PoseMatching final : public FAnimNode_PoseMatchBase
{
};

// ScriptStruct MotionSymphony.AnimNode_RootMotionDecoupler
// 0x0108 (0x01D0 - 0x00C8)
struct alignas(0x10) FAnimNode_RootMotionDecoupler final : public FAnimNode_SkeletalControlBase
{
public:
	bool                                          bDecoupleLocation;                                 // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDecouplerClampMode                           TranslationClampMode;                              // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TranslationClampDistance;                          // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDecoupleRotation;                                 // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDecouplerClampMode                           RotationClampMode;                                 // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationClampDegrees;                              // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0xF8];                                      // 0x00D8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.AnimNode_TimeMatching
// 0x0020 (0x0068 - 0x0048)
struct FAnimNode_TimeMatching final : public FAnimNode_SequencePlayer
{
public:
	float                                         DesiredTime;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerTime;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.DistanceMatchingModule
// 0x0020 (0x0020 - 0x0000)
struct FDistanceMatchingModule final
{
public:
	class UAnimSequenceBase*                      AnimSequence;                                      // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.TransitionAnimData
// 0x0070 (0x0070 - 0x0000)
struct FTransitionAnimData final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CurrentMove;                                       // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredMove;                                       // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETransitionDirectionMethod                    TransitionDirectionMethod;                         // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CostMultiplier;                                    // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMirror;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartPose;                                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndPose;                                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDistanceMatchingModule                DistanceMatchModule;                               // 0x0050(0x0020)(Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.AnimNode_TransitionMatching
// 0x0090 (0x0188 - 0x00F8)
struct FAnimNode_TransitionMatching final : public FAnimNode_PoseMatchBase
{
public:
	struct FVector                                CurrentMoveVector;                                 // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredMoveVector;                                 // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETransitionMatchingOrder                      TransitionMatchingOrder;                           // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartDirectionWeight;                              // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDirectionWeight;                                // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransitionAnimData>            TransitionAnimData;                                // 0x0138(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EDistanceMatchingUseCase                      DistanceMatchingUseCase;                           // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DesiredDistance;                                   // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDistanceMatchingNodeData              DistanceMatchData;                                 // 0x0150(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransitionAnimData>            MirroredTransitionAnimData;                        // 0x0170(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.InputSet
// 0x0020 (0x0020 - 0x0000)
struct FInputSet final
{
public:
	struct FVector2D                              InputRemapRange;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplier;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveResponseMultiplier;                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnResponseMultiplier;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.InputProfile
// 0x0010 (0x0010 - 0x0000)
struct FInputProfile final
{
public:
	TArray<struct FInputSet>                      InputSets;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.JointData
// 0x0030 (0x0030 - 0x0000)
struct FJointData final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0018(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.MotionAnimAsset
// 0x0070 (0x0070 - 0x0000)
struct FMotionAnimAsset
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnimId;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionAnimAssetType                          MotionAnimAssetType;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMirroring;                                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlattenTrajectory;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrajectoryPreProcessMethod                   PastTrajectory;                                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrajectoryPreProcessMethod                   FutureTrajectory;                                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                        AnimAsset;                                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          PrecedingMotion;                                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FollowingMotion;                                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CostMultiplier;                                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MotionTags;                                        // 0x0038(0x0020)(NativeAccessSpecifierPublic)
	TArray<struct FAnimNotifyEvent>               Tags;                                              // 0x0058(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UMotionDataAsset*                       ParentMotionDataAsset;                             // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.MotionAnimSequence
// 0x0008 (0x0078 - 0x0070)
struct FMotionAnimSequence final : public FMotionAnimAsset
{
public:
	class UAnimSequence*                          Sequence;                                          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.MotionBlendSpace
// 0x0018 (0x0088 - 0x0070)
struct FMotionBlendSpace final : public FMotionAnimAsset
{
public:
	class UBlendSpace*                            BlendSpace;                                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SampleSpacing;                                     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.MotionComposite
// 0x0008 (0x0078 - 0x0070)
struct FMotionComposite final : public FMotionAnimAsset
{
public:
	class UAnimComposite*                         AnimComposite;                                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.MotionTagEvent
// 0x0060 (0x0090 - 0x0030)
struct FMotionTagEvent final : public FAnimLinkableElement
{
public:
	class FName                                   TagName;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionTag*                             Tag;                                               // 0x0038(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimLinkableElement                   EndLink;                                           // 0x0048(0x0030)(NativeAccessSpecifierPublic)
	int32                                         TrackIndex;                                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x14];                                      // 0x007C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.MSFootLockData
// 0x0008 (0x0008 - 0x0000)
struct FMSFootLockData final
{
public:
	EMSFootLockState                              LockState;                                         // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainingLockTime;                                 // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.PoseMatrix
// 0x0018 (0x0018 - 0x0000)
struct FPoseMatrix final
{
public:
	int32                                         PoseCount;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AtomCount;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 PoseArray;                                         // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.PoseMatrixSection
// 0x0008 (0x0008 - 0x0000)
struct FPoseMatrixSection final
{
public:
	int32                                         StartIndex;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndIndex;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.PoseAABBMatrix
// 0x0018 (0x0018 - 0x0000)
struct FPoseAABBMatrix final
{
public:
	float                                         DimCount;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AABBCount;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ExtentsArray;                                      // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.PoseMotionData
// 0x0050 (0x0050 - 0x0000)
struct FPoseMotionData final
{
public:
	int32                                         PoseId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionAnimAssetType                          AnimType;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnimId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BlendSpacePosition;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextPoseId;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastPoseId;                                        // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMirrored;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchFlag                               SearchFlag;                                        // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MotionTags;                                        // 0x0030(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct MotionSymphony.TrajectoryPoint
// 0x0020 (0x0020 - 0x0000)
struct FTrajectoryPoint final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationZ;                                         // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MotionSymphony.Trajectory
// 0x0010 (0x0010 - 0x0000)
struct FTrajectory final
{
public:
	TArray<struct FTrajectoryPoint>               TrajectoryPoints;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

