#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionSymphony

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MotionSymphony_structs.hpp"


namespace SDK::Params
{

// Function MotionSymphony.DistanceMatching.DetectTransitions
// 0x0004 (0x0004 - 0x0000)
struct DistanceMatching_DetectTransitions final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.GetAndConsumeTriggeredTransition
// 0x0001 (0x0001 - 0x0000)
struct DistanceMatching_GetAndConsumeTriggeredTransition final
{
public:
	EDistanceMatchTrigger                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.GetMarkerDistance
// 0x0004 (0x0004 - 0x0000)
struct DistanceMatching_GetMarkerDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.TriggerJump
// 0x0004 (0x0004 - 0x0000)
struct DistanceMatching_TriggerJump final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.TriggerPlant
// 0x0004 (0x0004 - 0x0000)
struct DistanceMatching_TriggerPlant final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.TriggerStart
// 0x0004 (0x0004 - 0x0000)
struct DistanceMatching_TriggerStart final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.TriggerStop
// 0x0004 (0x0004 - 0x0000)
struct DistanceMatching_TriggerStop final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.DistanceMatching.TriggerTurnInPlaceTo
// 0x0018 (0x0018 - 0x0000)
struct DistanceMatching_TriggerTurnInPlaceTo final
{
public:
	struct FVector                                DesiredDirection;                                  // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.ConstructMotionInputFeatureArray
// 0x0020 (0x0020 - 0x0000)
struct MMBlueprintFunctionLibrary_ConstructMotionInputFeatureArray final
{
public:
	struct FMotionMatchingInputData               InputData;                                         // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionMatchConfig*                     MotionConfig;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.CreateInputDataFromTrajectory
// 0x0020 (0x0020 - 0x0000)
struct MMBlueprintFunctionLibrary_CreateInputDataFromTrajectory final
{
public:
	struct FTrajectory                            Trajectory;                                        // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMotionMatchingInputData               InputData;                                         // 0x0010(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.GetInputVectorRelativeToCamera
// 0x0038 (0x0038 - 0x0000)
struct MMBlueprintFunctionLibrary_GetInputVectorRelativeToCamera final
{
public:
	struct FVector                                InputVector;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       CameraComponent;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.GetVectorRelativeToCamera
// 0x0028 (0x0028 - 0x0000)
struct MMBlueprintFunctionLibrary_GetVectorRelativeToCamera final
{
public:
	float                                         InputX;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputY;                                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       CameraComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.InitializeTrajectory
// 0x0018 (0x0018 - 0x0000)
struct MMBlueprintFunctionLibrary_InitializeTrajectory final
{
public:
	struct FTrajectory                            OutTrajectory;                                     // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         TrajectoryCount;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.SetTrajectoryPoint
// 0x0038 (0x0038 - 0x0000)
struct MMBlueprintFunctionLibrary_SetTrajectoryPoint final
{
public:
	struct FTrajectory                            OutTrajectory;                                     // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationZ;                                         // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.MMBlueprintFunctionLibrary.TransformFromUpForwardAxis
// 0x0070 (0x0070 - 0x0000)
struct MMBlueprintFunctionLibrary_TransformFromUpForwardAxis final
{
public:
	struct FTransform                             OutTransform;                                      // 0x0000(0x0060)(Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAllAxis                                      UpAxis;                                            // 0x0060(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAllAxis                                      ForwardAxis;                                       // 0x0061(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0xE];                                       // 0x0062(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.MotionTag.GetTagName
// 0x0010 (0x0010 - 0x0000)
struct MotionTag_GetTagName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MotionTag.Received_RunPreProcessForTag
// 0x0004 (0x0004 - 0x0000)
struct MotionTag_Received_RunPreProcessForTag final
{
public:
	float                                         PoseInterval;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MSFootLockerMath.AngleBetween
// 0x0038 (0x0038 - 0x0000)
struct MSFootLockerMath_AngleBetween final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                B;                                                 // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.MSFootLockManager.LockFoot
// 0x0008 (0x0008 - 0x0000)
struct MSFootLockManager_LockFoot final
{
public:
	EMSFootLockId                                 FootId;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MSFootLockManager.UnlockFoot
// 0x0001 (0x0001 - 0x0000)
struct MSFootLockManager_UnlockFoot final
{
public:
	EMSFootLockId                                 FootId;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.MSFootLockManager.IsFootLocked
// 0x0002 (0x0002 - 0x0000)
struct MSFootLockManager_IsFootLocked final
{
public:
	EMSFootLockId                                 FootId;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TagPoint.Received_PreProcessTag
// 0x0068 (0x0068 - 0x0000)
struct TagPoint_Received_PreProcessTag final
{
public:
	struct FPoseMotionData                        PointPose;                                         // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMotionAnimObject*                      OutMotionAnim;                                     // 0x0050(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionDataAsset*                       OutMotionData;                                     // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0064(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.TagSection.Received_PreProcessPose
// 0x0070 (0x0070 - 0x0000)
struct TagSection_Received_PreProcessPose final
{
public:
	struct FPoseMotionData                        OutPose;                                           // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMotionAnimObject*                      OutMotionAnim;                                     // 0x0050(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionDataAsset*                       OutMotionData;                                     // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0064(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.TagSection.Received_PreProcessTag
// 0x0020 (0x0020 - 0x0000)
struct TagSection_Received_PreProcessTag final
{
public:
	class UMotionAnimObject*                      OutMotionAnim;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionDataAsset*                       OutMotionData;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MotionSymphony.TrajectoryErrorWarping.ApplyTrajectoryErrorWarping
// 0x0008 (0x0008 - 0x0000)
struct TrajectoryErrorWarping_ApplyTrajectoryErrorWarping final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryErrorWarping.SetMode
// 0x0014 (0x0014 - 0x0000)
struct TrajectoryErrorWarping_SetMode final
{
public:
	ETrajectoryErrorWarpMode                      InWarpMode;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InWarpRate;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMinTrajectoryLength;                             // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinActivation;                                     // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxActivation;                                     // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryErrorWarping.CalculateTrajectoryErrorWarping
// 0x000C (0x000C - 0x0000)
struct TrajectoryErrorWarping_CalculateTrajectoryErrorWarping final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.DrawTrajectoryDebug
// 0x0018 (0x0018 - 0x0000)
struct TrajectoryGenerator_Base_DrawTrajectoryDebug final
{
public:
	struct FVector                                DrawOffset;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.HasMoveInput
// 0x0001 (0x0001 - 0x0000)
struct TrajectoryGenerator_Base_HasMoveInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.IsIdle
// 0x0001 (0x0001 - 0x0000)
struct TrajectoryGenerator_Base_IsIdle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.SetCharacterSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct TrajectoryGenerator_Base_SetCharacterSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 InSkelMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.SetInputProfile
// 0x0010 (0x0010 - 0x0000)
struct TrajectoryGenerator_Base_SetInputProfile final
{
public:
	struct FInputProfile                          InInputProfile;                                    // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.SetTrajectoryInput
// 0x000C (0x000C - 0x0000)
struct TrajectoryGenerator_Base_SetTrajectoryInput final
{
public:
	float                                         XAxisValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YAxisValue;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZAxisValue;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.SetTrajectoryInputX
// 0x0004 (0x0004 - 0x0000)
struct TrajectoryGenerator_Base_SetTrajectoryInputX final
{
public:
	float                                         XAxisValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.SetTrajectoryInputY
// 0x0004 (0x0004 - 0x0000)
struct TrajectoryGenerator_Base_SetTrajectoryInputY final
{
public:
	float                                         YAxisValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.SetTrajectoryInputZ
// 0x0004 (0x0004 - 0x0000)
struct TrajectoryGenerator_Base_SetTrajectoryInputZ final
{
public:
	float                                         ZAxisValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator_Base.GetCurrentTrajectory
// 0x0010 (0x0010 - 0x0000)
struct TrajectoryGenerator_Base_GetCurrentTrajectory final
{
public:
	struct FTrajectory                            ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MotionSymphony.TrajectoryGenerator.SetStrafeDirectionFromCamera
// 0x0008 (0x0008 - 0x0000)
struct TrajectoryGenerator_SetStrafeDirectionFromCamera final
{
public:
	class UCameraComponent*                       Camera;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

