#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraSimCaching

#include "Basic.hpp"

#include "NiagaraSimCaching_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class NiagaraSimCaching.MovieSceneNiagaraCacheSection
// 0x0090 (0x0188 - 0x00F8)
class UMovieSceneNiagaraCacheSection final : public UMovieSceneBaseCacheSection
{
public:
	struct FMovieSceneNiagaraCacheParams          Params_0;                                          // 0x00F8(0x0088)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCacheOutOfDate;                                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraCacheSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraCacheSection")
	}
	static class UMovieSceneNiagaraCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheSection>();
	}
};

// Class NiagaraSimCaching.MovieSceneNiagaraCacheTrack
// 0x0030 (0x00C8 - 0x0098)
class UMovieSceneNiagaraCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRecording;                                      // 0x00A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x00B0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bCacheRecordingEnabled;                            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraCacheTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraCacheTrack")
	}
	static class UMovieSceneNiagaraCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheTrack>();
	}
};

}

