#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCJumpSkill_Struct_Vertical

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct NPCJumpSkill_Struct_Vertical.NPCJumpSkill_Struct_Vertical
// 0x0040 (0x0040 - 0x0000)
struct FNPCJumpSkill_Struct_Vertical final
{
public:
	struct FVector                                Option_MeshMove_Offset_20_7FE07F2A45AFD20001704080AC87EEC2; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_MeshMove_StartTime_21_EC3AF0C0461835145DA5449E21A7DA58; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AirLoop_Rotate_Duration_22_A34C8C5D48360A1261096F8459A772B9; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Move_Duration_24_865B958E490ECB94FCCB49A25F38A887; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           Move_Curve_12_B54C6D424E42107EC54A85B7393F402C;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              TargetAnimArray_19_92ADF18F45400862F644CA991D93E172; // 0x0020(0x0010)(Edit, BlueprintVisible)
	ELLandPositionSelectType                      LandPositionSelectType_29_2049EA164DDCC43207C7D2B18D60EB6A; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LandPositionSelectType_Offset_30_E3FC68294CEB4655BC44B4BA6C889ECC; // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FNPCJumpSkill_Struct_Vertical;

}

