#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemBlueprints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.GetCachedAchievement
// 0x0060 (0x0060 - 0x0000)
struct OnlineAchievementsSubsystem_GetCachedAchievement final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AchievementId;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineAchievementBP                   OutAchievement;                                    // 0x0040(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	EOnlineCachedResult_                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.GetCachedAchievementDescription
// 0x0058 (0x0058 - 0x0000)
struct OnlineAchievementsSubsystem_GetCachedAchievementDescription final
{
public:
	class FString                                 AchievementId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineAchievementDescBP               OutAchievementDesc;                                // 0x0010(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	EOnlineCachedResult_                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.GetCachedAchievements
// 0x0048 (0x0048 - 0x0000)
struct OnlineAchievementsSubsystem_GetCachedAchievements final
{
public:
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOnlineAchievementBP>           OutAchievements;                                   // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EOnlineCachedResult_                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineAchievementsSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.ConfigureRoom
// 0x0068 (0x0068 - 0x0000)
struct OnlineChatSubsystem_ConfigureRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.CreateRoom
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_CreateRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.ExitRoom
// 0x0048 (0x0048 - 0x0000)
struct OnlineChatSubsystem_ExitRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetJoinedRooms
// 0x0040 (0x0040 - 0x0000)
struct OnlineChatSubsystem_GetJoinedRooms final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutRooms;                                          // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetLastMessages
// 0x0060 (0x0060 - 0x0000)
struct OnlineChatSubsystem_GetLastMessages final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumMessages;                                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChatMessageBP>                 OutMessages;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetMember
// 0x00B8 (0x00B8 - 0x0000)
struct OnlineChatSubsystem_GetMember final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       MemberId;                                          // 0x0040(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomMemberBP                      ReturnValue;                                       // 0x0070(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetMembers
// 0x0058 (0x0058 - 0x0000)
struct OnlineChatSubsystem_GetMembers final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChatRoomMemberBP>              OutMembers;                                        // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.GetRoomInfo
// 0x00C0 (0x00C0 - 0x0000)
struct OnlineChatSubsystem_GetRoomInfo final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomInfoBP                        ReturnValue;                                       // 0x0040(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.IsChatAllowed
// 0x0068 (0x0068 - 0x0000)
struct OnlineChatSubsystem_IsChatAllowed final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       RecipientId;                                       // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineChatSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.JoinPrivateRoom
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_JoinPrivateRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.JoinPublicRoom
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_JoinPublicRoom final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatRoomConfigBP                      ChatRoomConfig;                                    // 0x0050(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.SendPrivateChat
// 0x0078 (0x0078 - 0x0000)
struct OnlineChatSubsystem_SendPrivateChat final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       RecipientId;                                       // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgBody;                                           // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineChatSubsystem.SendRoomChat
// 0x0058 (0x0058 - 0x0000)
struct OnlineChatSubsystem_SendRoomChat final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgBody;                                           // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineTurnBasedSubsystem.GetMatchDataSize
// 0x0004 (0x0004 - 0x0000)
struct OnlineTurnBasedSubsystem_GetMatchDataSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineTurnBasedSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineTurnBasedSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystemWriteAchievements.WriteAchievements
// 0x0048 (0x0048 - 0x0000)
struct OnlineAchievementsSubsystemWriteAchievements_WriteAchievements final
{
public:
	class UOnlineAchievementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsWrite*               WriteObject;                                       // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystemWriteAchievements* ReturnValue;                                // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystemQueryAchievements.QueryAchievements
// 0x0040 (0x0040 - 0x0000)
struct OnlineAchievementsSubsystemQueryAchievements_QueryAchievements final
{
public:
	class UOnlineAchievementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystemQueryAchievements* ReturnValue;                                // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineLeaderboardsSubsystemReadLeaderboardsAroundRank.ReadLeaderboardsAroundRank
// 0x0028 (0x0028 - 0x0000)
struct OnlineLeaderboardsSubsystemReadLeaderboardsAroundRank_ReadLeaderboardsAroundRank final
{
public:
	class UOnlineLeaderboardsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Range;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineLeaderboardRead*                 ReadObject;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineLeaderboardsSubsystemReadLeaderboardsAroundRank* ReturnValue;                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedAchievementsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedAchievementsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedAvatarSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedAvatarSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystem*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedChatSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedChatSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineChatSubsystem*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedEntitlementsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedEntitlementsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineEntitlementsSubsystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedEventsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedEventsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineEventsSubsystem*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedExternalUISubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedExternalUISubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineExternalUISubsystem*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedFriendsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedFriendsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineFriendsSubsystem*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedGameActivitySubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedGameActivitySubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineGameActivitySubsystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedGameItemStatsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedGameItemStatsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineGameItemStatsSubsystem*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedGroupsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedGroupsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineGroupsSubsystem*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedIdentitySubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedIdentitySubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineIdentitySubsystem*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedLeaderboardsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedLeaderboardsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineLeaderboardsSubsystem*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedLobbySubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedLobbySubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineLobbySubsystem*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedMessageSanitizerSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedMessageSanitizerSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineMessageSanitizerSubsystem*       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedMessageSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedMessageSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineMessageSubsystem*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedPartySubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedPartySubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlinePartySubsystem*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedPresenceSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedPresenceSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlinePresenceSubsystem*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedPurchaseSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedPurchaseSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlinePurchaseSubsystem*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedSessionSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedSessionSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineSessionSubsystem*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedSharedCloudSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedSharedCloudSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineSharedCloudSubsystem*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedSharingSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedSharingSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineSharingSubsystem*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedStatsSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedStatsSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineStatsSubsystem*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedStoreV2Subsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedStoreV2Subsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineStoreV2Subsystem*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedTimeSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedTimeSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineTimeSubsystem*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedTitleFileSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedTitleFileSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineTitleFileSubsystem*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedTournamentSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedTournamentSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineTournamentSubsystem*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedTurnBasedSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedTurnBasedSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineTurnBasedSubsystem*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedUserCloudSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedUserCloudSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineUserCloudSubsystem*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedUserSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedUserSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineUserSubsystem*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedVoiceAdminSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedVoiceAdminSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineVoiceAdminSubsystem*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineSubsystem.GetNamedVoiceSubsystem
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystem_GetNamedVoiceSubsystem final
{
public:
	class FName                                   SubsystemName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineVoiceSubsystem*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineAchievementsSubsystemQueryAchievementDescriptions.QueryAchievementDescriptions
// 0x0040 (0x0040 - 0x0000)
struct OnlineAchievementsSubsystemQueryAchievementDescriptions_QueryAchievementDescriptions final
{
public:
	class UOnlineAchievementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAchievementsSubsystemQueryAchievementDescriptions* ReturnValue;                     // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.AddLoginFlowHandler
// 0x0010 (0x0010 - 0x0000)
struct OnlineExternalUISubsystem_AddLoginFlowHandler final
{
public:
	TScriptInterface<class IExternalUIFlowHandler> Handler;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.CloseWebURL
// 0x0001 (0x0001 - 0x0000)
struct OnlineExternalUISubsystem_CloseWebURL final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineExternalUISubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.LoginFlowComplete
// 0x0040 (0x0040 - 0x0000)
struct OnlineExternalUISubsystem_LoginFlowComplete final
{
public:
	int32                                         RequestID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoginFlowResultBP                     Result;                                            // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.NotifyLoginRedirectURL
// 0x0050 (0x0050 - 0x0000)
struct OnlineExternalUISubsystem_NotifyLoginRedirectURL final
{
public:
	int32                                         RequestID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLoginFlowResultBP                     ReturnValue;                                       // 0x0018(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.RemoveLoginFlowHandler
// 0x0010 (0x0010 - 0x0000)
struct OnlineExternalUISubsystem_RemoveLoginFlowHandler final
{
public:
	TScriptInterface<class IExternalUIFlowHandler> Handler;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.ShowAccountUpgradeUI
// 0x0038 (0x0038 - 0x0000)
struct OnlineExternalUISubsystem_ShowAccountUpgradeUI final
{
public:
	struct FUniqueNetIdRepl                       UniqueID;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.ShowAchievementsUI
// 0x0008 (0x0008 - 0x0000)
struct OnlineExternalUISubsystem_ShowAchievementsUI final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.ShowFriendsUI
// 0x0008 (0x0008 - 0x0000)
struct OnlineExternalUISubsystem_ShowFriendsUI final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.ShowInviteUI
// 0x0010 (0x0010 - 0x0000)
struct OnlineExternalUISubsystem_ShowInviteUI final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SessionName;                                       // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.ShowLeaderboardUI
// 0x0018 (0x0018 - 0x0000)
struct OnlineExternalUISubsystem_ShowLeaderboardUI final
{
public:
	class FString                                 LeaderboardName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineExternalUISubsystem.ShowPlatformMessageBox
// 0x0038 (0x0038 - 0x0000)
struct OnlineExternalUISubsystem_ShowPlatformMessageBox final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlatformMessageType_                         MessageType;                                       // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OnlineSubsystemBlueprints.OnlineAvatarSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineAvatarSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineAvatarSubsystemGetAvatarUrl.GetAvatarUrl
// 0x0080 (0x0080 - 0x0000)
struct OnlineAvatarSubsystemGetAvatarUrl_GetAvatarUrl final
{
public:
	class UOnlineAvatarSubsystem*                 Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0038(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultAvatarUrl;                                  // 0x0068(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystemGetAvatarUrl*     ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineIdentitySubsystemAutoLogin.AutoLogin
// 0x0018 (0x0018 - 0x0000)
struct OnlineIdentitySubsystemAutoLogin_AutoLogin final
{
public:
	class UOnlineIdentitySubsystem*               Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalUserNum;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineIdentitySubsystemAutoLogin*      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineStatsSubsystemQueryStats.QueryStats
// 0x0060 (0x0060 - 0x0000)
struct OnlineStatsSubsystemQueryStats_QueryStats final
{
public:
	class UOnlineStatsSubsystem*                  Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUniqueNetIdRepl>               StatUsers;                                         // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         StatNames;                                         // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UOnlineStatsSubsystemQueryStats*        ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineAvatarSubsystemGetAvatar.GetAvatar
// 0x0078 (0x0078 - 0x0000)
struct OnlineAvatarSubsystemGetAvatar_GetAvatar final
{
public:
	class UOnlineAvatarSubsystem*                 Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0038(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               DefaultTexture;                                    // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineAvatarSubsystemGetAvatar*        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineEntitlementsSubsystem.GetAllEntitlements
// 0x0050 (0x0050 - 0x0000)
struct OnlineEntitlementsSubsystem_GetAllEntitlements final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NameSpace;                                         // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UOnlineEntitlement*>             OutUserEntitlements;                               // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineEntitlementsSubsystem.GetEntitlement
// 0x0048 (0x0048 - 0x0000)
struct OnlineEntitlementsSubsystem_GetEntitlement final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EntitlementId;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineEntitlement*                     ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineEntitlementsSubsystem.GetItemEntitlement
// 0x0048 (0x0048 - 0x0000)
struct OnlineEntitlementsSubsystem_GetItemEntitlement final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOnlineEntitlement*                     ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineEntitlementsSubsystem.IsSubsystemAvailable
// 0x0001 (0x0001 - 0x0000)
struct OnlineEntitlementsSubsystem_IsSubsystemAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OnlineSubsystemBlueprints.OnlineEntitlementsSubsystemQueryEntitlements.QueryEntitlements
// 0x0058 (0x0058 - 0x0000)
struct OnlineEntitlementsSubsystemQueryEntitlements_QueryEntitlements final
{
public:
	class UOnlineEntitlementsSubsystem*           Subsystem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
