#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCG_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class PCG.PCGData
// 0x0010 (0x0038 - 0x0028)
class UPCGData : public UObject
{
public:
	uint64                                        UID;                                               // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGData")
	}
	static class UPCGData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGData>();
	}
};

// Class PCG.PCGSettingsInterface
// 0x0008 (0x0040 - 0x0038)
class UPCGSettingsInterface : public UPCGData
{
public:
	bool                                          bEnabled;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSettingsInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSettingsInterface")
	}
	static class UPCGSettingsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsInterface>();
	}
};

// Class PCG.PCGSettings
// 0x0068 (0x00A8 - 0x0040)
class UPCGSettings : public UPCGSettingsInterface
{
public:
	int32                                         Seed;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseSeed;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x3F];                                      // 0x0051(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGSettingsOverridableParam>   CachedOverridableParams;                           // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSettings")
	}
	static class UPCGSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettings>();
	}
};

// Class PCG.PCGCreateSplineSettings
// 0x0058 (0x0100 - 0x00A8)
class UPCGCreateSplineSettings final : public UPCGSettings
{
public:
	EPCGCreateSplineMode                          Mode;                                              // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLinear;                                           // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyCustomTangents;                              // 0x00AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ArriveTangentAttribute;                            // 0x00AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LeaveTangentAttribute;                             // 0x00B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x00C0(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttachOptions                             AttachOptions;                                     // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PostProcessFunctionNames;                          // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCreateSplineSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCreateSplineSettings")
	}
	static class UPCGCreateSplineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreateSplineSettings>();
	}
};

// Class PCG.PCGAddTagSettings
// 0x0010 (0x00B8 - 0x00A8)
class UPCGAddTagSettings final : public UPCGSettings
{
public:
	class FString                                 TagsToAdd;                                         // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAddTagSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAddTagSettings")
	}
	static class UPCGAddTagSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddTagSettings>();
	}
};

// Class PCG.PCGSettingsWithDynamicInputs
// 0x0010 (0x00B8 - 0x00A8)
class UPCGSettingsWithDynamicInputs : public UPCGSettings
{
public:
	TArray<struct FPCGPinProperties>              DynamicInputPinProperties;                         // 0x00A8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSettingsWithDynamicInputs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSettingsWithDynamicInputs")
	}
	static class UPCGSettingsWithDynamicInputs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsWithDynamicInputs>();
	}
};

// Class PCG.PCGApplyOnActorSettings
// 0x0048 (0x00F0 - 0x00A8)
class UPCGApplyOnActorSettings final : public UPCGSettings
{
public:
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x00A8(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPCGObjectPropertyOverrideDescription> PropertyOverrideDescriptions;               // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PostProcessFunctionNames;                          // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGApplyOnActorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGApplyOnActorSettings")
	}
	static class UPCGApplyOnActorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyOnActorSettings>();
	}
};

// Class PCG.PCGApplyScaleToBoundsSettings
// 0x0000 (0x00A8 - 0x00A8)
class UPCGApplyScaleToBoundsSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGApplyScaleToBoundsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGApplyScaleToBoundsSettings")
	}
	static class UPCGApplyScaleToBoundsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyScaleToBoundsSettings>();
	}
};

// Class PCG.PCGMultiSelectSettings
// 0x0058 (0x0100 - 0x00A8)
class UPCGMultiSelectSettings final : public UPCGSettings
{
public:
	EPCGControlFlowSelectionMode                  SelectionMode;                                     // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerSelection;                                  // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntOptions;                                        // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 StringSelection;                                   // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringOptions;                                     // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FEnumSelector                          EnumSelection;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           CachedPinLabels;                                   // 0x00F0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGMultiSelectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGMultiSelectSettings")
	}
	static class UPCGMultiSelectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMultiSelectSettings>();
	}
};

// Class PCG.PCGAssetExporter
// 0x0000 (0x0028 - 0x0028)
class UPCGAssetExporter final : public UObject
{
public:
	bool BP_ExportToAsset(class UPCGDataAsset* Asset);

	TSubclassOf<class UPCGDataAsset> BP_GetAssetType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAssetExporter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAssetExporter")
	}
	static class UPCGAssetExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAssetExporter>();
	}
};

// Class PCG.PCGAddAttributeSettings
// 0x01D8 (0x0280 - 0x00A8)
class UPCGAddAttributeSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x00D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGMetadataTypesConstantStruct        AttributeTypes;                                    // 0x0100(0x0170)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCopyAllAttributes;                                // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAddAttributeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAddAttributeSettings")
	}
	static class UPCGAddAttributeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddAttributeSettings>();
	}
};

// Class PCG.PCGAttributeCastSettings
// 0x0058 (0x0100 - 0x00A8)
class UPCGAttributeCastSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGMetadataTypes                             OutputType;                                        // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeCastSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeCastSettings")
	}
	static class UPCGAttributeCastSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeCastSettings>();
	}
};

// Class PCG.PCGAttributeExtractorTestObject
// 0x0008 (0x0030 - 0x0028)
class UPCGAttributeExtractorTestObject final : public UObject
{
public:
	double                                        DoubleValue;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeExtractorTestObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeExtractorTestObject")
	}
	static class UPCGAttributeExtractorTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeExtractorTestObject>();
	}
};

// Class PCG.PCGLinearDensityRemapSettings
// 0x0010 (0x00B8 - 0x00A8)
class UPCGLinearDensityRemapSettings final : public UPCGSettings
{
public:
	float                                         RemapMin;                                          // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemapMax;                                          // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMultiplyDensity;                                  // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGLinearDensityRemapSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGLinearDensityRemapSettings")
	}
	static class UPCGLinearDensityRemapSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGLinearDensityRemapSettings>();
	}
};

// Class PCG.PCGAttributeFilteringSettings
// 0x01E8 (0x0290 - 0x00A8)
class UPCGAttributeFilteringSettings final : public UPCGSettings
{
public:
	EPCGAttributeFilterOperator                   Operator;                                          // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseConstantThreshold;                             // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ThresholdAttribute;                                // 0x00E0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpatialQuery;                                  // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGMetadataTypesConstantStruct        AttributeTypes;                                    // 0x0110(0x0170)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bHasSpatialToPointDeprecation;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0xF];                                      // 0x0281(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeFilteringSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeFilteringSettings")
	}
	static class UPCGAttributeFilteringSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilteringSettings>();
	}
};

// Class PCG.PCGAttributeFilteringRangeSettings
// 0x0398 (0x0440 - 0x00A8)
class UPCGAttributeFilteringRangeSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributeFilterThresholdSettings   MinThreshold;                                      // 0x00D0(0x01B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributeFilterThresholdSettings   MaxThreshold;                                      // 0x0280(0x01B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bHasSpatialToPointDeprecation;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0xF];                                      // 0x0431(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeFilteringRangeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeFilteringRangeSettings")
	}
	static class UPCGAttributeFilteringRangeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilteringRangeSettings>();
	}
};

// Class PCG.PCGCreateTargetActor
// 0x00D8 (0x0180 - 0x00A8)
class UPCGCreateTargetActor final : public UPCGSettings
{
public:
	class AActor*                                 TemplateActor;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttachOptions                             AttachOptions;                                     // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  RootActor;                                         // 0x00B8(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorLabel;                                        // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ActorPivot;                                        // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPCGObjectPropertyOverrideDescription> PropertyOverrideDescriptions;               // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PostProcessFunctionNames;                          // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     TemplateActorClass;                                // 0x0170(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowTemplateActorEditing;                        // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCreateTargetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCreateTargetActor")
	}
	static class UPCGCreateTargetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreateTargetActor>();
	}
};

// Class PCG.PCGAttributePropertySelectorBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGAttributePropertySelectorBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FPCGAttributePropertyInputSelector CopyAndFixLast(const struct FPCGAttributePropertyInputSelector& Selector, const class UPCGData* InData);
	static struct FPCGAttributePropertyOutputSelector CopyAndFixSource(const struct FPCGAttributePropertyOutputSelector& OutputSelector, const struct FPCGAttributePropertyInputSelector& InputSelector);
	static class FName GetAttributeName(const struct FPCGAttributePropertySelector& Selector);
	static const TArray<class FString> GetExtraNames(const struct FPCGAttributePropertySelector& Selector);
	static EPCGExtraProperties GetExtraProperty(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetName(const struct FPCGAttributePropertySelector& Selector);
	static EPCGPointProperties GetPointProperty(const struct FPCGAttributePropertySelector& Selector);
	static EPCGAttributePropertySelection GetSelection(const struct FPCGAttributePropertySelector& Selector);
	static bool SetAttributeName(struct FPCGAttributePropertySelector& Selector, class FName InAttributeName);
	static bool SetExtraProperty(struct FPCGAttributePropertySelector& Selector, EPCGExtraProperties InExtraProperty);
	static bool SetPointProperty(struct FPCGAttributePropertySelector& Selector, EPCGPointProperties InPointProperty);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributePropertySelectorBlueprintHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributePropertySelectorBlueprintHelpers")
	}
	static class UPCGAttributePropertySelectorBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributePropertySelectorBlueprintHelpers>();
	}
};

// Class PCG.PCGBooleanSelectSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGBooleanSelectSettings final : public UPCGSettings
{
public:
	bool                                          bUseInputB;                                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGBooleanSelectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGBooleanSelectSettings")
	}
	static class UPCGBooleanSelectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBooleanSelectSettings>();
	}
};

// Class PCG.PCGPointNeighborhoodSettings
// 0x0028 (0x00D0 - 0x00A8)
class UPCGPointNeighborhoodSettings final : public UPCGSettings
{
public:
	double                                        SearchDistance;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetDistanceToAttribute;                           // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DistanceAttribute;                                 // 0x00B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAveragePositionToAttribute;                    // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AveragePositionAttribute;                          // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGPointNeighborhoodDensityMode              SetDensity;                                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAveragePosition;                               // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAverageColor;                                  // 0x00CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeightedAverage;                                  // 0x00CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGPointNeighborhoodSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGPointNeighborhoodSettings")
	}
	static class UPCGPointNeighborhoodSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGPointNeighborhoodSettings>();
	}
};

// Class PCG.PCGConvertToAttributeSetSettings
// 0x0000 (0x00A8 - 0x00A8)
class UPCGConvertToAttributeSetSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGConvertToAttributeSetSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGConvertToAttributeSetSettings")
	}
	static class UPCGConvertToAttributeSetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGConvertToAttributeSetSettings>();
	}
};

// Class PCG.PCGBranchSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGBranchSettings final : public UPCGSettings
{
public:
	bool                                          bOutputToB;                                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGBranchSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGBranchSettings")
	}
	static class UPCGBranchSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBranchSettings>();
	}
};

// Class PCG.PCGSpatialData
// 0x0048 (0x0080 - 0x0038)
class UPCGSpatialData : public UPCGData
{
public:
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepZeroDensityPoints;                            // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGMetadata*                           MetaData;                                          // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCachedLastSelector;                            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     CachedLastSelector;                                // 0x0058(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPCGMetadata* CreateEmptyMetadata();
	void InitializeFromData(const class UPCGSpatialData* InSource, const class UPCGMetadata* InMetadataParentOverride, bool bInheritMetadata, bool bInheritAttributes);
	class UPCGMetadata* MutableMetadata();

	const class UPCGMetadata* ConstMetadata() const;
	struct FBox GetBounds() const;
	float GetDensityAtPosition(const struct FVector& InPosition) const;
	int32 GetDimension() const;
	struct FVector GetNormal() const;
	struct FBox GetStrictBounds() const;
	bool HasNonTrivialTransform() const;
	class UPCGIntersectionData* IntersectWith(const class UPCGSpatialData* InOther) const;
	bool K2_ProjectPoint(const struct FTransform& InTransform, const struct FBox& InBounds, const struct FPCGProjectionParams& InParams, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	bool K2_SamplePoint(const struct FTransform& Transform, const struct FBox& Bounds, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	class UPCGSpatialData* ProjectOn(const class UPCGSpatialData* InOther, const struct FPCGProjectionParams& InParams) const;
	class UPCGDifferenceData* Subtract(const class UPCGSpatialData* InOther) const;
	const class UPCGPointData* ToPointData() const;
	const class UPCGPointData* ToPointDataWithContext(struct FPCGContext& Context) const;
	class UPCGUnionData* UnionWith(const class UPCGSpatialData* InOther) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSpatialData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSpatialData")
	}
	static class UPCGSpatialData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialData>();
	}
};

// Class PCG.PCGDebugSettings
// 0x0028 (0x00D0 - 0x00A8)
class UPCGDebugSettings final : public UPCGSettings
{
public:
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x00A8(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDebugSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDebugSettings")
	}
	static class UPCGDebugSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDebugSettings>();
	}
};

// Class PCG.PCGSpatialDataWithPointCache
// 0x0050 (0x00D0 - 0x0080)
class UPCGSpatialDataWithPointCache : public UPCGSpatialData
{
public:
	class UPCGPointData*                          CachedPointData;                                   // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBox>                           CachedBoundedPointDataBoxes;                       // 0x0088(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UPCGPointData*>                  CachedBoundedPointData;                            // 0x0098(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSpatialDataWithPointCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSpatialDataWithPointCache")
	}
	static class UPCGSpatialDataWithPointCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialDataWithPointCache>();
	}
};

// Class PCG.PCGCollisionShapeData
// 0x00F0 (0x01C0 - 0x00D0)
class UPCGCollisionShapeData final : public UPCGSpatialDataWithPointCache
{
public:
	struct FTransform                             Transform;                                         // 0x00D0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x18];                                     // 0x0130(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CachedBounds;                                      // 0x0148(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   CachedStrictBounds;                                // 0x0180(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCollisionShapeData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCollisionShapeData")
	}
	static class UPCGCollisionShapeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCollisionShapeData>();
	}
};

// Class PCG.PCGGetLoopIndexSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGGetLoopIndexSettings final : public UPCGSettings
{
public:
	bool                                          bWarnIfCalledOutsideOfLoop;                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGGetLoopIndexSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGGetLoopIndexSettings")
	}
	static class UPCGGetLoopIndexSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGetLoopIndexSettings>();
	}
};

// Class PCG.PCGCombinePointsSettings
// 0x0068 (0x0110 - 0x00A8)
class UPCGCombinePointsSettings final : public UPCGSettings
{
public:
	bool                                          bCenterPivot;                                      // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFirstPointTransform;                           // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PointTransform;                                    // 0x00B0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCombinePointsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCombinePointsSettings")
	}
	static class UPCGCombinePointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCombinePointsSettings>();
	}
};

// Class PCG.PCGConvexHull2DSettings
// 0x0000 (0x00A8 - 0x00A8)
class UPCGConvexHull2DSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGConvexHull2DSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGConvexHull2DSettings")
	}
	static class UPCGConvexHull2DSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGConvexHull2DSettings>();
	}
};

// Class PCG.PCGDifferenceSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGDifferenceSettings final : public UPCGSettings
{
public:
	EPCGDifferenceDensityFunction                 DensityFunction;                                   // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDifferenceMode                            Mode;                                              // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiffMetadata;                                     // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepZeroDensityPoints;                            // 0x00AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDifferenceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDifferenceSettings")
	}
	static class UPCGDifferenceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDifferenceSettings>();
	}
};

// Class PCG.PCGCreatePointsSettings
// 0x0018 (0x00C0 - 0x00A8)
class UPCGCreatePointsSettings final : public UPCGSettings
{
public:
	TArray<struct FPCGPoint>                      PointsToCreate;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EPCGCoordinateSpace                           CoordinateSpace;                                   // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCullPointsOutsideVolume;                          // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCreatePointsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCreatePointsSettings")
	}
	static class UPCGCreatePointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreatePointsSettings>();
	}
};

// Class PCG.PCGCreatePointsGridSettings
// 0x0038 (0x00E0 - 0x00A8)
class UPCGCreatePointsGridSettings final : public UPCGSettings
{
public:
	struct FVector                                GridExtents;                                       // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CellSize;                                          // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGCoordinateSpace                           CoordinateSpace;                                   // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetPointsBounds;                                  // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCullPointsOutsideVolume;                          // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGPointPosition                             PointPosition;                                     // 0x00DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCreatePointsGridSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCreatePointsGridSettings")
	}
	static class UPCGCreatePointsGridSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreatePointsGridSettings>();
	}
};

// Class PCG.PCGDataNumSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGDataNumSettings final : public UPCGSettings
{
public:
	class FName                                   OutputAttributeName;                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDataNumSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDataNumSettings")
	}
	static class UPCGDataNumSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDataNumSettings>();
	}
};

// Class PCG.PCGCullPointsOutsideActorBoundsSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGCullPointsOutsideActorBoundsSettings final : public UPCGSettings
{
public:
	float                                         BoundsExpansion;                                   // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCullPointsOutsideActorBoundsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCullPointsOutsideActorBoundsSettings")
	}
	static class UPCGCullPointsOutsideActorBoundsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCullPointsOutsideActorBoundsSettings>();
	}
};

// Class PCG.PCGGatherSettings
// 0x0000 (0x00A8 - 0x00A8)
class UPCGGatherSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGGatherSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGGatherSettings")
	}
	static class UPCGGatherSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGatherSettings>();
	}
};

// Class PCG.PCGDataAsset
// 0x0040 (0x0068 - 0x0028)
class UPCGDataAsset final : public UObject
{
public:
	struct FPCGDataCollection                     Data;                                              // 0x0028(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDataAsset")
	}
	static class UPCGDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDataAsset>();
	}
};

// Class PCG.PCGFilterDataBaseSettings
// 0x0000 (0x00A8 - 0x00A8)
class UPCGFilterDataBaseSettings : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGFilterDataBaseSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGFilterDataBaseSettings")
	}
	static class UPCGFilterDataBaseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGFilterDataBaseSettings>();
	}
};

// Class PCG.PCGFilterByTagSettings
// 0x0018 (0x00C0 - 0x00A8)
class UPCGFilterByTagSettings final : public UPCGFilterDataBaseSettings
{
public:
	EPCGFilterByTagOperation                      Operation;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedTags;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGFilterByTagSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGFilterByTagSettings")
	}
	static class UPCGFilterByTagSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGFilterByTagSettings>();
	}
};

// Class PCG.PCGExternalDataSettings
// 0x0050 (0x00F8 - 0x00A8)
class UPCGExternalDataSettings : public UPCGSettings
{
public:
	TMap<class FString, struct FPCGAttributePropertyInputSelector> AttributeMapping;                 // 0x00A8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGExternalDataSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGExternalDataSettings")
	}
	static class UPCGExternalDataSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGExternalDataSettings>();
	}
};

// Class PCG.PCGDistanceSettings
// 0x0048 (0x00F0 - 0x00A8)
class UPCGDistanceSettings final : public UPCGSettings
{
public:
	bool                                          bOutputToAttribute;                                // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertySelector          OutputAttribute;                                   // 0x00B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputDistanceVector;                             // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetDensity;                                       // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaximumDistance;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDistanceShape                             SourceShape;                                       // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDistanceShape                             TargetShape;                                       // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDistanceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDistanceSettings")
	}
	static class UPCGDistanceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDistanceSettings>();
	}
};

// Class PCG.PCGLoadDataTableSettings
// 0x0030 (0x0128 - 0x00F8)
class UPCGLoadDataTableSettings final : public UPCGExternalDataSettings
{
public:
	TSoftObjectPtr<class UDataTable>              DataTable;                                         // 0x00F8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGExclusiveDataType                         OutputType;                                        // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGLoadDataTableSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGLoadDataTableSettings")
	}
	static class UPCGLoadDataTableSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGLoadDataTableSettings>();
	}
};

// Class PCG.PCGPointExtentsModifierSettings
// 0x0020 (0x00C8 - 0x00A8)
class UPCGPointExtentsModifierSettings final : public UPCGSettings
{
public:
	struct FVector                                Extents;                                           // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGPointExtentsModifierMode                  Mode;                                              // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGPointExtentsModifierSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGPointExtentsModifierSettings")
	}
	static class UPCGPointExtentsModifierSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGPointExtentsModifierSettings>();
	}
};

// Class PCG.PCGManagedResource
// 0x0010 (0x0038 - 0x0028)
class UPCGManagedResource : public UObject
{
public:
	struct FPCGCrc                                Crc;                                               // 0x0028(0x0008)(Edit, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsMarkedUnused;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGManagedResource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGManagedResource")
	}
	static class UPCGManagedResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGManagedResource>();
	}
};

// Class PCG.PCGManagedComponent
// 0x0028 (0x0060 - 0x0038)
class UPCGManagedComponent : public UPCGManagedResource
{
public:
	TSoftObjectPtr<class UActorComponent>         GeneratedComponent;                                // 0x0038(0x0028)(Edit, BlueprintVisible, ExportObject, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGManagedComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGManagedComponent")
	}
	static class UPCGManagedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGManagedComponent>();
	}
};

// Class PCG.PCGInnerIntersectionSettings
// 0x0008 (0x00B0 - 0x00A8)
class UPCGInnerIntersectionSettings final : public UPCGSettings
{
public:
	EPCGIntersectionDensityFunction               DensityFunction;                                   // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepZeroDensityPoints;                            // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGInnerIntersectionSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGInnerIntersectionSettings")
	}
	static class UPCGInnerIntersectionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGInnerIntersectionSettings>();
	}
};

// Class PCG.PCGManagedDebugDrawComponent
// 0x0000 (0x0060 - 0x0060)
class UPCGManagedDebugDrawComponent final : public UPCGManagedComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGManagedDebugDrawComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGManagedDebugDrawComponent")
	}
	static class UPCGManagedDebugDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGManagedDebugDrawComponent>();
	}
};

// Class PCG.PCGDebugDrawComponent
// 0x0010 (0x0580 - 0x0570)
class UPCGDebugDrawComponent final : public UDebugDrawComponent
{
public:
	uint8                                         Pad_568[0x18];                                     // 0x0568(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDebugDrawComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDebugDrawComponent")
	}
	static class UPCGDebugDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDebugDrawComponent>();
	}
};

// Class PCG.PCGBlueprintSettings
// 0x0010 (0x00B8 - 0x00A8)
class UPCGBlueprintSettings final : public UPCGSettings
{
public:
	TSubclassOf<class UPCGBlueprintElement>       BlueprintElementType;                              // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPCGBlueprintElement*                   BlueprintElementInstance;                          // 0x00B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetElementType(TSubclassOf<class UPCGBlueprintElement> InElementType, class UPCGBlueprintElement** ElementInstance);

	TSubclassOf<class UPCGBlueprintElement> GetElementType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGBlueprintSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGBlueprintSettings")
	}
	static class UPCGBlueprintSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBlueprintSettings>();
	}
};

// Class PCG.PCGDeleteAttributesSettings
// 0x0018 (0x00C0 - 0x00A8)
class UPCGDeleteAttributesSettings final : public UPCGSettings
{
public:
	EPCGAttributeFilterOperation                  Operation;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
