#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsControl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PhysicsControl.PhysicsControlBPLibrary.AddControlParameters
// 0x00B8 (0x00B8 - 0x0000)
struct PhysicsControlBPLibrary_AddControlParameters final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParameters;                                 // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x0030(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlSparseData              ControlData;                                       // 0x0068(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.AddModifierParameters
// 0x0078 (0x0078 - 0x0000)
struct PhysicsControlBPLibrary_AddModifierParameters final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParameters;                                 // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x0030(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierSparseData      ModifierData;                                      // 0x0068(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.AddMultipleControlParameters
// 0x00C0 (0x00C0 - 0x0000)
struct PhysicsControlBPLibrary_AddMultipleControlParameters final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParameters;                                 // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x0030(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           Names;                                             // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlSparseData              ControlData;                                       // 0x0070(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.AddMultipleModifierParameters
// 0x0080 (0x0080 - 0x0000)
struct PhysicsControlBPLibrary_AddMultipleModifierParameters final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParameters;                                 // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x0030(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           Names;                                             // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierSparseData      ModifierData;                                      // 0x0070(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.BlendControlParametersThroughSet
// 0x0120 (0x0120 - 0x0000)
struct PhysicsControlBPLibrary_BlendControlParametersThroughSet final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParameters;                                 // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlNamedControlParameters  InStartControlParameters;                          // 0x0030(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlNamedControlParameters  InEndControlParameters;                            // 0x0088(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ControlNames;                                      // 0x00E0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x00F0(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.BlendModifierParametersThroughSet
// 0x00A0 (0x00A0 - 0x0000)
struct PhysicsControlBPLibrary_BlendModifierParametersThroughSet final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParameters;                                 // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlNamedModifierParameters InStartModifierParameters;                         // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlNamedModifierParameters InEndModifierParameters;                           // 0x0048(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ModifierNames;                                     // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x0070(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.BlendParameters
// 0x0098 (0x0098 - 0x0000)
struct PhysicsControlBPLibrary_BlendParameters final
{
public:
	struct FPhysicsControlControlAndModifierParameters InParametersA;                                // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlControlAndModifierParameters InParametersB;                                // 0x0030(0x0030)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InInterpolationWeight;                             // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlControlAndModifierParameters OutParameters;                                // 0x0068(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.ConvertToRigidBodyWithControl
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlBPLibrary_ConvertToRigidBodyWithControl final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigidBodyWithControlReference         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.ConvertToRigidBodyWithControlPure
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlBPLibrary_ConvertToRigidBodyWithControlPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigidBodyWithControlReference         RigidBodyWithControl;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlBPLibrary.GetBodyModifierNamesInSet
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlBPLibrary_GetBodyModifierNamesInSet final
{
public:
	struct FRigidBodyWithControlReference         RigidBodyWithControl;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SetName;                                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.GetControlNamesInSet
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlBPLibrary_GetControlNamesInSet final
{
public:
	struct FRigidBodyWithControlReference         RigidBodyWithControl;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SetName;                                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlBPLibrary.SetOverridePhysicsAsset
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlBPLibrary_SetOverridePhysicsAsset final
{
public:
	struct FRigidBodyWithControlReference         Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigidBodyWithControlReference         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.AddBodyModifiersToSet
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_AddBodyModifiersToSet final
{
public:
	struct FPhysicsControlNames                   NewSet;                                            // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           BodyModifiers;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.AddBodyModifierToSet
// 0x0020 (0x0020 - 0x0000)
struct PhysicsControlComponent_AddBodyModifierToSet final
{
public:
	struct FPhysicsControlNames                   NewSet;                                            // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FName                                   BodyModifier;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.AddControlsToSet
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_AddControlsToSet final
{
public:
	struct FPhysicsControlNames                   NewSet;                                            // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           Controls;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.AddControlToSet
// 0x0020 (0x0020 - 0x0000)
struct PhysicsControlComponent_AddControlToSet final
{
public:
	struct FPhysicsControlNames                   NewSet;                                            // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FName                                   Control;                                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateBodyModifier
// 0x0030 (0x0030 - 0x0000)
struct PhysicsControlComponent_CreateBodyModifier final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyModifierData;                                  // 0x0018(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateBodyModifiersFromLimbBones
// 0x00C0 (0x00C0 - 0x0000)
struct PhysicsControlComponent_CreateBodyModifiersFromLimbBones final
{
public:
	struct FPhysicsControlNames                   AllBodyModifiers;                                  // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlLimbBones> LimbBones;                                    // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyModifierData;                                  // 0x0060(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlNames> ReturnValue;                                      // 0x0070(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateBodyModifiersFromSkeletalMeshBelow
// 0x0040 (0x0040 - 0x0000)
struct PhysicsControlComponent_CreateBodyModifiersFromSkeletalMeshBelow final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSelf;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Set;                                               // 0x0014(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyModifierData;                                  // 0x001C(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControl
// 0x00F8 (0x00F8 - 0x0000)
struct PhysicsControlComponent_CreateControl final
{
public:
	class UMeshComponent*                         ParentMeshComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         ChildMeshComponent;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildBoneName;                                     // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    ControlData;                                       // 0x0020(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlTarget                  ControlTarget;                                     // 0x0070(0x0068)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x00D8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NamePrefix;                                        // 0x00E0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsAndBodyModifiersFromControlProfileAsset
// 0x0018 (0x0018 - 0x0000)
struct PhysicsControlComponent_CreateControlsAndBodyModifiersFromControlProfileAsset final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         WorldComponent;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldBoneName;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsAndBodyModifiersFromLimbBones
// 0x01F8 (0x01F8 - 0x0000)
struct PhysicsControlComponent_CreateControlsAndBodyModifiersFromLimbBones final
{
public:
	struct FPhysicsControlNames                   AllWorldSpaceControls;                             // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlNames> LimbWorldSpaceControls;                           // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlNames                   AllParentSpaceControls;                            // 0x0060(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlNames> LimbParentSpaceControls;                          // 0x0070(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlNames                   AllBodyModifiers;                                  // 0x00C0(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlNames> LimbBodyModifiers;                                // 0x00D0(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0120(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlLimbSetupData>   LimbSetupData;                                     // 0x0128(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    WorldSpaceControlData;                             // 0x0138(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    ParentSpaceControlData;                            // 0x0188(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyModifierData;                                  // 0x01D8(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UMeshComponent*                         WorldComponent;                                    // 0x01E8(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldBoneName;                                     // 0x01F0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsFromLimbBones
// 0x0128 (0x0128 - 0x0000)
struct PhysicsControlComponent_CreateControlsFromLimbBones final
{
public:
	struct FPhysicsControlNames                   AllControls;                                       // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlLimbBones> LimbBones;                                    // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EPhysicsControlType                           ControlType;                                       // 0x0060(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0068(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UMeshComponent*                         WorldComponent;                                    // 0x00B8(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldBoneName;                                     // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NamePrefix;                                        // 0x00C8(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlNames> ReturnValue;                                      // 0x00D8(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsFromLimbBonesAndConstraintProfile
// 0x00C0 (0x00C0 - 0x0000)
struct PhysicsControlComponent_CreateControlsFromLimbBonesAndConstraintProfile final
{
public:
	struct FPhysicsControlNames                   AllControls;                                       // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlLimbBones> LimbBones;                                    // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ConstraintProfile;                                 // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0068(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FPhysicsControlNames> ReturnValue;                                      // 0x0070(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsFromSkeletalMesh
// 0x0088 (0x0088 - 0x0000)
struct PhysicsControlComponent_CreateControlsFromSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPhysicsControlType                           ControlType;                                       // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0020(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0078(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsFromSkeletalMeshAndConstraintProfile
// 0x0040 (0x0040 - 0x0000)
struct PhysicsControlComponent_CreateControlsFromSkeletalMeshAndConstraintProfile final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ConstraintProfile;                                 // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsFromSkeletalMeshAndConstraintProfileBelow
// 0x0038 (0x0038 - 0x0000)
struct PhysicsControlComponent_CreateControlsFromSkeletalMeshAndConstraintProfileBelow final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSelf;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ConstraintProfile;                                 // 0x0014(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x001C(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateControlsFromSkeletalMeshBelow
// 0x0080 (0x0080 - 0x0000)
struct PhysicsControlComponent_CreateControlsFromSkeletalMeshBelow final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSelf;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsControlType                           ControlType;                                       // 0x0011(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0018(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0068(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.CreateNamedBodyModifier
// 0x0038 (0x0038 - 0x0000)
struct PhysicsControlComponent_CreateNamedBodyModifier final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         MeshComponent;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyModifierData;                                  // 0x0020(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.CreateNamedControl
// 0x00F0 (0x00F0 - 0x0000)
struct PhysicsControlComponent_CreateNamedControl final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         ParentMeshComponent;                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         ChildMeshComponent;                                // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildBoneName;                                     // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    ControlData;                                       // 0x0028(0x0050)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlTarget                  ControlTarget;                                     // 0x0078(0x0068)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x00E0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.DestroyBodyModifier
// 0x000C (0x000C - 0x0000)
struct PhysicsControlComponent_DestroyBodyModifier final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.DestroyBodyModifiers
// 0x0010 (0x0010 - 0x0000)
struct PhysicsControlComponent_DestroyBodyModifiers final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.DestroyBodyModifiersInSet
// 0x0008 (0x0008 - 0x0000)
struct PhysicsControlComponent_DestroyBodyModifiersInSet final
{
public:
	class FName                                   Set;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.DestroyControl
// 0x000C (0x000C - 0x0000)
struct PhysicsControlComponent_DestroyControl final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.DestroyControls
// 0x0010 (0x0010 - 0x0000)
struct PhysicsControlComponent_DestroyControls final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.DestroyControlsInSet
// 0x0008 (0x0008 - 0x0000)
struct PhysicsControlComponent_DestroyControlsInSet final
{
public:
	class FName                                   Set;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneAngularVelocities
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneAngularVelocities final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneAngularVelocity
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneAngularVelocity final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneOrientation
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneOrientation final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneOrientations
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneOrientations final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBonePosition
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBonePosition final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBonePositions
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBonePositions final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneTransform
// 0x0070 (0x0070 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneTransform final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneTransforms
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneTransforms final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneVelocities
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneVelocities final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.GetCachedBoneVelocity
// 0x0028 (0x0028 - 0x0000)
struct PhysicsControlComponent_GetCachedBoneVelocity final
{
public:
	const class USkeletalMeshComponent*           SkeletalMeshComponent;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.InvokeControlProfile
// 0x0008 (0x0008 - 0x0000)
struct PhysicsControlComponent_InvokeControlProfile final
{
public:
	class FName                                   ProfileName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.ResetBodyModifiersInSetToCachedBoneTransforms
// 0x000C (0x000C - 0x0000)
struct PhysicsControlComponent_ResetBodyModifiersInSetToCachedBoneTransforms final
{
public:
	class FName                                   SetName;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResetToCachedTargetBehavior                  Behavior;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.ResetBodyModifiersToCachedBoneTransforms
// 0x0018 (0x0018 - 0x0000)
struct PhysicsControlComponent_ResetBodyModifiersToCachedBoneTransforms final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EResetToCachedTargetBehavior                  Behavior;                                          // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.ResetBodyModifierToCachedBoneTransform
// 0x000C (0x000C - 0x0000)
struct PhysicsControlComponent_ResetBodyModifierToCachedBoneTransform final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResetToCachedTargetBehavior                  Behavior;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.ResetControlPoint
// 0x000C (0x000C - 0x0000)
struct PhysicsControlComponent_ResetControlPoint final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.SetBodyModifierCollisionType
// 0x000C (0x000C - 0x0000)
struct PhysicsControlComponent_SetBodyModifierCollisionType final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionEnabled                             CollisionType;                                     // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.SetBodyModifierData
// 0x001C (0x001C - 0x0000)
struct PhysicsControlComponent_SetBodyModifierData final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            ModifierData;                                      // 0x0008(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.SetBodyModifierDatas
// 0x0020 (0x0020 - 0x0000)
struct PhysicsControlComponent_SetBodyModifierDatas final
{
public:
	TArray<class FName>                           Names;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            ModifierData;                                      // 0x0010(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.SetBodyModifierDatasInSet
// 0x0018 (0x0018 - 0x0000)
struct PhysicsControlComponent_SetBodyModifierDatasInSet final
{
public:
	class FName                                   Set;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            ModifierData;                                      // 0x0008(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PhysicsControl.PhysicsControlComponent.SetBodyModifierGravityMultiplier
// 0x0010 (0x0010 - 0x0000)
struct PhysicsControlComponent_SetBodyModifierGravityMultiplier final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityMultiplier;                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PhysicsControl.PhysicsControlComponent.SetBodyModifierKinematicTarget
// 0x0040 (0x0040 - 0x0000)
struct PhysicsControlComponent_SetBodyModifierKinematicTarget final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                KinematicTargetPosition;                           // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               KinematicTargetOrienation;                         // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bMakeKinematic;                                    // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
