#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectP

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "ApexDestruction_classes.hpp"
#include "Niagara_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class ProjectP.LGameSubSystem
// 0x0048 (0x0078 - 0x0030)
class ULGameSubSystem : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedSystemData;                                 // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SystemLibraryClass;                                // 0x0058(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                 SystemDataClass;                                   // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 DefaultSystemData;                                 // 0x0068(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InitialPriority;                                   // 0x0070(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LGameSubSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGameSubSystem")
	}
	static class ULGameSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGameSubSystem>();
	}
};
DUMPER7_ASSERTS_ULGameSubSystem;

// Class ProjectP.LFXSystem
// 0x0450 (0x04C8 - 0x0078)
class ULFXSystem final : public ULGameSubSystem
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ALFXSystemData*                         SystemData;                                        // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLSwingSFXTable                        SwingSFXTable;                                     // 0x00A8(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLHitFxTable                           HitFxTable;                                        // 0x0100(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLHitSFXTable                          HitSFXTable;                                       // 0x0108(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLSplashBloodFxTable                   SplashBloodFxTable;                                // 0x0110(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLCameraShakeTable                     CameraShakeTable;                                  // 0x0118(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLSmashFxTable                         SmashFxTable;                                      // 0x0120(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLPhysicalSurfaceFxTable               PhysicalSurfaceFxTable;                            // 0x0128(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLPhysicalSurfaceSoundTable            PhysicalSurfaceSoundTable;                         // 0x0180(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLCharacterSoundTable                  CharacereSDTable;                                  // 0x01D8(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLFxAttachCommonTable                  FxAttachCommonTable;                               // 0x0230(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLWeatherFxTable                       WeatherFxTable;                                    // 0x0238(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLWeatherSoundTable                    WeatherSoundTable;                                 // 0x0240(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLEnvSoundTable                        EnvSoundTable;                                     // 0x0248(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLBladeTrailTable                      BladeTrailTable;                                   // 0x0250(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLSparkFxTable                         SparkFxTable;                                      // 0x0258(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLSparkSoundTable                      SparkSoundTable;                                   // 0x02B0(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLRepulseFxTable                       RepulseFxTable;                                    // 0x0308(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLRepulseSoundTable                    RepulseSoundTable;                                 // 0x0360(0x0058)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLSoundCueTable                        SoundCueTable;                                     // 0x03B8(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FLHitLevelTable                        HitLevelTable;                                     // 0x03C0(0x0008)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLPlaySoundNotify_TimeChecker          PlaySoundNotify_TimeChecker;                       // 0x03D0(0x0058)(NativeAccessSpecifierPublic)
	TMap<class FString, class UFXSystemComponent*> SpawnedFxSystemComponentHolder;                   // 0x0428(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class FString, class UAudioComponent*>   SpawnedAudioComponentHolder;                       // 0x0478(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	void DetachEffectHardly(struct FLAttachedEffectSet* Attached);
	void DoFrenzyModeMV(class ALCharacter* InTarget, bool bFrenzyMode);
	void DoHitEffect(const struct FLHitFXPlayData& HitFXPlayData);
	void DoSmashEffect(const struct FLSmashFXPlayData& SmashFxPlayData);
	void DoSocketTracerHitEffect_FX(class FName EventName, const struct FTransform& HitTransform, ELPhysicalSurfaceType AttackerPhysicalSurface, ELPhysicalSurfaceType GroundPhysicalSurface);
	void DoSocketTracerHitEffect_SFX(class FName EventName, const struct FTransform& HitTransform, ELPhysicalSurfaceType AttackerPhysicalSurface, ELPhysicalSurfaceType GroundPhysicalSurface);
	void DoWeaponBladeDestroyEffect(const struct FVector& Location);
	TSoftObjectPtr<class ULMaterialVarying> GetWeaponMaterialVarying(class FName MaterialFxCodename);
	class UNiagaraSystem* GetWeaponTrailElementFX(class FName ElementFXCodename);
	void OnBeginTalk();
	void OnDetachNiagaraDelegate(class UNiagaraComponent* InNiagaraComp);
	void OnDetachParticleDelegate(class UParticleSystemComponent* InParticleComp);
	void OnEndTalk();
	void OnFuryAttack(class ALNPCCharacter* InTarget);
	void OnParalyzationOcurred(class AActor* Victim);
	void OnPulseRecharged();
	void OnTorsionCoilPostProcess();
	void SetFatalIndicatorState(class FName IndicatorKey, class ALCharacter* TargetActor, ELFatalIndicatorState PrevState, ELFatalIndicatorState CurrentState, const struct FTransform& FxTransform);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LFXSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LFXSystem")
	}
	static class ULFXSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULFXSystem>();
	}
};
DUMPER7_ASSERTS_ULFXSystem;

// Class ProjectP.LActPayloadBase
// 0x0008 (0x0030 - 0x0028)
class ULActPayloadBase : public UObject
{
public:
	class FName                                   CodeName;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LActPayloadBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LActPayloadBase")
	}
	static class ULActPayloadBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActPayloadBase>();
	}
};
DUMPER7_ASSERTS_ULActPayloadBase;

// Class ProjectP.LSpot
// 0x00B0 (0x02D0 - 0x0220)
class ALSpot : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ELSpotType                                    SpotType;                                          // 0x0228(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OwnerLevelName;                                    // 0x022C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceId;                                        // 0x0234(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpotUniqueID;                                      // 0x0238(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpotCodeName;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldEventCodeName;                                // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ActorSpawnable;                                    // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnDistanceScale;                                // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnDistanceScaleByCode;                          // 0x0260(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpotVolumeOverlapCount;                            // 0x0264(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIncludeSpotVolume : 1;                            // 0x0268(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTouchedTalker : 1;                                // 0x0268(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TalkerCodeName;                                    // 0x026C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLSpotOptionInfo                       OptionInfo;                                        // 0x0274(0x0001)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLPreloadBox                           PreloadInstance;                                   // 0x0278(0x0030)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x11];                                     // 0x02A8(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          ReserveActorSpawn;                                 // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReserveActorDespawn;                               // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpotMatchInfoPtr                      SpotMatchInfo;                                     // 0x02C0(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          CheckedSpotMatchInfo;                              // 0x02C8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResultSpotMatchInfo;                               // 0x02C9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELPreloadSpotSetting                          PreloadSpotSetting;                                // 0x02CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LSpot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LSpot")
	}
	static class ALSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALSpot>();
	}
};
DUMPER7_ASSERTS_ALSpot;

// Class ProjectP.LPropSpot
// 0x0088 (0x0358 - 0x02D0)
class ALPropSpot : public ALSpot
{
public:
	int32                                         PropState;                                         // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SaveFlag;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RespawnFlag;                                       // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLLinkedPropInfo>               LinkedPropInfoList;                                // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	TArray<struct FLLinkedNpcSpot>                LinkedNpcSpotList;                                 // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	class ULPropComponent*                        PropComponent;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULWorldEventComponent*                  WorldEventComponent;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        SpotSoundComponent;                                // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropInteractCollisionComponent*       InteractCollisionComponent;                        // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropInteractStartComponent*           InteractStartComponent;                            // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropSoundLocationComponent*           SoundLocationComponent;                            // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReservedLinkedState;                               // 0x0338(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ALPropSpot* TargetPropSpot)> OnSpawnedActor;                 // 0x0340(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChangePropStateFromLevelObject(int32 TargetState);
	void OnCheckLinkedNpcSpotFromLevelObject(ELLinkedNpcSpotExecuteType ExecuteType);
	void OnCheckNextPropStateFromLevelObject();
	void OnComponentBeginOverlapPropVolume(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnComponentEndOverlapPropVolume(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LPropSpot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LPropSpot")
	}
	static class ALPropSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALPropSpot>();
	}
};
DUMPER7_ASSERTS_ALPropSpot;

// Class ProjectP.LBossRoomSpot
// 0x0078 (0x03D0 - 0x0358)
class ALBossRoomSpot final : public ALPropSpot
{
public:
	TArray<class ALPropShapeObjectSpot*>          FogGateSpotList;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ALPropDoorSpot*                         BossDoorSpot;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALPropShapeObjectSpot*                  BossDoorShapeObjectSpot;                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ALNPCSpot*>                      BossNpcSpotList;                                   // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ALPropHelpMateSpot*                     PropHelpMateSpot;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALNPCSpot*                              NPCHelpMateSpot;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropVolumeComponent*                  PC_ErgoDrop_Fix_Volume;                            // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        PC_ErgoDrop_Fix_Pos;                               // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BossNpcCodeName;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          BossIsDead;                                        // 0x03B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsPlayerInVolume;                                  // 0x03B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          NpcDefaultState;                                   // 0x03B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          OnDeadBossUIEvent;                                 // 0x03B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ALPropSpot>              ControlledBossDoor;                                // 0x03B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckDefaultStatus;                                // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DefaultActorSpawnableList;                         // 0x03C0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnDeadRewardUseOtherSystem(class AActor* TargetActor);
	void OnDeadSpawnNpc(class ALNPCSpot* TargetNpcSpot);
	void OnSpawnedActor(class ALPropSpot* TargetPropSpot);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBossRoomSpot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBossRoomSpot")
	}
	static class ALBossRoomSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALBossRoomSpot>();
	}
};
DUMPER7_ASSERTS_ALBossRoomSpot;

// Class ProjectP.LDialogDebugInfo
// 0x0060 (0x0088 - 0x0028)
class ULDialogDebugInfo final : public UObject
{
public:
	class FName                                   NPCCodeName;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TalkerCodeName;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLSingleDialogDebugInfo                Main;                                              // 0x0038(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FLSingleDialogDebugInfo>        Menu;                                              // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	class FString ToString() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LDialogDebugInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LDialogDebugInfo")
	}
	static class ULDialogDebugInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULDialogDebugInfo>();
	}
};
DUMPER7_ASSERTS_ULDialogDebugInfo;

// Class ProjectP.LDurableAbnormalBPFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class ULDurableAbnormalBPFuncLibrary final : public UObject
{
public:
	static struct FAbnormalStateCommonInfoPtr GetInfo(const struct FLDurableAbnormalBPPtr& In);
	static int64 GetUniqueId(const struct FLDurableAbnormalBPPtr& In);

	int32 GetRemainDuration(const struct FLDurableAbnormalBPPtr& In);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LDurableAbnormalBPFuncLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LDurableAbnormalBPFuncLibrary")
	}
	static class ULDurableAbnormalBPFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULDurableAbnormalBPFuncLibrary>();
	}
};
DUMPER7_ASSERTS_ULDurableAbnormalBPFuncLibrary;

// Class ProjectP.LAnimNotifyStateBase
// 0x0010 (0x0040 - 0x0030)
class ULAnimNotifyStateBase : public UAnimNotifyState
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Enabled;                                           // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAnimNotifyStateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAnimNotifyStateBase")
	}
	static class ULAnimNotifyStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotifyStateBase>();
	}
};
DUMPER7_ASSERTS_ULAnimNotifyStateBase;

// Class ProjectP.LAnimNotifyState_Reset_PralyzeGroggy
// 0x0008 (0x0048 - 0x0040)
class ULAnimNotifyState_Reset_PralyzeGroggy final : public ULAnimNotifyStateBase
{
public:
	bool                                          Groggy;                                            // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAnimNotifyState_Reset_PralyzeGroggy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAnimNotifyState_Reset_PralyzeGroggy")
	}
	static class ULAnimNotifyState_Reset_PralyzeGroggy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotifyState_Reset_PralyzeGroggy>();
	}
};
DUMPER7_ASSERTS_ULAnimNotifyState_Reset_PralyzeGroggy;

// Class ProjectP.LBTComposite_Bool
// 0x0000 (0x0090 - 0x0090)
class ULBTComposite_Bool final : public UBTCompositeNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBTComposite_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBTComposite_Bool")
	}
	static class ULBTComposite_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTComposite_Bool>();
	}
};
DUMPER7_ASSERTS_ULBTComposite_Bool;

// Class ProjectP.LActPayload_HitAnim
// 0x0150 (0x0180 - 0x0030)
class ULActPayload_HitAnim final : public ULActPayloadBase
{
public:
	class AActor*                                 Attacker;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLHitInfo                              HitInfo;                                           // 0x0038(0x0140)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          Cached_IsBackHit;                                  // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LActPayload_HitAnim")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LActPayload_HitAnim")
	}
	static class ULActPayload_HitAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActPayload_HitAnim>();
	}
};
DUMPER7_ASSERTS_ULActPayload_HitAnim;

// Class ProjectP.LAbnormalCalculator
// 0x0008 (0x0030 - 0x0028)
class ULAbnormalCalculator final : public UObject
{
public:
	TWeakObjectPtr<class ALCharacter>             OwnerCharacter;                                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAbnormalCalculator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAbnormalCalculator")
	}
	static class ULAbnormalCalculator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAbnormalCalculator>();
	}
};
DUMPER7_ASSERTS_ULAbnormalCalculator;

// Class ProjectP.LHumanitySystem
// 0x0040 (0x00B8 - 0x0078)
class ULHumanitySystem final : public ULGameSubSystem
{
public:
	class ULHumanityDB*                           HumanityDB;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHumanizationBuffAlterInfoPtr& BuffAlterInfo)> OnSatisfiedBuffAlter; // 0x0080(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FHumanizationBuffAddInfoPtr>    Applied_BuffAdd;                                   // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHumanityAcquisitionPopupEnded();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LHumanitySystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LHumanitySystem")
	}
	static class ULHumanitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULHumanitySystem>();
	}
};
DUMPER7_ASSERTS_ULHumanitySystem;

// Class ProjectP.LAbnormalComponent
// 0x0130 (0x01E0 - 0x00B0)
class ULAbnormalComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ALCharacter>             OwnerCharacter;                                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULAbnormalCalculator*                   AbnormalCalculator;                                // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLAbnormalFromOther>            AppliedFromOthers;                                 // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsApply, class FName AbnormalCodeName)> OnApplyRunningAbnormal; // 0x0108(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0xC8];                                     // 0x0118(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildupHitBP(const struct FLCalcBuildupData& InBuildupData);
	TArray<struct FLCalcBuildupData> CalcDirectBuildupHitByHit(const struct FLHitInfo& InHitInfo, int32 InSkillBuildupDamage, int32 InFireBuildupDamage, int32 InElectricBuildupDamage, int32 InAcidBuildupDamage);
	int32 GetAppliedAbnormalMaxDurationByUniqueId(int64 InAbnormalUniqueId);
	int32 GetAppliedAbnormalRemainDurationByUniqueId(int64 InAbnormalUniqueId);
	void OnCaptureMoment(class AActor* Owner, const struct FMomentConditionCaptureInfo& Capture);
	void OnChooseOtherWeapon(const struct FLEquipItemSlot& EquipSlot);
	void OnPlayHideFX(bool IsHide);
	void OnRemoveAbnormalNiagaraFX(class UNiagaraComponent* InNiagaraComp);
	void OnRemoveAbnormalParticleFX(class UParticleSystemComponent* InParticleComp);
	void OnSatisfiedBuffAlter(const struct FHumanizationBuffAlterInfoPtr& InActiveBuffAlterInfo);
	int64 PutOn(const class FName& InAbnormalCodeName, bool ForceNewAbnormal);
	int64 PutOnByPayload(const class FName& InAbnormalCodeName, const struct FLAbnormalPayload& InPayload);
	int64 PutOnWithInstigator(const class FName& InAbnormalCodeName, class UObject* InInstigator);
	int64 PutOnWithReason(const class FName& InAbnormalCodeName, const class FName& InReasonCodeName);
	void RequestBroadcast_NPCElementUI();
	void TakeOff(const class FName& InAbnormalCodeName, bool Immediately);
	void TakeOffAllByInstigator(class UObject* InInstigator, bool Immediately);
	void TakeOffByGroup(const class FName& IGroupCodeName, bool Immediately);
	void TakeOffByInstigator(const class FName& InAbnormalCodeName, class UObject* InInstigator, bool Immediately);
	void TakeOffByUniqueId(int64 InAbnormalUniqueId, bool Immediately);

	TArray<struct FLDurableAbnormalBPPtr> GetAppliedAbnormals() const;
	bool IsAppliedAbnormal(const class FName& InAbnormalCodeName) const;
	int32 IsAppliedAbnormalCount(const class FName& InAbnormalCodeName) const;
	bool IsAppliedGroupAbnormal(const class FName& GroupCodename) const;
	bool IsBuildupAbnormal(const class FName& InAbnormalCodeName) const;
	bool IsGaugeAbnormal(const class FName& InAbnormalCodeName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAbnormalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAbnormalComponent")
	}
	static class ULAbnormalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAbnormalComponent>();
	}
};
DUMPER7_ASSERTS_ULAbnormalComponent;

// Class ProjectP.LBTask_BlueprintBase
// 0x0008 (0x00B0 - 0x00A8)
class ULBTask_BlueprintBase final : public UBTTask_BlueprintBase
{
public:
	class ALAIController*                         LAIOwner;                                          // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetBehaivorTreeNodeName();
	void OnPostEditChangeProperty();
	void SetBehaivorTreeNodeName(const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBTask_BlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBTask_BlueprintBase")
	}
	static class ULBTask_BlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTask_BlueprintBase>();
	}
};
DUMPER7_ASSERTS_ULBTask_BlueprintBase;

// Class ProjectP.LObjectDataDB
// 0x0020 (0x0048 - 0x0028)
class ULObjectDataDB final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameDataCharacterSync(class ULCharacterSaveGame* CharacterSaveGame, bool bLoad);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LObjectDataDB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LObjectDataDB")
	}
	static class ULObjectDataDB* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULObjectDataDB>();
	}
};
DUMPER7_ASSERTS_ULObjectDataDB;

// Class ProjectP.LAchievementSystem
// 0x00C8 (0x0140 - 0x0078)
class ULAchievementSystem final : public ULGameSubSystem
{
public:
	bool                                          bVisibleCompleteUI;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FLAchievementHierarchyInfo> AchievementDB;                              // 0x0080(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<ELCallBackEventType, struct FLAchievementDetailInfoList> AutoCompleteAchievementDB;         // 0x00D0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class FName AchievementCodeName)> OnCompleteAchievement;           // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName AchievementCodeName)> OnCompleteAchievementDetail;     // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	class FString MakeAchievementLog(const class FName& AchievementCodeName);
	void OnSendPlatform(class FName AchievementCodeName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAchievementSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAchievementSystem")
	}
	static class ULAchievementSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAchievementSystem>();
	}
};
DUMPER7_ASSERTS_ULAchievementSystem;

// Class ProjectP.LAnimNotifyState_CameraWork
// 0x0018 (0x0058 - 0x0040)
class ULAnimNotifyState_CameraWork final : public ULAnimNotifyStateBase
{
public:
	class FName                                   CameraWorkName;                                    // 0x0040(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationTime;                                      // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DontStopWhenNotifyEnd;                             // 0x004C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCameraWork*                           CameraWork;                                        // 0x0050(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAnimNotifyState_CameraWork")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAnimNotifyState_CameraWork")
	}
	static class ULAnimNotifyState_CameraWork* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotifyState_CameraWork>();
	}
};
DUMPER7_ASSERTS_ULAnimNotifyState_CameraWork;

// Class ProjectP.LBTask_Test
// 0x0018 (0x0088 - 0x0070)
class ULBTask_Test final : public UBTTaskNode
{
public:
	EBTNodeResult                                 ResultType;                                        // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProgressingTime;                                   // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVLogToEachTask;                                   // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALAIController*                         LAIOwner;                                          // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBTask_Test")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBTask_Test")
	}
	static class ULBTask_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTask_Test>();
	}
};
DUMPER7_ASSERTS_ULBTask_Test;

// Class ProjectP.LActionClass
// 0x0000 (0x0028 - 0x0028)
class ULActionClass final : public UObject
{
public:
	static class FName ULActionClass_Common();
	static class FName ULActionClass_CommonMontage();
	static class FName ULActionClass_Dialoging();
	static class FName ULActionClass_Die();
	static class FName ULActionClass_DMG_STAND();
	static class FName ULActionClass_Down_Away();
	static class FName ULActionClass_Down_Drag();
	static class FName ULActionClass_Down_Stamp();
	static class FName ULActionClass_Down_Up();
	static class FName ULActionClass_Draw_Weapon();
	static class FName ULActionClass_Falling();
	static class FName ULActionClass_FatalAttack();
	static class FName ULActionClass_FatalAttack_Victim();
	static class FName ULActionClass_FatalAttack_Victim_BeforeHit();
	static class FName ULActionClass_FatalAttack_Victim_End();
	static class FName ULActionClass_Game_Start();
	static class FName ULActionClass_GetUpDash();
	static class FName ULActionClass_Grab();
	static class FName ULActionClass_Grabbed();
	static class FName ULActionClass_GrabRelease();
	static class FName ULActionClass_Grinder_Element();
	static class FName ULActionClass_Groggy();
	static class FName ULActionClass_Guard();
	static class FName ULActionClass_Guard_Break();
	static class FName ULActionClass_Guard_Hit_Heavy();
	static class FName ULActionClass_Guard_Hit_Normal();
	static class FName ULActionClass_Guard_Reflect();
	static class FName ULActionClass_Guard_Repulse();
	static class FName ULActionClass_IdleTurn();
	static class FName ULActionClass_IdleTurnEnd();
	static class FName ULActionClass_Interaction();
	static class FName ULActionClass_Jump();
	static class FName ULActionClass_KnockBack();
	static class FName ULActionClass_Landing();
	static class FName ULActionClass_Multiple();
	static class FName ULActionClass_None();
	static class FName ULActionClass_NpcGuard_Break();
	static class FName ULActionClass_NpcGuard_Hit();
	static class FName ULActionClass_NpcGuard_Hit_Repulse();
	static class FName ULActionClass_Object_Repulse();
	static class FName ULActionClass_Paralyzation();
	static class FName ULActionClass_Parry();
	static class FName ULActionClass_Put_Weapon();
	static class FName ULActionClass_SkillFailed();
	static class FName ULActionClass_SlaveArm();
	static class FName ULActionClass_SlaveArm_Visual_Idle();
	static class FName ULActionClass_SpawnIdle();
	static class FName ULActionClass_Sprint();
	static class FName ULActionClass_Sprint_Exhausted();
	static class FName ULActionClass_Sprint_TurnAround();
	static class FName ULActionClass_StopRunning();
	static class FName ULActionClass_StopSprint();
	static class FName ULActionClass_Teleport_End();
	static class FName ULActionClass_Teleport_Start();
	static class FName ULActionClass_ToughSpecialHit();
	static class FName ULActionClass_TurnAround();
	static class FName ULActionClass_Use_Item();
	static class FName ULActionClass_Weapon_Change();
	static class FName ULActionClass_Wire_Following();
	static class FName ULActionClass_Wire_Hit();
	static class FName ULActionClass_Wire_Pulling();
	static class FName ULActionClass_WireAction();
	static class FName ULActionClass_WireJumpSmash();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LActionClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LActionClass")
	}
	static class ULActionClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActionClass>();
	}
};
DUMPER7_ASSERTS_ULActionClass;

// Class ProjectP.LBTComposite_ForceSequence
// 0x0000 (0x0090 - 0x0090)
class ULBTComposite_ForceSequence final : public UBTCompositeNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBTComposite_ForceSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBTComposite_ForceSequence")
	}
	static class ULBTComposite_ForceSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTComposite_ForceSequence>();
	}
};
DUMPER7_ASSERTS_ULBTComposite_ForceSequence;

// Class ProjectP.LMonologControl
// 0x0028 (0x0050 - 0x0028)
class ULMonologControl final : public UObject
{
public:
	bool                                          PlayingFromInteractCollision;                      // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogInfoPtr                         Monolog;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         RepeatCount;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RepeatTimer;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PendingStop;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetScriptText();
	void OnCompleteSingleMonologPlay();
	void PlayRepeat();

	bool IsValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LMonologControl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LMonologControl")
	}
	static class ULMonologControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULMonologControl>();
	}
};
DUMPER7_ASSERTS_ULMonologControl;

// Class ProjectP.LActPayload_UseItem
// 0x0010 (0x0040 - 0x0030)
class ULActPayload_UseItem final : public ULActPayloadBase
{
public:
	class ULItem*                                 Item;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UseCount;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELItemUseOccurredFrom                         ItemUsedFrom;                                      // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPassedSlavearmAlterProcess;                      // 0x003D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LActPayload_UseItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LActPayload_UseItem")
	}
	static class ULActPayload_UseItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActPayload_UseItem>();
	}
};
DUMPER7_ASSERTS_ULActPayload_UseItem;

// Class ProjectP.LAnimNotifyState_ApplyInput_Parrying
// 0x0000 (0x0040 - 0x0040)
class ULAnimNotifyState_ApplyInput_Parrying final : public ULAnimNotifyStateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LAnimNotifyState_ApplyInput_Parrying")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LAnimNotifyState_ApplyInput_Parrying")
	}
	static class ULAnimNotifyState_ApplyInput_Parrying* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotifyState_ApplyInput_Parrying>();
	}
};
DUMPER7_ASSERTS_ULAnimNotifyState_ApplyInput_Parrying;

// Class ProjectP.LBTreeFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class ULBTreeFuncLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector GetBlackboardValueAsLocation(class UBTNode* NodeOwner, const struct FBlackboardKeySelector& Key);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBTreeFuncLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBTreeFuncLibrary")
	}
	static class ULBTreeFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTreeFuncLibrary>();
	}
};
DUMPER7_ASSERTS_ULBTreeFuncLibrary;

// Class ProjectP.LActPayload_Interaction
// 0x0010 (0x0040 - 0x0030)
class ULActPayload_Interaction final : public ULActPayloadBase
{
public:
	TScriptInterface<class ILInteractInterface>   InteractingComponent;                              // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LActPayload_Interaction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LActPayload_Interaction")
	}
	static class ULActPayload_Interaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActPayload_Interaction>();
	}
};
DUMPER7_ASSERTS_ULActPayload_Interaction;

// Class ProjectP.LBTreeStateMachineData
// 0x0050 (0x0080 - 0x0030)
class ULBTreeStateMachineData final : public UDataAsset
{
public:
	TMap<class FName, struct FLBTreeState>        States;                                            // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LBTreeStateMachineData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LBTreeStateMachineData")
	}
	static class ULBTreeStateMachineData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTreeStateMachineData>();
	}
};
DUMPER7_ASSERTS_ULBTreeStateMachineData;

// Class ProjectP.LReasonForDeathInfo
// 0x01D8 (0x0200 - 0x0028)
class ULReasonForDeathInfo final : public UObject
{
public:
	TWeakObjectPtr<class AActor>                  DeadBody;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deadtime;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLHitInfo                              DieCauseHitInfo;                                   // 0x0038(0x0140)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Murderer;                                          // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BodyExplode;                                       // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_ForcedDieActionByFalling;                     // 0x0184(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELDieCauseType                                DieCauseType;                                      // 0x018C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAllowLieDying;                                   // 0x018D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentActionClassCodeName;                        // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurrentCommonActionMontage;                        // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELSkillHitType                                LastSkillHitType;                                  // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NpcAssetTableCodeName;                             // 0x01A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActionGroupTableCodeName;                          // 0x01AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NPCCodeName;                                       // 0x01B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OverrideDieMontageCodeName;                        // 0x01BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
