#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystem

#include "Basic.hpp"

#include "QuestSystem_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class QuestSystem.BTDecorator_CanAcceptQuest
// 0x0030 (0x0098 - 0x0068)
class UBTDecorator_CanAcceptQuest final : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                 QuestManager;                                      // 0x0068(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CanAcceptQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CanAcceptQuest")
	}
	static class UBTDecorator_CanAcceptQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CanAcceptQuest>();
	}
};

// Class QuestSystem.BTDecorator_CanAddProgressToTask
// 0x0068 (0x00D0 - 0x0068)
class UBTDecorator_CanAddProgressToTask final : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                 QuestManager;                                      // 0x0068(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 IsTaskProgressAdded;                               // 0x0090(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProgressLesserThan;                                // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CanAddProgressToTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CanAddProgressToTask")
	}
	static class UBTDecorator_CanAddProgressToTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CanAddProgressToTask>();
	}
};

// Class QuestSystem.BTDecorator_CanCompleteQuest
// 0x0030 (0x0098 - 0x0068)
class UBTDecorator_CanCompleteQuest final : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                 QuestManager;                                      // 0x0068(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CanCompleteQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CanCompleteQuest")
	}
	static class UBTDecorator_CanCompleteQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CanCompleteQuest>();
	}
};

// Class QuestSystem.BTTask_AcceptQuest
// 0x0030 (0x00A0 - 0x0070)
class UBTTask_AcceptQuest final : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                 QuestManager;                                      // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_AcceptQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_AcceptQuest")
	}
	static class UBTTask_AcceptQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_AcceptQuest>();
	}
};

// Class QuestSystem.BTTask_AddProgressToQuestTask
// 0x0068 (0x00D8 - 0x0070)
class UBTTask_AddProgressToQuestTask final : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                 QuestManager;                                      // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TaskProgressAdded;                                 // 0x0098(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProgressToAdd;                                     // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFailedOnCompletion;                              // 0x00D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_AddProgressToQuestTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_AddProgressToQuestTask")
	}
	static class UBTTask_AddProgressToQuestTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_AddProgressToQuestTask>();
	}
};

// Class QuestSystem.BTTask_CompleteQuest
// 0x0038 (0x00A8 - 0x0070)
class UBTTask_CompleteQuest final : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                 QuestManager;                                      // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFailed;                                          // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_CompleteQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_CompleteQuest")
	}
	static class UBTTask_CompleteQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_CompleteQuest>();
	}
};

// Class QuestSystem.Quest
// 0x00F0 (0x0190 - 0x00A0)
class UQuest : public UActorComponent
{
public:
	class FString                                 QuestID;                                           // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   ShortDescription;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   LongDescription;                                   // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextParams;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntParams;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatParams;                                       // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  BoolParams;                                        // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     TransformParams;                                   // 0x0120(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorParams;                                      // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsRepeatable;                                      // 0x0140(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckRequirementsBeforeAccept;                     // 0x0141(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckRequirementsBeforeComplete;                   // 0x0142(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckDelayBeforeRepeat;                            // 0x0143(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AcceptAllTaskRewardsOnComplete;                    // 0x0144(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RequiredAmountOfTasksToComplete;                   // 0x0148(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DelayBeforeRepeatInSeconds;                        // 0x014C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxRepeatCount;                                    // 0x0150(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseTimeLimit;                                      // 0x0154(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldFailIfTimeExceed;                            // 0x0155(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SecondsToComplete;                                 // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UQuestTask>>         Tasks;                                             // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestRequirement>>  Requirements;                                      // 0x0170(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestReward>>       Rewards;                                           // 0x0180(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void OnQuestCompleted(class AActor* Owner);
	void OnQuestFailed(class AActor* Owner);
	void OnQuestStarted(class AActor* Owner);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Quest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Quest")
	}
	static class UQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest>();
	}
};

// Class QuestSystem.QuestManager
// 0x00B8 (0x0158 - 0x00A0)
class UQuestManager final : public UActorComponent
{
public:
	TArray<struct FQuestInternal>                 Quests;                                            // 0x00A0(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuestReward> QuestReward, TSubclassOf<class UQuest> ParentQuest, TSubclassOf<class UQuestTask> ParentTask)> QuestRewardAcceptedEvent; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuestRequirement> QuestRequirement, TSubclassOf<class UQuest> ParentQuest)> QuestRequirementCheckEvent; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuestTaskRequirement> QuestTaskRequirement, TSubclassOf<class UQuest> ParentQuest, TSubclassOf<class UQuestTask> ParentTask)> QuestTaskRequirementCheckEvent; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> Task)> QuestTaskStartedEvent; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> Task)> QuestTaskCompletedEvent; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> Task)> QuestTaskFailedEvent; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> Task)> QuestTaskProgressChangedEvent; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest)> QuestStartedEvent;               // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest)> QuestCompletedEvent;             // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UQuest> Quest)> QuestFailedEvent;                // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          DestroyInstancesAfterOperation;                    // 0x0150(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AcceptAllQuestRewards(TSubclassOf<class UQuest> Quest);
	void AcceptQuest(TSubclassOf<class UQuest> Quest, bool SetAsActiveQuest);
	void AcceptReward(TSubclassOf<class UQuestReward> QuestReward);
	void AddActiveQuest(TSubclassOf<class UQuest> Quest);
	void AddDynamicQuestTaskToQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, bool StartDynamicQuestTaskImmediately);
	void AddDynamicRequirementToQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestRequirement> QuestRequirement);
	void AddDynamicRequirementToQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestTaskRequirement> QuestTaskRequirement);
	void AddDynamicRewardToQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestReward> QuestReward);
	void AddDynamicRewardToQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestReward> QuestTaskReward);
	void AddQuestTaskProgress(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, int32 Progress);
	bool CheckDynamicQuestRequirements(TSubclassOf<class UQuest> Quest);
	bool CheckDynamicQuestTaskRequirements(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask);
	bool CheckQuestRequirement(TSubclassOf<class UQuestRequirement> QuestRequirement);
	bool CheckQuestRequirements(TSubclassOf<class UQuest> Quest);
	bool CheckQuestTaskRequirement(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTaskRequirement> QuestTaskRequirement);
	bool CheckQuestTaskRequirements(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask);
	void ClientUpdateQuestRemainingSecondsOnClient(TSubclassOf<class UQuest> Quest, int32 Seconds);
	void ClientUpdateQuestTaskRemainingSeconds(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, int32 Seconds);
	void CompleteQuest(TSubclassOf<class UQuest> Quest, bool IsFailed);
	void CompleteQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, bool IsFailed);
	void DestroyQuestSystemTemporaryInstances();
	void DropQuest(TSubclassOf<class UQuest> Quest);
	TArray<struct FQuestInternal> GetQuestsForSave();
	void LoadQuests(const TArray<struct FQuestInternal>& QuestsToLoad);
	void RemoveActiveQuest(TSubclassOf<class UQuest> Quest);
	void RemoveDynamicQuestTaskFromQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask);
	void RemoveDynamicRequirementFromQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestRequirement> QuestRequirement);
	void RemoveDynamicRequirementFromQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestTaskRequirement> QuestTaskRequirement);
	void RemoveDynamicRewardFromQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestReward> QuestReward);
	void RemoveDynamicRewardFromQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestReward> QuestTaskReward);
	void ResetQuestManager();
	void RunQuestTaskTimer(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, const struct FTimerHandle& QuestTimerHandle);
	void RunQuestTimer(TSubclassOf<class UQuest> Quest, const struct FTimerHandle& QuestTimerHandle);
	void ServerAcceptAllQuestRewards(TSubclassOf<class UQuest> Quest);
	void ServerAcceptQuest(TSubclassOf<class UQuest> Quest, bool SetAsActiveQuest);
	void ServerAcceptReward(TSubclassOf<class UQuestReward> QuestReward);
	void ServerAddDynamicQuestTaskToQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, bool StartDynamicQuestTaskImmediately);
	void ServerAddDynamicRequirementToQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestRequirement> QuestRequirement);
	void ServerAddDynamicRequirementToQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestTaskRequirement> QuestTaskRequirement);
	void ServerAddDynamicRewardToQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestReward> QuestReward);
	void ServerAddDynamicRewardToQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestReward> QuestTaskReward);
	void ServerAddQuestTaskProgress(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, int32 Progress);
	void ServerCompleteQuest(TSubclassOf<class UQuest> Quest, bool IsFailed);
	void ServerCompleteQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, bool IsFailed);
	void ServerDestroyQuestSystemTemporaryInstances();
	void ServerDropQuest(TSubclassOf<class UQuest> Quest);
	void ServerLoadQuests(const TArray<struct FQuestInternal>& QuestsToLoad);
	void ServerRemoveDynamicQuestTaskFromQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask);
	void ServerRemoveDynamicRequirementFromQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestRequirement> QuestRequirement);
	void ServerRemoveDynamicRequirementFromQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestTaskRequirement> QuestTaskRequirement);
	void ServerRemoveDynamicRewardFromQuest(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestReward> QuestReward);
	void ServerRemoveDynamicRewardFromQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, TSubclassOf<class UQuestReward> QuestTaskReward);
	void ServerResetQuestManager();
	void ServerStartAvailableQuestTasks(TSubclassOf<class UQuest> Quest);
	void ServerStartQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask);
	void SetActiveQuest(TSubclassOf<class UQuest> Quest);
	void StartAvailableQuestTasks(TSubclassOf<class UQuest> Quest);
	void StartQuestTask(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask);
	void UpdateQuestRemainingSecondsOnClient(TSubclassOf<class UQuest> Quest, int32 Seconds);
	void UpdateQuestTaskRemainingSeconds(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask, int32 Seconds);

	TSubclassOf<class UQuest> GetAcceptedQuestById(const class FString& QuestID) const;
	TArray<TSubclassOf<class UQuest>> GetAcceptedQuests() const;
	TSubclassOf<class UQuest> GetActiveQuest() const;
	TArray<TSubclassOf<class UQuest>> GetActiveQuests() const;
	TArray<TSubclassOf<class UQuestTask>> GetAllQuestTasks(TSubclassOf<class UQuest> Quest) const;
	TArray<TSubclassOf<class UQuestTask>> GetAvailableQuestTasks(TSubclassOf<class UQuest> Quest) const;
	TArray<TSubclassOf<class UQuest>> GetCompletedQuests() const;
	TSubclassOf<class UQuestTask> GetExistingQuestTaskById(TSubclassOf<class UQuest> Quest, const class FString& QuestTaskId) const;
	TArray<TSubclassOf<class UQuest>> GetFailedQuests() const;
	TArray<TSubclassOf<class UQuestRequirement>> GetQuestRequirements(TSubclassOf<class UQuest> Quest) const;
	TArray<TSubclassOf<class UQuestReward>> GetQuestRewards(TSubclassOf<class UQuest> Quest) const;
	int32 GetQuestSecondsRemaining(TSubclassOf<class UQuest> Quest) const;
	int32 GetQuestTaskCurrentProgress(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;
	TArray<TSubclassOf<class UQuestTaskRequirement>> GetQuestTaskRequirements(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;
	TArray<TSubclassOf<class UQuestReward>> GetQuestTaskRewards(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;
	int32 GetQuestTaskSecondsRemaining(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;
	bool IsAllQuestTasksCompleted(TSubclassOf<class UQuest> Quest) const;
	bool IsQuestAccepted(TSubclassOf<class UQuest> Quest) const;
	bool IsQuestCompleted(TSubclassOf<class UQuest> Quest) const;
	bool IsQuestFailed(TSubclassOf<class UQuest> Quest) const;
	bool IsQuestTaskAvailable(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;
	bool IsQuestTaskCompleted(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;
	bool IsQuestTaskFailed(TSubclassOf<class UQuest> Quest, TSubclassOf<class UQuestTask> QuestTask) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QuestManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestManager")
	}
	static class UQuestManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestManager>();
	}
};

// Class QuestSystem.QuestRequirement
// 0x0080 (0x0120 - 0x00A0)
class UQuestRequirement final : public UActorComponent
{
public:
	class FString                                 QuestRequirementId;                                // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextParams;                                        // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntParams;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatParams;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  BoolParams;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     TransformParams;                                   // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorParams;                                      // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuest>>             RequiredQuests;                                    // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void OnQuestRequirementCheck(class AActor* Owner, bool* Result, TSubclassOf<class UQuest> ParentQuest);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QuestRequirement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestRequirement")
	}
	static class UQuestRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestRequirement>();
	}
};

// Class QuestSystem.QuestReward
// 0x0070 (0x0110 - 0x00A0)
class UQuestReward : public UActorComponent
{
public:
	class FString                                 QuestRewardId;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextParams;                                        // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntParams;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatParams;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  BoolParams;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     TransformParams;                                   // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorParams;                                      // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void OnQuestRewardAccepted(class AActor* Owner, TSubclassOf<class UQuest> ParentQuest, TSubclassOf<class UQuestTask> ParentTask);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QuestReward")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestReward")
	}
	static class UQuestReward* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestReward>();
	}
};

// Class QuestSystem.QuestTask
// 0x00E0 (0x0180 - 0x00A0)
class UQuestTask : public UActorComponent
{
public:
	class FString                                 QuestTaskId;                                       // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   ShortDescription;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   LongDescription;                                   // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextParams;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntParams;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatParams;                                       // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  BoolParams;                                        // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     TransformParams;                                   // 0x0120(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorParams;                                      // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         ProgressRequired;                                  // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOptional;                                        // 0x0144(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FailQuestWhenFailed;                               // 0x0145(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartAvailableQuestTasksAfterCompletion;           // 0x0146(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AcceptRewardOnComplete;                            // 0x0147(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckRequirementsBeforeStart;                      // 0x0148(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckRequirementsBeforeComplete;                   // 0x0149(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UQuestTaskRequirement>> Requirements;                                   // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestReward>>       Rewards;                                           // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          UseTimeLimit;                                      // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldFailIfTimeExceed;                            // 0x0171(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldCompleteQuestIfTimeExceed;                   // 0x0172(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldFailQuestIfTimeExceed;                       // 0x0173(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableProgressCheckOnCompletion;                  // 0x0174(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SecondsToComplete;                                 // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQuestTaskCompleted(class AActor* Owner, TSubclassOf<class UQuest> ParentQuest);
	void OnQuestTaskFailed(class AActor* Owner, TSubclassOf<class UQuest> ParentQuest);
	void OnQuestTaskProgressChanged(class AActor* Owner, TSubclassOf<class UQuest> ParentQuest, int32 CurrentProgress);
	void OnQuestTaskStarted(class AActor* Owner, TSubclassOf<class UQuest> ParentQuest);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QuestTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestTask")
	}
	static class UQuestTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestTask>();
	}
};

// Class QuestSystem.QuestTaskRequirement
// 0x0080 (0x0120 - 0x00A0)
class UQuestTaskRequirement : public UActorComponent
{
public:
	class FString                                 QuestTaskRequirementId;                            // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextParams;                                        // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 IntParams;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatParams;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  BoolParams;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     TransformParams;                                   // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorParams;                                      // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestTask>>         RequiredQuestTasks;                                // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void OnQuestTaskRequirementCheck(class AActor* Owner, bool* Result, TSubclassOf<class UQuest> ParentQuest, TSubclassOf<class UQuestTask> ParentTask);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QuestTaskRequirement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestTaskRequirement")
	}
	static class UQuestTaskRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestTaskRequirement>();
	}
};

}

