#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QuestSystem_structs.hpp"


namespace SDK::Params
{

// Function QuestSystem.Quest.OnQuestCompleted
// 0x0008 (0x0008 - 0x0000)
struct Quest_OnQuestCompleted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.Quest.OnQuestFailed
// 0x0008 (0x0008 - 0x0000)
struct Quest_OnQuestFailed final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.Quest.OnQuestStarted
// 0x0008 (0x0008 - 0x0000)
struct Quest_OnQuestStarted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AcceptAllQuestRewards
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_AcceptAllQuestRewards final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AcceptQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_AcceptQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetAsActiveQuest;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.AcceptReward
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_AcceptReward final
{
public:
	TSubclassOf<class UQuestReward>               QuestReward;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AddActiveQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_AddActiveQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AddDynamicQuestTaskToQuest
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_AddDynamicQuestTaskToQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartDynamicQuestTaskImmediately;                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.AddDynamicRequirementToQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_AddDynamicRequirementToQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestRequirement>          QuestRequirement;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AddDynamicRequirementToQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_AddDynamicRequirementToQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTaskRequirement>      QuestTaskRequirement;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AddDynamicRewardToQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_AddDynamicRewardToQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestReward;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AddDynamicRewardToQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_AddDynamicRewardToQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestTaskReward;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.AddQuestTaskProgress
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_AddQuestTaskProgress final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Progress;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CheckDynamicQuestRequirements
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_CheckDynamicQuestRequirements final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CheckDynamicQuestTaskRequirements
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_CheckDynamicQuestTaskRequirements final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CheckQuestRequirement
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_CheckQuestRequirement final
{
public:
	TSubclassOf<class UQuestRequirement>          QuestRequirement;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CheckQuestRequirements
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_CheckQuestRequirements final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CheckQuestTaskRequirement
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_CheckQuestTaskRequirement final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTaskRequirement>      QuestTaskRequirement;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CheckQuestTaskRequirements
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_CheckQuestTaskRequirements final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ClientUpdateQuestRemainingSecondsOnClient
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ClientUpdateQuestRemainingSecondsOnClient final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seconds;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ClientUpdateQuestTaskRemainingSeconds
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ClientUpdateQuestTaskRemainingSeconds final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seconds;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CompleteQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_CompleteQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFailed;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.CompleteQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_CompleteQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFailed;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.DropQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_DropQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetQuestsForSave
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetQuestsForSave final
{
public:
	TArray<struct FQuestInternal>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.LoadQuests
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_LoadQuests final
{
public:
	TArray<struct FQuestInternal>                 QuestsToLoad;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RemoveActiveQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_RemoveActiveQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RemoveDynamicQuestTaskFromQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_RemoveDynamicQuestTaskFromQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RemoveDynamicRequirementFromQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_RemoveDynamicRequirementFromQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestRequirement>          QuestRequirement;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RemoveDynamicRequirementFromQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_RemoveDynamicRequirementFromQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTaskRequirement>      QuestTaskRequirement;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RemoveDynamicRewardFromQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_RemoveDynamicRewardFromQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestReward;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RemoveDynamicRewardFromQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_RemoveDynamicRewardFromQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestTaskReward;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RunQuestTaskTimer
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_RunQuestTaskTimer final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           QuestTimerHandle;                                  // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.RunQuestTimer
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_RunQuestTimer final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           QuestTimerHandle;                                  // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAcceptAllQuestRewards
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_ServerAcceptAllQuestRewards final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAcceptQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerAcceptQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetAsActiveQuest;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ServerAcceptReward
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_ServerAcceptReward final
{
public:
	TSubclassOf<class UQuestReward>               QuestReward;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAddDynamicQuestTaskToQuest
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerAddDynamicQuestTaskToQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartDynamicQuestTaskImmediately;                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ServerAddDynamicRequirementToQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerAddDynamicRequirementToQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestRequirement>          QuestRequirement;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAddDynamicRequirementToQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerAddDynamicRequirementToQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTaskRequirement>      QuestTaskRequirement;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAddDynamicRewardToQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerAddDynamicRewardToQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestReward;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAddDynamicRewardToQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerAddDynamicRewardToQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestTaskReward;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerAddQuestTaskProgress
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerAddQuestTaskProgress final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Progress;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ServerCompleteQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerCompleteQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFailed;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ServerCompleteQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerCompleteQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFailed;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.ServerDropQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_ServerDropQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerLoadQuests
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerLoadQuests final
{
public:
	TArray<struct FQuestInternal>                 QuestsToLoad;                                      // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerRemoveDynamicQuestTaskFromQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerRemoveDynamicQuestTaskFromQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerRemoveDynamicRequirementFromQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerRemoveDynamicRequirementFromQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestRequirement>          QuestRequirement;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerRemoveDynamicRequirementFromQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerRemoveDynamicRequirementFromQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTaskRequirement>      QuestTaskRequirement;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerRemoveDynamicRewardFromQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerRemoveDynamicRewardFromQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestReward;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerRemoveDynamicRewardFromQuestTask
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_ServerRemoveDynamicRewardFromQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestReward>               QuestTaskReward;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerStartAvailableQuestTasks
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_ServerStartAvailableQuestTasks final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.ServerStartQuestTask
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_ServerStartQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.SetActiveQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_SetActiveQuest final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.StartAvailableQuestTasks
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_StartAvailableQuestTasks final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.StartQuestTask
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_StartQuestTask final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.UpdateQuestRemainingSecondsOnClient
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_UpdateQuestRemainingSecondsOnClient final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seconds;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.UpdateQuestTaskRemainingSeconds
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_UpdateQuestTaskRemainingSeconds final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seconds;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.GetAcceptedQuestById
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetAcceptedQuestById final
{
public:
	class FString                                 QuestID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetAcceptedQuests
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetAcceptedQuests final
{
public:
	TArray<TSubclassOf<class UQuest>>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetActiveQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_GetActiveQuest final
{
public:
	TSubclassOf<class UQuest>                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetActiveQuests
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetActiveQuests final
{
public:
	TArray<TSubclassOf<class UQuest>>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetAllQuestTasks
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetAllQuestTasks final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestTask>>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetAvailableQuestTasks
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetAvailableQuestTasks final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestTask>>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetCompletedQuests
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetCompletedQuests final
{
public:
	TArray<TSubclassOf<class UQuest>>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetExistingQuestTaskById
// 0x0020 (0x0020 - 0x0000)
struct QuestManager_GetExistingQuestTaskById final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QuestTaskId;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetFailedQuests
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetFailedQuests final
{
public:
	TArray<TSubclassOf<class UQuest>>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetQuestRequirements
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetQuestRequirements final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestRequirement>>  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetQuestRewards
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetQuestRewards final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestReward>>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetQuestSecondsRemaining
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetQuestSecondsRemaining final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.GetQuestTaskCurrentProgress
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetQuestTaskCurrentProgress final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.GetQuestTaskRequirements
// 0x0020 (0x0020 - 0x0000)
struct QuestManager_GetQuestTaskRequirements final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestTaskRequirement>> ReturnValue;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetQuestTaskRewards
// 0x0020 (0x0020 - 0x0000)
struct QuestManager_GetQuestTaskRewards final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UQuestReward>>       ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestManager.GetQuestTaskSecondsRemaining
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_GetQuestTaskSecondsRemaining final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsAllQuestTasksCompleted
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_IsAllQuestTasksCompleted final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsQuestAccepted
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_IsQuestAccepted final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsQuestCompleted
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_IsQuestCompleted final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsQuestFailed
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_IsQuestFailed final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsQuestTaskAvailable
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_IsQuestTaskAvailable final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsQuestTaskCompleted
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_IsQuestTaskCompleted final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestManager.IsQuestTaskFailed
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_IsQuestTaskFailed final
{
public:
	TSubclassOf<class UQuest>                     Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 QuestTask;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestRequirement.OnQuestRequirementCheck
// 0x0018 (0x0018 - 0x0000)
struct QuestRequirement_OnQuestRequirementCheck final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestReward.OnQuestRewardAccepted
// 0x0018 (0x0018 - 0x0000)
struct QuestReward_OnQuestRewardAccepted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuestTask>                 ParentTask;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestTask.OnQuestTaskCompleted
// 0x0010 (0x0010 - 0x0000)
struct QuestTask_OnQuestTaskCompleted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestTask.OnQuestTaskFailed
// 0x0010 (0x0010 - 0x0000)
struct QuestTask_OnQuestTaskFailed final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestTask.OnQuestTaskProgressChanged
// 0x0018 (0x0018 - 0x0000)
struct QuestTask_OnQuestTaskProgressChanged final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentProgress;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function QuestSystem.QuestTask.OnQuestTaskStarted
// 0x0010 (0x0010 - 0x0000)
struct QuestTask_OnQuestTaskStarted final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQuest>                     ParentQuest;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function QuestSystem.QuestTaskRequirement.OnQuestTaskRequirementCheck
// 0x0020 (0x0020 - 0x0000)
struct QuestTaskRequirement_OnQuestTaskRequirementCheck final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
