#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RedpointEOSFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.IsPlayerControllerSpectating
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_IsPlayerControllerSpectating final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.IsRedpointFrameworkFreeEdition
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_IsRedpointFrameworkFreeEdition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetListViewEntrySpacing
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetListViewEntrySpacing final
{
public:
	class UListView*                              InListView;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InEntrySpacing;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RedpointEOSFramework.RedpointFrameworkBlueprintLibrary.SetPlayerControllerSpectating
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkBlueprintLibrary_SetPlayerControllerSpectating final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSpectating;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.BindFriendListSections
// 0x0018 (0x0018 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_BindFriendListSections final
{
public:
	class UTreeView*                              TreeView;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<ERedpointFriendListSectionType>        Sections;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.SetDisplayCachedPlatformFriends
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_SetDisplayCachedPlatformFriends final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.SetIncludeLocalPlayerInPartySection
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_SetIncludeLocalPlayerInPartySection final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.UnbindFriendListSections
// 0x0008 (0x0008 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_UnbindFriendListSections final
{
public:
	class UTreeView*                              TreeView;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.GetPrimaryParty
// 0x0008 (0x0008 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_GetPrimaryParty final
{
public:
	class UParty*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkLocalPlayerSubsystem.IsPrimaryPartyLeader
// 0x0001 (0x0001 - 0x0000)
struct RedpointFrameworkLocalPlayerSubsystem_IsPrimaryPartyLeader final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkSubsystem.FetchAvatar
// 0x0078 (0x0078 - 0x0000)
struct RedpointFrameworkSubsystem_FetchAvatar final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       TargetUserId;                                      // 0x0030(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              Expiration;                                        // 0x0060(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutHasFailed;                                     // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFrameworkSubsystem.GetReleaseVersion
// 0x0010 (0x0010 - 0x0000)
struct RedpointFrameworkSubsystem_GetReleaseVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListAcceptFriendRequestAsyncAction.AcceptFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListAcceptFriendRequestAsyncAction_AcceptFriendRequest final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListAcceptFriendRequestAsyncAction* ReturnValue;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListBlockPlayerAsyncAction.BlockPlayer
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListBlockPlayerAsyncAction_BlockPlayer final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListBlockPlayerAsyncAction* ReturnValue;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanAcceptFriendRequest
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanAcceptFriendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanBlockPlayer
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanBlockPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanInviteToParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanInviteToParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanJoinParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanJoinParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanKickFromParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanKickFromParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanLeaveParty
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanLeaveParty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanPromoteToPartyLeader
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanPromoteToPartyLeader final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanRejectFriendRequest
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanRejectFriendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanRemoveFriend
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanRemoveFriend final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanSendFriendRequest
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanSendFriendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.CanUnblockPlayer
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_CanUnblockPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListEntry.GetSectionType
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListEntry_GetSectionType final
{
public:
	ERedpointFriendListSectionType                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListInviteToPartyAsyncAction.InviteToParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListInviteToPartyAsyncAction_InviteToParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListInviteToPartyAsyncAction* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListJoinPartyAsyncAction.JoinParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListJoinPartyAsyncAction_JoinParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListJoinPartyAsyncAction* ReturnValue;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListKickFromPartyAsyncAction.KickFromParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListKickFromPartyAsyncAction_KickFromParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListKickFromPartyAsyncAction* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListLeavePartyAsyncAction.LeaveParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListLeavePartyAsyncAction_LeaveParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListLeavePartyAsyncAction* ReturnValue;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListPromoteInPartyAsyncAction.PromoteInParty
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListPromoteInPartyAsyncAction_PromoteInParty final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListPromoteInPartyAsyncAction* ReturnValue;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListRejectFriendRequestAsyncAction.RejectFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListRejectFriendRequestAsyncAction_RejectFriendRequest final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListRejectFriendRequestAsyncAction* ReturnValue;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListRemoveFriendAsyncAction.RemoveFriend
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListRemoveFriendAsyncAction_RemoveFriend final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListRemoveFriendAsyncAction* ReturnValue;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListSection.HasAnyEntries
// 0x0001 (0x0001 - 0x0000)
struct RedpointFriendListSection_HasAnyEntries final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListSendFriendRequestAsyncAction.SendFriendRequest
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListSendFriendRequestAsyncAction_SendFriendRequest final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListSendFriendRequestAsyncAction* ReturnValue;                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointFriendListUnblockPlayerAsyncAction.UnblockPlayer
// 0x0010 (0x0010 - 0x0000)
struct RedpointFriendListUnblockPlayerAsyncAction_UnblockPlayer final
{
public:
	class URedpointFriendListEntry*               FriendListEntry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URedpointFriendListUnblockPlayerAsyncAction* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointNotifyUniqueIdInterface.NotifyUniqueNetIdSet
// 0x0038 (0x0038 - 0x0000)
struct RedpointNotifyUniqueIdInterface_NotifyUniqueNetIdSet final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       UniqueID;                                          // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointPartyMember.PartyMemberChanged
// 0x00F0 (0x00F0 - 0x0000)
struct RedpointPartyMember_PartyMemberChanged final
{
public:
	struct FRedpointPartyMemberInfo               PartyMember;                                       // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointStartupScreen.OnLoginFailed
// 0x0020 (0x0020 - 0x0000)
struct RedpointStartupScreen_OnLoginFailed final
{
public:
	class FText                                   LoginError;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnRetryLogin;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointStartupScreen.OnStartupScreenDisplayed
// 0x0010 (0x0010 - 0x0000)
struct RedpointStartupScreen_OnStartupScreenDisplayed final
{
public:
	TDelegate<void()>                             OnStartLogin;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointStartupScreen.UpdateProgressMessage
// 0x0010 (0x0010 - 0x0000)
struct RedpointStartupScreen_UpdateProgressMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function RedpointEOSFramework.RedpointUMGHUD.PostWidgetShown
// 0x0010 (0x0010 - 0x0000)
struct RedpointUMGHUD_PostWidgetShown final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitiallyCreated;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RedpointEOSFramework.RedpointUMGHUD.PreWidgetHidden
// 0x0010 (0x0010 - 0x0000)
struct RedpointUMGHUD_PreWidgetHidden final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPendingDestruction;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

