#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSAuth

#include "Basic.hpp"

#include "RedpointEOSAuth_structs.hpp"


namespace SDK::Params
{

// Function RedpointEOSAuth.EOSUserInterface_EnterDevicePinCode.SetupUserInterface
// 0x0028 (0x0028 - 0x0000)
struct EOSUserInterface_EnterDevicePinCode_SetupUserInterface final
{
public:
	class UEOSUserInterface_EnterDevicePinCode_Context* Context;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VerificationUrl;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PinCode;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSAuth.EOSUserInterface_SignInOrCreateAccount.SetupUserInterface
// 0x0008 (0x0008 - 0x0000)
struct EOSUserInterface_SignInOrCreateAccount_SetupUserInterface final
{
public:
	class UEOSUserInterface_SignInOrCreateAccount_Context* Context;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RedpointEOSAuth.EOSUserInterface_SignInOrCreateAccount_Context.SelectChoice
// 0x0001 (0x0001 - 0x0000)
struct EOSUserInterface_SignInOrCreateAccount_Context_SelectChoice final
{
public:
	EEOSUserInterface_SignInOrCreateAccount_Choice SelectedChoice;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

