#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigBones3_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RigBones3_Skeleton_AnimBlueprint.RigBones3_Skeleton_AnimBlueprint_C
// 0x0A00 (0x0D70 - 0x0370)
class URigBones3_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x03A8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04F0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0510(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0898(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x09C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C10(0x0128)()
	TArray<struct FVector>                        BoneLocation;                                      // 0x0D38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRotator>                       BoneRotation;                                      // 0x0D48(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  BoneInUse;                                         // 0x0D58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UsePhysics;                                        // 0x0D68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ChangeBoneActiveStatus(int32 BoneIndex, bool NewActiveStatus);
	void ChangePhysicsEnabled(bool Enable_);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_31388A76426EAD9C0AB2BBBA245BC3AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_37E2A4904061A5050C5C94A4EB74F40A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_4357D0824315AC96C56898B3982D6344();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_68FFB30346DCC052EC898CAD415ED9B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6E498A584BC6C042617C9B9D7D4220C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6F2AF5C4491EEA0A8D2B5F9D58DDDB4B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_9667BF774CBE7721E12D3E94E1E9F7A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_E6080A494ABF368204DA31A612DB3742();
	void ExecuteUbergraph_RigBones3_Skeleton_AnimBlueprint(int32 EntryPoint);
	void SetupBoneData(int32 Index_0, const struct FVector& Location, const struct FRotator& Rotation);
	void SetupBoneTransform(int32 BoneIndex, const struct FVector& BoneLocation_0, const struct FRotator& BoneRotation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RigBones3_Skeleton_AnimBlueprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigBones3_Skeleton_AnimBlueprint_C")
	}
	static class URigBones3_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigBones3_Skeleton_AnimBlueprint_C>();
	}
};

}

