#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CamoOptions

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_CamoOptions.S_CamoOptions
// 0x0050 (0x0050 - 0x0000)
struct FS_CamoOptions final
{
public:
	class FString                                 CamoName_13_1DEC2A6440B9AD752F51DD8984A93F0F;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>              MaterialInstance_6_6BE66EDD467AFE9BCB09599E1D99A2BB; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              MaterialInstanceDestroyed_17_71824535421789D10D1DEA9937DF431A; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 MaterialSlotID_10_B54E56B2443798D8AD1776B0DD28639E; // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 MaterialSlotIDDestroyed_21_6A173B6543987FD4033A84B009D04C08; // 0x0040(0x0010)(Edit, BlueprintVisible)
};

}

