#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_RadialScanSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_RadialScanSettings.S_RadialScanSettings
// 0x0028 (0x0028 - 0x0000)
struct FS_RadialScanSettings final
{
public:
	class UMaterialInterface*                     Material_2_1061BFB74DC3D2F4DE2721968E50470F;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_5_C18497744374F2BBC07DD69646D76F0C;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LifeTime_14_D0D37AF041017E7C8C58F3B87F3D041B;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartOffset_25_41695C1E456234C7314A0FA89B295C67;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParentSourcePosition_11_CA53805D4F80696AC178E29F90F3FAD3; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParentSourceDirection_13_6DB03B0A4CC3479BA1F52AAAB155DDF4; // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ParentVelocityScale_20_A7A288724FF1C95A1E5A608923928CDC; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityDrag_22_2CADEC3947618F6686A2FABA1CBD5652;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            ExpansionCurve_17_EE8AE7414F1A3C701E75C5833374B43E; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

