#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_RigContent_SFX

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_RigContent_SFX.S_RigContent_SFX
// 0x00C0 (0x00C0 - 0x0000)
struct FS_RigContent_SFX final
{
public:
	TArray<TSoftObjectPtr<class USoundWave>>      A_PneumaticJump_Foley_SFX_Array_37_FFB9B9B746A899238CB69DB1E08A43FD; // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_TacCam_Foley_SFX_Array_36_5711F0724B0CC7432A83FEA27B9DD010; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_DeployabeTurret_Foley_SFX_Array_33_DD77F79A45FC6735C0930F9EF964167F; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_IEDMine_Foley_SFX_Array_35_E906866C4FB0F50697121686177F1BBA; // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_RigLight_Foley_SFX_Array_41_C6AFAAA94B2190C306291986B1B94D8C; // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_SCAR_Foley_SFX_Array_46_AA05455F4AE4470022F939B3C43F815B; // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_LMG_Foly_SFX_Array_48_5CCC9B91467ABD3819B3A2AD0A7CC2B3; // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_RFL_Foley_SFX_Array_50_85A314A243E4F3FCF0D8D28BE2F973F4; // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_SHG_Foley_SFX_Array_52_6201E2FD4BAFB4C86EB93186432F70F0; // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_Container_Foley_SFX_Array_56_797AA88245E727A6FDB63E852DBFE2F7; // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_Water_Foley_SFX_Array_65_AAC8289247249A3090629A9814913E88; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class USoundWave>>      A_Pilot_Foley_SFX_Array_69_DA45F2D54674CB4D31D0EC85971ADF9B; // 0x00B0(0x0010)(Edit, BlueprintVisible)
};

}

