#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ScenarioProperties

#include "Basic.hpp"

#include "E_ScenarioTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ScenarioProperties.S_ScenarioProperties
// 0x0120 (0x0120 - 0x0000)
struct FS_ScenarioProperties final
{
public:
	class FText                                   ScenarioDescription_121_2D02B05B49F207A3283810AB46A751AA; // 0x0000(0x0010)(Edit, BlueprintVisible)
	E_ScenarioTypes                               ScenarioType_51_F51EEFDF4C3B3D4810C6079B081192CB;  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnLoot__36_E37853A7469EBE9DE5BB2C8E77368972;    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinLoot_54_6D00357F4B5CFBCE346330B923F452DC;       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxLoot_56_E96DF52348B3294BB2DA7380D6A3996D;       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeLoot__130_99871F6343348C9861CB02AE86170E8F; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleLootContainers_72_EC42B658404DB82B0CA24FAE747B767A; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftClassPtr<class UClass>>           PossibleLootDangles_73_42BE23C74B5EAB9709791DBF24241C8F; // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnEuropaSquad__1_BF08BD86439F246E6BFE65A4724D1A69; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EuropanExplicitSquad__64_38AF783445CB41DD3A63BBA373082EEF; // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinofEuropans_9_EE4ADDC1481D245EE453D49DA762D560;  // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxofEuropans_11_A812695A45EFEBC2001D18A05079CAAD; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeEuropans__132_006A81D84D6A85E558CAD0A078C89169; // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleEuropans_74_16A3364D434EE989DB00578ABD64B070; // 0x0050(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnEurasianSquad__3_6B9285254421F0C0C57787A16EB48D68; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EurasianExplicitSquad__65_F2E3001347EFD68EB004BC91C6C493F7; // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinofEurasians_16_973CC2AD409D6F596BF899BAF7771836; // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxofEurasians_17_2DDF17904A70A5CE4EDD1DB0355CDC34; // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeEurasians__131_623E28054435E0C4ABEB8898EEB2A158; // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleEurasians_75_DB13F83047FD0AAA56AD88904BD2B291; // 0x0070(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnScavSquad__5_39F57E6246DA8F4F3B348B9AFCC8FB8B; // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ScavExplicitSquad__66_4B4E9F304EBEF4E8E8CF078CF709CAA7; // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinofScavs_18_85D939EA47523899D11E588F159A036E;    // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxofScavs_19_044500D8477230F7646804950FA8373F;    // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeScavs__133_F2775E934F5BC23E297A17A039D3E0C7; // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleScavs_71_5D336DE046081F1AEB29F48CB0C3C969; // 0x0090(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnEuropanTurrets__77_9D7E9BD04A17F5B6864E508B169AD0C2; // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinofEuropanTurrets_97_C9D34BC9449A204BD7BFFB9DFD741EC1; // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxofEuropanTurrets_99_354768D24E6C0250AF59608108BBD0EA; // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeTurrets__134_4F6E6DB743DFF47BF7AEE18624AE8665; // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleEuropanTurrets_117_564B2D3C4B6AACF8C112978605B91F44; // 0x00B0(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnEuropanDrones__79_31708E5D495F638B387588B78F6B09D6; // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinEuropanDrones_111_6E622332466AD75A2E21CF8A06FFFC76; // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxEuropanDrones_112_1B0A764946228C989929C7B42C7C46DC; // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeEuropanDrones__135_89BF4BB44EEC38E6EF3DF6944A8B2E4F; // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleEuropanDrones_118_C56C4148442316B26ADDF39DCBA565DE; // 0x00D0(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnEurasianDrones__81_4D3DDAEB44736A91F8E1BD850AFB2D9B; // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinEurasianDrones_109_F36379D64B33D859CB2C8AA8DE553CA3; // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxEurasianDrones_110_6577320A4D07C1A79E3FE883B1FCB8D6; // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeEurasianDrones__136_DF9D41E84874475F97529984F5BE2F8B; // 0x00EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleEurasianDrones_119_956A0AF141937B043E6B749E15D4B1F0; // 0x00F0(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnGrabbers__83_3ADC54E542BB180FE8E15CBDEC52DE39; // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinofGrabbers_115_AA54F2664B93BEA5449ED397C642619B; // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxofGrabbers_116_8E197DB34C83061284B03BAB95C7E34F; // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistributeGrabbers__137_D76CFBEC41BB7596D35C5A94021C0EEA; // 0x010C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           PossibleGrabbers_139_253CD9A644A0D8CBF85B6089272A69DE; // 0x0110(0x0010)(Edit, BlueprintVisible)
};

}

