#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SpaceDetector

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_SpaceDetector.S_SpaceDetector
// 0x0040 (0x0040 - 0x0000)
struct FS_SpaceDetector final
{
public:
	class FString                                 Direction_2_B2EA893344EA3830E8135E8E60D51FB6;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Min_X_19_6207BB2049CF08B139AF569FE90899D1;         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_X_20_F96DDE094032B5A9AE08C096991C87C0;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Y_21_2ADB4983409075E64AB86F86FD652656;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Y_22_2B682EE146D2BCBC002C03A5D9873A42;         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min_Z_23_D25490384C1830C3D0DA70B28875C460;         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Z_24_7EED7E4648C376D291CC0DBCCD957D77;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

