#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Weapon

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_Weapon.S_Weapon
// 0x0060 (0x0060 - 0x0000)
struct FS_Weapon final
{
public:
	class FText                                   WeaponName_26_408500DA4A0EF309238EDB937DD848D2;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UClass*                                 Projectile_30_DBA43ACE4A872D0225FC9AB38B72159F;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ProjectileSocket_21_092B4E5841609FC59C74CAA6CFEA7D97; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProjectileDamage_24_010408D6480199A0CAD153A54B6E8DEF; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeaponAmmo_37_53EAF0244DFF34EBF2702FB18C2A7503;    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FullAuto_33_EE8DEB924B29822CE6D8FFA64B1C4590;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FireRate_20_6BD30A764015E7735BABE4BC57A608D5;      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadTime_40_417535CD4D103BBEA4FDDFB27BECBC38;    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        FireEffect_10_13CC657745341A518AB86AA955F2FF5F;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   FireEffectSocket_31_EF9DF7784A4B458DDB0678A93AE2AC2C; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FireSound_29_36888E904D7264DEFC3D058586E0CCC3;     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ProjectileImpactEffect_45_93CB008844E3886F181A478474CCFCFB; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ProjectileImpactSound_46_21ED687949DC808843394988E5995731; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

