#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_MissionComponent

#include "Basic.hpp"

#include "Struct_ActiveQuestGiver_structs.hpp"
#include "Struct_SavedQuest_structs.hpp"
#include "Struct_QuestMaster_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_MissionComponent.SG_MissionComponent_C
// 0x0088 (0x00B0 - 0x0028)
class USG_MissionComponent_C final : public USaveGame
{
public:
	class FString                                 SaveSlotName;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FStruct_SavedQuest>             SavedQuests;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<struct FStruct_QuestMaster>            PendingQuests;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<struct FStruct_QuestMaster>            ActiveQuests;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<struct FStruct_QuestMaster>            CompletedQuests;                                   // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<struct FStruct_ActiveQuestGiver>       ActiveQuestGivers;                                 // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           ConditionTags;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   LastActiveQuest;                                   // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestWasActive;                                    // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewGame;                                           // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SaveProgress;                                      // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UManager_Mission_C*                     QuestManager;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Add_To_Saved_Quests(const struct FStruct_QuestMaster& Quest);
	bool Save_Quest_Manager();
	void Update_Active_Quest(class FName ActiveQuest, bool InQuest);
	void Update_QuestList(TArray<struct FStruct_QuestMaster>& ActiveQuests_0, TArray<struct FStruct_QuestMaster>& PendingQuests_0, TArray<struct FStruct_QuestMaster>& CompletedQuests_0, TArray<struct FStruct_ActiveQuestGiver>& ActiveQuestGivers_0, TArray<class FName>& ConditionTags_0);
	void Update_Saved_Quest(const struct FStruct_SavedQuest& NewInfo, class FName QuestUniqueName);

	bool DoesHaveSavedGame() const;
	struct FStruct_SavedQuest Find_In_Saved_Quests(class FName QuestUniqueName, bool* Success) const;
	bool HasAnyQuestSaved() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SG_MissionComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SG_MissionComponent_C")
	}
	static class USG_MissionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_MissionComponent_C>();
	}
};

}

