#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_MissionComponent

#include "Basic.hpp"

#include "Struct_QuestMaster_structs.hpp"
#include "Struct_ActiveQuestGiver_structs.hpp"
#include "Struct_SavedQuest_structs.hpp"
#include "Struct_SequenceMaster_structs.hpp"


namespace SDK::Params
{

// Function SG_MissionComponent.SG_MissionComponent_C.Add_To_Saved_Quests
// 0x0250 (0x0250 - 0x0000)
struct SG_MissionComponent_C_Add_To_Saved_Quests final
{
public:
	struct FStruct_QuestMaster                    Quest;                                             // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_Find_In_Saved_Quests_Success;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SavedQuest                     CallFunc_Find_In_Saved_Quests_ReturnValue;         // 0x01C8(0x0020)(HasGetValueTypeHash)
	struct FStruct_SequenceMaster                 CallFunc_Array_Get_Item;                           // 0x01E8(0x0040)(HasGetValueTypeHash)
	struct FStruct_SavedQuest                     K2Node_MakeStruct_Struct_SavedQuest;               // 0x0228(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SG_MissionComponent.SG_MissionComponent_C.Save Quest Manager
// 0x0002 (0x0002 - 0x0000)
struct SG_MissionComponent_C_Save_Quest_Manager final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SG_MissionComponent.SG_MissionComponent_C.Update_Active_Quest
// 0x000C (0x000C - 0x0000)
struct SG_MissionComponent_C_Update_Active_Quest final
{
public:
	class FName                                   ActiveQuest;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InQuest;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SG_MissionComponent.SG_MissionComponent_C.Update_QuestList
// 0x0050 (0x0050 - 0x0000)
struct SG_MissionComponent_C_Update_QuestList final
{
public:
	TArray<struct FStruct_QuestMaster>            ActiveQuests_0;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FStruct_QuestMaster>            PendingQuests_0;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FStruct_QuestMaster>            CompletedQuests_0;                                 // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FStruct_ActiveQuestGiver>       ActiveQuestGivers_0;                               // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           ConditionTags_0;                                   // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function SG_MissionComponent.SG_MissionComponent_C.Update_Saved_Quest
// 0x0058 (0x0058 - 0x0000)
struct SG_MissionComponent_C_Update_Saved_Quest final
{
public:
	struct FStruct_SavedQuest                     NewInfo;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class FName                                   QuestUniqueName;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocIndex;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Find_In_Saved_Quests_Success;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SavedQuest                     CallFunc_Find_In_Saved_Quests_ReturnValue;         // 0x0030(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SG_MissionComponent.SG_MissionComponent_C.DoesHaveSavedGame
// 0x0001 (0x0001 - 0x0000)
struct SG_MissionComponent_C_DoesHaveSavedGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SG_MissionComponent.SG_MissionComponent_C.Find_In_Saved_Quests
// 0x0098 (0x0098 - 0x0000)
struct SG_MissionComponent_C_Find_In_Saved_Quests final
{
public:
	class FName                                   QuestUniqueName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SavedQuest                     ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	bool                                          LocSuccess;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SavedQuest                     LocReturn;                                         // 0x0038(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SavedQuest                     CallFunc_Array_Get_Item;                           // 0x0070(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SG_MissionComponent.SG_MissionComponent_C.HasAnyQuestSaved
// 0x0002 (0x0002 - 0x0000)
struct SG_MissionComponent_C_HasAnyQuestSaved final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

