#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKM_Bagman_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass SKM_Bagman_CtrlRig.SKM_Bagman_CtrlRig_C
// 0x00E8 (0x0B90 - 0x0AA8)
class USKM_Bagman_CtrlRig_C final : public UControlRig
{
public:
	bool                                          Targeting;                                         // 0x0AA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_AA9[0x7];                                      // 0x0AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RWeaponGrip;                                       // 0x0AB0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTransform                             LWeaponGrip;                                       // 0x0B10(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        WeaponWeight;                                      // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ProceduralADS;                                     // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Reloading;                                         // 0x0B79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SwitchingWpn;                                      // 0x0B7A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_B7B[0x5];                                      // 0x0B7B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FiringScale;                                       // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SprintBlend;                                       // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SKM_Bagman_CtrlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SKM_Bagman_CtrlRig_C")
	}
	static class USKM_Bagman_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USKM_Bagman_CtrlRig_C>();
	}
};

}

