#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadAI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SquadAI.EObjectiveType
// NumValues: 0x000B
enum class EObjectiveType : uint8
{
	None                                     = 0,
	Location                                 = 1,
	Direction                                = 2,
	Actor                                    = 3,
	PendingEnemyLocation                     = 4,
	PendingEnemyDirection                    = 5,
	StartTrackingEnemyLocation               = 6,
	StartTrackingEnemyDirection              = 7,
	IsTrackingEnemyLocation                  = 8,
	IsTrackingEnemyDirection                 = 9,
	EObjectiveType_MAX                       = 10,
};

// Enum SquadAI.EOrderType
// NumValues: 0x0008
enum class EOrderType : uint8
{
	None                                     = 0,
	Attack                                   = 1,
	Defend                                   = 2,
	Flank                                    = 3,
	Fallback                                 = 4,
	Ambush                                   = 5,
	Suspended                                = 6,
	EOrderType_MAX                           = 7,
};

// Enum SquadAI.EExitCondition
// NumValues: 0x0008
enum class EExitCondition : uint8
{
	None                                     = 0,
	ArriveAtObjective                        = 1,
	EnemyContact                             = 2,
	EnemyContactLoss                         = 3,
	Expiration                               = 4,
	WaitForSignal                            = 5,
	ActionCompleted                          = 6,
	EExitCondition_MAX                       = 7,
};

// Enum SquadAI.ETacticalModifiers
// NumValues: 0x0005
enum class ETacticalModifiers : uint8
{
	None                                     = 0,
	Easy                                     = 1,
	Forward                                  = 4,
	DoubleTime                               = 8,
	ETacticalModifiers_MAX                   = 9,
};

// Enum SquadAI.ETacticalSignalType
// NumValues: 0x000E
enum class ETacticalSignalType : uint8
{
	None                                     = 0,
	ContactLeft                              = 1,
	ContactRight                             = 2,
	MoveOut                                  = 3,
	Flank                                    = 4,
	Assault                                  = 5,
	Disperse                                 = 6,
	TakeCover                                = 7,
	CommenceFire                             = 8,
	CeaseFire                                = 9,
	SLLS                                     = 10,
	Heal                                     = 11,
	WaitForHeal                              = 12,
	ETacticalSignalType_MAX                  = 13,
};

// Enum SquadAI.EOrderInitialization
// NumValues: 0x0004
enum class EOrderInitialization : uint8
{
	None                                     = 0,
	UseSquadOrder                            = 1,
	UseMemberOrder                           = 2,
	EOrderInitialization_MAX                 = 3,
};

// Enum SquadAI.EProficiency
// NumValues: 0x0004
enum class EProficiency : uint8
{
	CareerSoldiers                           = 0,
	Rookies                                  = 1,
	SpecialForces                            = 2,
	EProficiency_MAX                         = 3,
};

// Enum SquadAI.ECombatState
// NumValues: 0x0007
enum class ECombatState : uint8
{
	NonCombat                                = 0,
	Broken                                   = 1,
	Retreating                               = 2,
	Defending                                = 3,
	Advancing                                = 4,
	Flanking                                 = 5,
	ECombatState_MAX                         = 6,
};

// Enum SquadAI.EIdentificationState
// NumValues: 0x0005
enum class EIdentificationState : uint8
{
	Hidden                                   = 0,
	Detected                                 = 1,
	Identified                               = 2,
	Lost                                     = 3,
	EIdentificationState_MAX                 = 4,
};

// Enum SquadAI.EIdentificationFilter
// NumValues: 0x0005
enum class EIdentificationFilter : uint8
{
	NoFlags                                  = 0,
	Detected                                 = 1,
	Identified                               = 2,
	Lost                                     = 4,
	EIdentificationFilter_MAX                = 5,
};

// Enum SquadAI.EActionResolutionType
// NumValues: 0x0005
enum class EActionResolutionType : uint8
{
	None                                     = 0,
	UnableToComply                           = 1,
	Complete                                 = 2,
	InProgress                               = 3,
	EActionResolutionType_MAX                = 4,
};

// ScriptStruct SquadAI.Order
// 0x0038 (0x0038 - 0x0000)
struct FOrder final
{
public:
	EOrderType                                    OrderType;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectiveType                                ObjectiveType;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SquadAI.SquadAudioCueMessage
// 0x0008 (0x0008 - 0x0000)
struct FSquadAudioCueMessage final
{
public:
	class FName                                   CueID;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SquadAI.TacticalAction
// 0x0050 (0x0050 - 0x0000)
struct FTacticalAction final
{
public:
	EExitCondition                                ExitCondition;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttackPolarity;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSuppressing;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAssaulting;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDoubleTime;                                     // 0x0005(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStealth;                                        // 0x0006(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHealing;                                        // 0x0007(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsWaitingForHeal;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectiveType                                ObjectiveType;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpirationTime;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SquadAI.TacticalSignal
// 0x0048 (0x0048 - 0x0000)
struct FTacticalSignal final
{
public:
	ETacticalSignalType                           SignalType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETacticalModifiers                            TacticalModifiers;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectiveType                                ObjectiveType;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExitCondition                                ExitCondition;                                     // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverridePrevious;                                 // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpirationTime;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SquadAI.IdentificationRecord
// 0x0028 (0x0028 - 0x0000)
struct FIdentificationRecord final
{
public:
	EIdentificationState                          IdentificationState;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FirstTimePerceived;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastTimePerceived;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastKnownLocation;                                 // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SquadAI.ActionResolution
// 0x0020 (0x0020 - 0x0000)
struct FActionResolution final
{
public:
	EActionResolutionType                         ResolutionType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

