#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Start_Manu_Lightningn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Start_Manu_Lightningn.Start_Manu_Lightningn_C
// 0x0030 (0x0250 - 0x0220)
class AStart_Manu_Lightningn_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight1;                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _____0______0_BAB9B8AA4503771E0ECA4E9997F00999;    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____0__Direction_BAB9B8AA4503771E0ECA4E9997F00999; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     타임라인_0;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void 타임라인_0__FinishedFunc();
	void 타임라인_0__UpdateFunc();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Start_Manu_Lightningn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Start_Manu_Lightningn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Start_Manu_Lightningn_C")
	}
	static class AStart_Manu_Lightningn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStart_Manu_Lightningn_C>();
	}
};
DUMPER7_ASSERTS_AStart_Manu_Lightningn_C;

}

