#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: steelheart_animBP_V02

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function steelheart_animBP_V02.steelheart_animBP_V02_C.ExecuteUbergraph_steelheart_animBP_V02
// 0x000C (0x000C - 0x0000)
struct steelheart_animBP_V02_C_ExecuteUbergraph_steelheart_animBP_V02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_steelheart_animBP_V02_C_ExecuteUbergraph_steelheart_animBP_V02;

// Function steelheart_animBP_V02.steelheart_animBP_V02_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct steelheart_animBP_V02_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_steelheart_animBP_V02_C_AnimGraph;

}

