#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SwitchButtonSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SwitchButtonSettings.Struct_SwitchButtonSettings
// 0x0080 (0x0080 - 0x0000)
struct FStruct_SwitchButtonSettings final
{
public:
	bool                                          IsEnabled__36_DECE149D4B6608431665819D0EEFE3E4;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected__12_8E48857549B745F32A31BD9A0F7F2CC7;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ButtonName_34_E3F2B917464FAACB92003EAAC275B991;    // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LabelText_9_BBA5648848F65E26AFE3869BF7497603;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           TextColor_25_0BCF1C864A9B73B545C1DFA3D27CC8AC;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredTextColor_26_4D8F878F4F2EE35965DB08AABE7B9B87; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedTextColor_27_51EBA417414F5CB026BEB99C0E615A83; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor_28_126582BE4E04933DE9290B9927217368; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredBackgroundColor_29_8FF94E854A3599DF95B466973D29A404; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedBackgroundColor_30_54E3839443AA3AFAE3EEE783F48E633A; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

