#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SettingBar

#include "Basic.hpp"

#include "Struct_CategoryHolderSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_GridBtnInnerBorder_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SettingBar.Struct_SettingBar
// 0x0128 (0x0128 - 0x0000)
struct FStruct_SettingBar final
{
public:
	class FName                                   SettingBarName_28_CD110B154C807614C44A5C98F4941A7C; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_CategoryHolderSettings         LabelSettings_17_C0FB3CF442EE50582D14F7910343E95C; // 0x0008(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor_4_252B27624660A59527D95A9664E9827B; // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_GridBtnInnerBorder             BorderSetup_7_2F0809E544A66292684609810721AB88;    // 0x00D8(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverBorderColor_10_2E59BE1C4C6F3B380C9A0BBA4A813E84; // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TopShadowColor_24_5CF6DEDB4BB5E36BF91735A07F939E9E; // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BottomShadowColor_26_C6255FB1449340BE01851AABD05F2DFF; // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

