#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_FocusableCameraActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_FocusableCameraActor.Struct_FocusableCameraActor
// 0x0058 (0x0058 - 0x0000)
struct FStruct_FocusableCameraActor final
{
public:
	class FName                                   Tag_3_E5E26F704916A76FF9B27DB440EE5D80;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ArmLength_10_54F9BD634D3661469579C5AA0401F4A1;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset_12_BEEF65D540EECCB36D52D3A58E844455;        // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationOffset_17_F005C1B849B38EF9203519A716341DC1; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         ActorsToFaceCamera_21_3899F77A4838F99E0D3E7BB5B9638A89; // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AActor*                                 SelfReference_22_19ECD14046E210A58AD7019AE002BEEC; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
};

}

