#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_MarkerInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_IconSelector_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_MarkerInfo.Struct_MarkerInfo
// 0x0070 (0x0070 - 0x0000)
struct FStruct_MarkerInfo final
{
public:
	bool                                          DisplayOnScreen_40_774587234CB5E64AA89025A8E8C5A022; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DİsplayOnCompass_44_987AF086434C38D2A2C65AABB129CACB; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayMarker_11_AF76AF2F495208D9A3B093B51EAE7897; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeepOnScreenEdge_49_80DA92B34B8B5F91B36856AE01A1B7E9; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeepOnCompassEdge_48_A0E0359F4CBDC4430132FA90B36B46D4; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TakeLocationFromMarkerTarget_57_B1BC1C814784AECB91CE9497C554722F; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_IconSelector                   MarkerIcon_52_EB8355B34A9973EBF1F03AB7FEC0BCCC;    // 0x0008(0x0020)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DisplayBetweenDistance_42_B769215147482EF4563981A2F8CEA47C; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NearestLocation_21_B62E0327454CF4A7F84E43978D846C82; // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset_31_A14E68154780FB766F7556A37F1C96E9;        // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MarkerTarget_5_F726BDFA43BCA98F29680583A8C1D47F;   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
};

}

