#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_CategoryHolderSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_CategoryHolderSettings.Struct_CategoryHolderSettings
// 0x00C0 (0x00C0 - 0x0000)
struct FStruct_CategoryHolderSettings final
{
public:
	class FText                                   Text_3_4CDF99D140A67A062FBAA99D135648EC;           // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FMargin                                TextPadding_6_B6DF0DD4463B0F143734E08A446FB3A8;    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           TextColor_9_0BF01D694F1643350058CFA4EC428B03;      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextHoverColor_11_3899000E462149E66E471AA2955881EA; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BoxColor_13_EFDC93184FC55161A56746BB32E80479;      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BoxHoverColor_15_1A2793134154384754D072A05A26C9A2; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font_18_FDC4E3534AB8FAD3EFFA4AB2E486374A;          // 0x0060(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

