#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_QuestEssentials

#include "Basic.hpp"

#include "Enum_QuestInteractionType_structs.hpp"
#include "Struct_MarkerInfo_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_QuestEssentials.Struct_QuestEssentials
// 0x00B0 (0x00B0 - 0x0000)
struct FStruct_QuestEssentials final
{
public:
	Enum_QuestInteractionType                     InteractionType_15_4F030B5C42A7C42A2C0DFE93BF8A5D17; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Repeatable_33_B259D40841887275896A3485A8B0F345;    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           QuestsNeedsToBeCompleted_24_2672B6F84D62E5F2BED311A8F3847915; // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           ConditionTags_26_C386AC644F36D8DFFC9EFFA24A5A62AA; // 0x0018(0x0010)(Edit, BlueprintVisible)
	class FText                                   QuestGiverDisplayName_30_D677BE4447CF51B5A083FA8927E9579F; // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FName                                   TargetName_11_8510BC704A70CEB24AB6C9813D2235D0;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_MarkerInfo                     TargetMarkerInfo_17_920C5F2C43A368B73F7B139847A343D0; // 0x0040(0x0070)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};

}

