#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ButtonTextSettings

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_ButtonBGTextSettings_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ButtonTextSettings.Struct_ButtonTextSettings
// 0x0110 (0x0110 - 0x0000)
struct FStruct_ButtonTextSettings final
{
public:
	ETextJustify                                  TextJustification_21_911370DF4C9F37F2873177A17927BC98; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_2_634ECB774367801585F64289E8499E19;           // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FMargin                                TextPadding_18_EA9B24C741DF7EDADEC2F6984BCE1A42;   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           TextColor_8_DC74546D4C8D469F136058B723BC947B;      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextHoverColor_26_D943843D4F7870BE4E48C1A1F6FD87B1; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font_13_3A47B1E54E43B0F9138B2CA798FF943A;          // 0x0048(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_ButtonBGTextSettings           BackgroundTextSettings_23_933237914752E8E76D86C99B4303CEE8; // 0x00A8(0x0068)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

