#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SavedQuest

#include "Basic.hpp"

#include "Struct_ObjectiveMaster_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SavedQuest.Struct_SavedQuest
// 0x0020 (0x0020 - 0x0000)
struct FStruct_SavedQuest final
{
public:
	bool                                          Completed_12_DF337A5245C40117DEB3889F59635AE3;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   QuestUniqueName_2_A139EC29465F54A911178CA416DDC038; // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSavedSequence_5_5CCCDDB242DC47E1A1AD909A2465E9B7; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_ObjectiveMaster>        Objectives_20_0871D43842ED33886F4E11B5D88EFC95;    // 0x0010(0x0010)(Edit, BlueprintVisible)
};

}

