#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_CustomButtonAppearence

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Struct_GridBtnInnerBorder_structs.hpp"
#include "Struct_ButtonDecalSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_NavigationKeyAction_structs.hpp"
#include "Struct_ButtonTextSettings_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_CustomButtonAppearence.Struct_CustomButtonAppearence
// 0x0620 (0x0620 - 0x0000)
struct FStruct_CustomButtonAppearence final
{
public:
	class FName                                   ButtonName_43_5A779E05418A25B6F74808A562C80897;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Locked_37_5F1822CF4E9396F0D74363A4914A85D3;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding_36_857E09B143661632BA7512B905A2B1FE;       // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                InnerPadding_40_6900DC8A424DD6D78D32F38FCDFF14DA;  // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStruct_GridBtnInnerBorder             BorderSetup_60_D3162C6C4146FE874C81CFAC15ABEC04;   // 0x002C(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverBorderColor_49_21CAD6694F77EEC6E99E91985AC35230; // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      ButtonBackgroundMaterial_58_CC0A4FC147AE19CE23DCEAB6C04E4AB9; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ButtonMainSettings_13_D3B2DD644701892D8E6F04A870A2773D; // 0x0070(0x03F0)(Edit, BlueprintVisible)
	struct FStruct_ButtonTextSettings             ButtonTextSettings_32_0259C12542FE5FAFB70394A7AD700F2B; // 0x0460(0x0110)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_ButtonDecalSettings            ButtonDecalSettings_31_330BF05F49319CE05896DA8560240B01; // 0x0570(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FStruct_NavigationKeyAction            NavigationSetup_47_9E3908D841AD37B63B1EC68C9DDF7032; // 0x05C8(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

