#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_TugOfWar_LevelActions

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_TugOfWar_LevelActions.STRUCT_TugOfWar_LevelActions
// 0x00B0 (0x00B0 - 0x0000)
struct FSTRUCT_TugOfWar_LevelActions final
{
public:
	class FString                                 DEVDescription_22_F0B082EA4814EF5D8170CF8C5F327D72; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   USERFACINGDescription_21_9355D0C140F128EC487A8A9674B71ABF; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              Icon_31_F7A113004160EC0F8CCE6B892CC11F61;          // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          AllPlayers__2_9AE4F2C4424B8C94CDAFCC90F084AE43;    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FTimespan>   MarkerstoSet_17_CC6659904690E0E55CECABB66DFE22C0;  // 0x0050(0x0050)(Edit, BlueprintVisible)
	TArray<class FString>                         LevelsImpacted_30_5E49277547C7051073F01B9FF33A5255; // 0x00A0(0x0010)(Edit, BlueprintVisible)
};

}

