#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_NavigationKeyAction

#include "Basic.hpp"

#include "Struct_CustomButtonNameArray_structs.hpp"
#include "Enum_NavigationAction_structs.hpp"
#include "Enum_NavigationType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NavigationKeyAction.Struct_NavigationKeyAction
// 0x0058 (0x0058 - 0x0000)
struct FStruct_NavigationKeyAction final
{
public:
	Enum_NavigationAction                         Up_19_A298BCD64B586E2F72B60C8B325F0A95;            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NavigationAction                         Down_20_88744096491734A35EB809AA2992D210;          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NavigationAction                         Left_21_B9299E9C4AF26B63AFD5C4BDEDF7DC25;          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NavigationAction                         Right_22_4B287C72473B1032B81D63B7A3064693;         // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<Enum_NavigationType, struct FStruct_CustomButtonNameArray> CustomPossibleTargetButtonNames_46_9EBD521040E9B3B3D7436B9FEE34B196; // 0x0008(0x0050)(Edit, BlueprintVisible)
};

}

