#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BottomInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BottomInfo.Struct_BottomInfo
// 0x0060 (0x0060 - 0x0000)
struct FStruct_BottomInfo final
{
public:
	class FText                                   Label_6_127322704F7E13E393CF1B981CFA4130;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   ButtonText_5_6C2126454333CD41D372DEA23F5367D1;     // 0x0010(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           LabelColor_9_4CE7802F4AAB2C8517CE44B64CCAB980;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ButtonTextColor_20_E59D7F8D4FAD66DB55CF9F9ABC8B6292; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ButtonColor_11_2C93BBE44F1C29F19827F9B71FA239E0;   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ButtonMaterial_14_7A80025240967AC046E319ACE20221D3; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ButtonTexture_17_BBAEA0804264935743EA49B469BA60D1; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

