#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ButtonBGTextSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ButtonBGTextSettings.Struct_ButtonBGTextSettings
// 0x0068 (0x0068 - 0x0000)
struct FStruct_ButtonBGTextSettings final
{
public:
	bool                                          DisplayBackgroundText__17_946B48324A7439CF2CB89AA8111D6EBC; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_2_634ECB774367801585F64289E8499E19;           // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         FontSize_20_3A47B1E54E43B0F9138B2CA798FF943A;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor_8_DC74546D4C8D469F136058B723BC947B;      // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       Transform_22_933237914752E8E76D86C99B4303CEE8;     // 0x0030(0x0038)(Edit, BlueprintVisible, NoDestructor)
};

}

