#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_InputKeyInfo

#include "Basic.hpp"

#include "Enum_KeyType_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_InputKeyInfo.Struct_InputKeyInfo
// 0x0040 (0x0040 - 0x0000)
struct FStruct_InputKeyInfo final
{
public:
	Enum_KeyType                                  KeyType_20_866387444AA282C102B26292BE102425;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name_2_39480FEF4FAA1757062DDBB50E0BC095;           // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SharedMapNames_36_5CBDF9164EB56DD12D6284A790DF7005; // 0x0010(0x0010)(Edit, BlueprintVisible)
	float                                         AxisValue_9_F6CFA45D42CC823E42B4478E40CF1BFE;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAxis_6_3B0FAFD143D0FA2F22D3B084E54DD245;         // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   DefaultKey_18_B1F2C47E42C61AC644AF36ABA18F5143;    // 0x0028(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

