#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ObjectiveMaster

#include "Basic.hpp"

#include "Struct_ObjectiveTarget_structs.hpp"
#include "Struct_ObjectiveCustomData_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ObjectiveMaster.Struct_ObjectiveMaster
// 0x0040 (0x0040 - 0x0000)
struct FStruct_ObjectiveMaster final
{
public:
	class FName                                   ObjectiveTag_23_5C4A1C1646769A8EC257DE9DF30F3013;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_2_6CA52827462D21DCF2C9D49FC3D86115;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Hints_40_AD8205D346255273601DA1850851075E;         // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_ObjectiveTarget>        TargetsToInteract_34_5C5A587D4F903662661C72AF962545FF; // 0x0028(0x0010)(Edit, BlueprintVisible)
	struct FStruct_ObjectiveCustomData            ObjectiveCustomData_26_99E0AB714A76B0FE5B81D0897D7CB303; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

