#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tether

#include "Basic.hpp"

#include "Tether_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Tether.TetherCableActor
// 0x01B0 (0x0440 - 0x0290)
class ATetherCableActor final : public AActor
{
public:
	struct FTetherCableProperties                 CableProperties;                                   // 0x0290(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bLockCurrentState;                                 // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousRealtime;                              // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RealtimeInEditorTimeDilation;                      // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeSimulationParticles;                // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeSimulationCollision;                // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeBuiltStaticMeshPoints;              // 0x033A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeContactPoints;                      // 0x033B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeComponentLocations;                 // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeTangents;                           // 0x033D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x033E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33F[0x1];                                      // 0x033F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneRoot;                                         // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              TimeCreated;                                       // 0x0350(0x0008)(ZeroConstructor, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTetherGuideSplineComponent*            GuideSpline;                                       // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTetherSimulationModel                 ActiveSimulationModel;                             // 0x0360(0x0080)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMesh*                            StaticMesh;                                        // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCableMeshGenerationCurveDescription   BuiltCurveDescriptionLocalSpaceSimplified;         // 0x03E8(0x0040)(NativeAccessSpecifierPrivate)
	class UTetherCableMeshComponent*              DynamicPreviewMesh;                                // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTetherMeshGenerator*                   MeshGenerator;                                     // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TetherCableActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TetherCableActor")
	}
	static class ATetherCableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATetherCableActor>();
	}
};

// Class Tether.TetherCableMeshComponent
// 0x0060 (0x05B0 - 0x0550)
class UTetherCableMeshComponent final : public UMeshComponent
{
public:
	uint8                                         Pad_550[0x60];                                     // 0x0550(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TetherCableMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TetherCableMeshComponent")
	}
	static class UTetherCableMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherCableMeshComponent>();
	}
};

// Class Tether.TetherGuideSplineMetadata
// 0x0010 (0x0038 - 0x0028)
class UTetherGuideSplineMetadata final : public USplineMetadata
{
public:
	TArray<class UTetherPointSegmentDefinition*>  PointSegmentDefinitions;                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TetherGuideSplineMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TetherGuideSplineMetadata")
	}
	static class UTetherGuideSplineMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherGuideSplineMetadata>();
	}
};

// Class Tether.TetherGuideSplineComponent
// 0x0030 (0x0650 - 0x0620)
class UTetherGuideSplineComponent final : public USplineComponent
{
public:
	uint8                                         Pad_620[0x28];                                     // 0x0620(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UTetherGuideSplineMetadata*             MetaData;                                          // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TetherGuideSplineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TetherGuideSplineComponent")
	}
	static class UTetherGuideSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherGuideSplineComponent>();
	}
};

// Class Tether.TetherMeshGenerator
// 0x0000 (0x0028 - 0x0028)
class UTetherMeshGenerator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TetherMeshGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TetherMeshGenerator")
	}
	static class UTetherMeshGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherMeshGenerator>();
	}
};

// Class Tether.TetherPointSegmentDefinition
// 0x0008 (0x0030 - 0x0028)
class UTetherPointSegmentDefinition final : public UObject
{
public:
	float                                         Slack;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTetherSegmentSimulationOptions        SimulationOptions;                                 // 0x002C(0x0002)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TetherPointSegmentDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TetherPointSegmentDefinition")
	}
	static class UTetherPointSegmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherPointSegmentDefinition>();
	}
};

// Class Tether.TMG_Basic
// 0x0020 (0x0048 - 0x0028)
class UTMG_Basic final : public UTetherMeshGenerator
{
public:
	struct FBasicMeshProperties                   Properties;                                        // 0x0028(0x001C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TMG_Basic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TMG_Basic")
	}
	static class UTMG_Basic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTMG_Basic>();
	}
};

// Class Tether.TMG_CustomMesh
// 0x0038 (0x0060 - 0x0028)
class UTMG_CustomMesh final : public UTetherMeshGenerator
{
public:
	struct FCustomMeshProperties                  Properties;                                        // 0x0028(0x0038)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TMG_CustomMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TMG_CustomMesh")
	}
	static class UTMG_CustomMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTMG_CustomMesh>();
	}
};

}

