#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextureUtilitiesCommon

#include "Basic.hpp"

#include "TextureUtilitiesCommon_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class TextureUtilitiesCommon.TextureImportSettings
// 0x0008 (0x0040 - 0x0038)
class UTextureImportSettings final : public UDeveloperSettings
{
public:
	int32                                         AutoVTSize;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalizeNormals;                           // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFastMipFilter;                              // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportFloatingPointFormat             CompressedFormatForFloatTextures;                  // 0x003E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportPNGInfill                       PNGInfill;                                         // 0x003F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextureImportSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextureImportSettings")
	}
	static class UTextureImportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureImportSettings>();
	}
};

}

