#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThrowingSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ThrowingSystem.HoldableObject
// 0x0030 (0x02C0 - 0x0290)
class AHoldableObject : public AActor
{
public:
	class UStaticMeshComponent*                   ObjectMesh;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ProjectileHitComponent;                            // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       ProjectileSplineComponent;                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USplineMeshComponent*>           ProjectileSplineMeshComponents;                    // 0x02A8(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AThrowableObject>           ThrowableObjectClass;                              // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearAllComponents();
	class UStaticMeshComponent* CreateProjectileHitComponent();
	class USplineComponent* CreateProjectileSplineComponent();
	class USplineMeshComponent* CreateProjectileSplineMeshComponent();
	void DoPredictablePath(const struct FVector& StartLocation, const struct FVector& LaunchVelocity, const TArray<EObjectTypeQuery>& ObjectTypes, const TArray<class AActor*>& ActorsToIgnore, class UMaterialInterface* HitMeshMaterial, class UMaterialInterface* PredictionMeshMaterial, float SimFrequency, float MaxSimTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoldableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoldableObject")
	}
	static class AHoldableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoldableObject>();
	}
};

// Class ThrowingSystem.ThrowableObject
// 0x0048 (0x02D8 - 0x0290)
class AThrowableObject : public AActor
{
public:
	class UStaticMeshComponent*                   ObjectMesh;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ObjectCollisionRadius;                             // 0x0298(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ExplosionTime;                                     // 0x029C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x18];                                     // 0x02A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ProjectileHitComponent;                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       ProjectileSplineComponent;                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USplineMeshComponent*>           ProjectileSplineMeshComponents;                    // 0x02C8(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void ClearAllComponents();
	class UStaticMeshComponent* CreateProjectileHitComponent();
	class USplineComponent* CreateProjectileSplineComponent();
	class USplineMeshComponent* CreateProjectileSplineMeshComponent();
	void DoPredictablePath(const struct FVector& StartLocation, const struct FVector& LaunchVelocity, const TArray<EObjectTypeQuery>& ObjectTypes, const TArray<class AActor*>& ActorsToIgnore, class UMaterialInterface* HitMeshMaterial, class UMaterialInterface* PredictionMeshMaterial, float SimFrequency, float MaxSimTime);
	void OnCook();
	void OnEquipped();
	void SetThrowVelocity(const struct FVector& NewThrowVelocity);

	struct FVector GetThrowVelocity() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ThrowableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThrowableObject")
	}
	static class AThrowableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThrowableObject>();
	}
};

// Class ThrowingSystem.ThrowingSystemComponent
// 0x0078 (0x0118 - 0x00A0)
class UThrowingSystemComponent final : public UActorComponent
{
public:
	class FName                                   ObjectAttachSocketname;                            // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<EObjectTypeQuery>                      TraceCollisionTypes;                               // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         ThrowDistance;                                     // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SimulationFrequency;                               // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSimulationTime;                                 // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     HitMeshMaterial;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PreditionMeshMaterial;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           AnimationMontage;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MontageSectionOverhandThrow;                       // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAiming;                                         // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AThrowableObject>        ThrowableObject;                                   // 0x00EC(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnThrowableActivated;                              // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnThrowableDeactivated;                            // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void HoldObject(TSubclassOf<class AThrowableObject> ThrowableClass);
	void InputCheck();
	void MulticastPlayMontage();
	void PrimaryAction();
	void ServerThrowObject(const struct FVector& ThrowVelocity);
	void ServerToggleAiming(bool bToggle);
	void ShowThrowingLine(bool bShow);
	void ToggleAiming(bool bToggle);
	void UnHoldObjectThrowable();

	bool GetCanAim() const;
	bool GetCanThrow() const;
	class AThrowableObject* GetHoldable() const;
	bool GetIsAiming() const;
	bool GetIsHolding() const;
	class USkeletalMeshComponent* GetObjectAttachPoint() const;
	struct FVector GetStartPosition() const;
	struct FVector GetThrowVelocity() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ThrowingSystemComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThrowingSystemComponent")
	}
	static class UThrowingSystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThrowingSystemComponent>();
	}
};

// Class ThrowingSystem.ThrowingSystemInterface
// 0x0000 (0x0000 - 0x0000)
class IThrowingSystemInterface final
{
public:
	TArray<class AActor*> GetExtraIgnoreActors();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ThrowingSystemInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThrowingSystemInterface")
	}
	static class IThrowingSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IThrowingSystemInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

}

