#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThrowingSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ThrowingSystem.HoldableObject.CreateProjectileHitComponent
// 0x0008 (0x0008 - 0x0000)
struct HoldableObject_CreateProjectileHitComponent final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.HoldableObject.CreateProjectileSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct HoldableObject_CreateProjectileSplineComponent final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.HoldableObject.CreateProjectileSplineMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct HoldableObject_CreateProjectileSplineMeshComponent final
{
public:
	class USplineMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.HoldableObject.DoPredictablePath
// 0x0068 (0x0068 - 0x0000)
struct HoldableObject_DoPredictablePath final
{
public:
	struct FVector                                StartLocation;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaunchVelocity;                                    // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HitMeshMaterial;                                   // 0x0050(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PredictionMeshMaterial;                            // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimFrequency;                                      // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSimTime;                                        // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowableObject.CreateProjectileHitComponent
// 0x0008 (0x0008 - 0x0000)
struct ThrowableObject_CreateProjectileHitComponent final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowableObject.CreateProjectileSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct ThrowableObject_CreateProjectileSplineComponent final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowableObject.CreateProjectileSplineMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct ThrowableObject_CreateProjectileSplineMeshComponent final
{
public:
	class USplineMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowableObject.DoPredictablePath
// 0x0068 (0x0068 - 0x0000)
struct ThrowableObject_DoPredictablePath final
{
public:
	struct FVector                                StartLocation;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaunchVelocity;                                    // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HitMeshMaterial;                                   // 0x0050(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PredictionMeshMaterial;                            // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimFrequency;                                      // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSimTime;                                        // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowableObject.SetThrowVelocity
// 0x0018 (0x0018 - 0x0000)
struct ThrowableObject_SetThrowVelocity final
{
public:
	struct FVector                                NewThrowVelocity;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowableObject.GetThrowVelocity
// 0x0018 (0x0018 - 0x0000)
struct ThrowableObject_GetThrowVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.HoldObject
// 0x0008 (0x0008 - 0x0000)
struct ThrowingSystemComponent_HoldObject final
{
public:
	TSubclassOf<class AThrowableObject>           ThrowableClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.ServerThrowObject
// 0x0018 (0x0018 - 0x0000)
struct ThrowingSystemComponent_ServerThrowObject final
{
public:
	struct FVector                                ThrowVelocity;                                     // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.ServerToggleAiming
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_ServerToggleAiming final
{
public:
	bool                                          bToggle;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.ShowThrowingLine
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_ShowThrowingLine final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.ToggleAiming
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_ToggleAiming final
{
public:
	bool                                          bToggle;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetCanAim
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_GetCanAim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetCanThrow
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_GetCanThrow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetHoldable
// 0x0008 (0x0008 - 0x0000)
struct ThrowingSystemComponent_GetHoldable final
{
public:
	class AThrowableObject*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetIsAiming
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_GetIsAiming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetIsHolding
// 0x0001 (0x0001 - 0x0000)
struct ThrowingSystemComponent_GetIsHolding final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetObjectAttachPoint
// 0x0008 (0x0008 - 0x0000)
struct ThrowingSystemComponent_GetObjectAttachPoint final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetStartPosition
// 0x0018 (0x0018 - 0x0000)
struct ThrowingSystemComponent_GetStartPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemComponent.GetThrowVelocity
// 0x0018 (0x0018 - 0x0000)
struct ThrowingSystemComponent_GetThrowVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ThrowingSystem.ThrowingSystemInterface.GetExtraIgnoreActors
// 0x0010 (0x0010 - 0x0000)
struct ThrowingSystemInterface_GetExtraIgnoreActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

