#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TypedElementFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum TypedElementFramework.FTypedElementAlertColumnType
// NumValues: 0x0003
enum class EFTypedElementAlertColumnType : uint8
{
	Error                                    = 0,
	Warning                                  = 1,
	MAX                                      = 2,
};

// Enum TypedElementFramework.ESCCModification
// NumValues: 0x0005
enum class ESCCModification : uint32
{
	Modified                                 = 0,
	Added                                    = 1,
	Removed                                  = 2,
	Conflicted                               = 3,
	ESCCModification_MAX                     = 4,
};

// ScriptStruct TypedElementFramework.SCCUserInfo
// 0x0010 (0x0010 - 0x0000)
struct FSCCUserInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.ScriptTypedElementHandle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FScriptTypedElementHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementDataStorageColumn
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FTypedElementDataStorageColumn
{
};
#pragma pack(pop)

// ScriptStruct TypedElementFramework.TypedElementAlertColumn
// 0x0020 (0x0020 - 0x0000)
struct FTypedElementAlertColumn final : public FTypedElementDataStorageColumn
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0xA];                                       // 0x0010(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	EFTypedElementAlertColumnType                 AlertType;                                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementChildAlertColumn
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FTypedElementChildAlertColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementUObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementUObjectColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementExternalObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementExternalObjectColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementDataStorageTag
// 0x0001 (0x0001 - 0x0000)
struct FTypedElementDataStorageTag
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementWidgetConstructor
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FTypedElementWidgetConstructor final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementParentColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementParentColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementUnresolvedParentColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementUnresolvedParentColumn final : public FTypedElementDataStorageColumn
{
public:
	uint64                                        ParentIdHash;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementLabelColumn
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementLabelColumn final : public FTypedElementDataStorageColumn
{
public:
	class FString                                 Label;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementLabelHashColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementLabelHashColumn final : public FTypedElementDataStorageColumn
{
public:
	uint64                                        LabelHash;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.ScriptTypedElementListProxy
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FScriptTypedElementListProxy final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementSyncBackToWorldTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncBackToWorldTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementSyncFromWorldTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncFromWorldTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementSyncFromWorldInteractiveTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncFromWorldInteractiveTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementRowReferenceColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementRowReferenceColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.ObjectOverrideColumn
// 0x0001 (0x0001 - 0x0000)
struct FObjectOverrideColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementPackageUnresolvedReference
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FTypedElementPackageUnresolvedReference final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementPackageReference
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementPackageReference final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementPackagePathColumn
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementPackagePathColumn final : public FTypedElementDataStorageColumn
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementPackageLoadedPathColumn
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FTypedElementPackageLoadedPathColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementPivotOffset
// 0x0018 (0x0018 - 0x0000)
struct FTypedElementPivotOffset final : public FTypedElementDataStorageColumn
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCInChangelistTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCInChangelistTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCStagedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCStagedTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCLockedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCLockedTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCExternallyEditedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCExternallyEditedTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCNotCurrentTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCNotCurrentTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.SCCStatusColumn
// 0x0004 (0x0004 - 0x0000)
struct FSCCStatusColumn final : public FTypedElementDataStorageColumn
{
public:
	ESCCModification                              Modification;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCRevisionId
// 0x0014 (0x0014 - 0x0000)
struct FSCCRevisionId final
{
public:
	uint32                                        ID[0x5];                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCRevisionIdColumn
// 0x0014 (0x0014 - 0x0000)
struct FSCCRevisionIdColumn final : public FTypedElementDataStorageColumn
{
public:
	struct FSCCRevisionId                         RevisionId;                                        // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCExternalRevisionIdColumn
// 0x0014 (0x0014 - 0x0000)
struct FSCCExternalRevisionIdColumn final : public FTypedElementDataStorageColumn
{
public:
	struct FSCCRevisionId                         RevisionId;                                        // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.SCCExternallyLockedColumn
// 0x0010 (0x0010 - 0x0000)
struct FSCCExternallyLockedColumn final : public FTypedElementDataStorageColumn
{
public:
	struct FSCCUserInfo                           LockedBy;                                          // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementSelectionColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementSelectionColumn final : public FTypedElementDataStorageColumn
{
public:
	class FName                                   SelectionSet;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementSlateWidgetReferenceColumn
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FTypedElementSlateWidgetReferenceColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementSlateWidgetReferenceDeletesRowTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSlateWidgetReferenceDeletesRowTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestColumnA
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnA final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestColumnB
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnB final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestColumnC
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnC final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestColumnD
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnD final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestColumnE
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnE final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestColumnF
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnF final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestColumnG
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnG final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TestTagColumnA
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnA final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestTagColumnB
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnB final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestTagColumnC
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnC final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TestTagColumnD
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnD final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementFramework.TypedElementLocalTransformColumn
// 0x0060 (0x0060 - 0x0000)
struct FTypedElementLocalTransformColumn final : public FTypedElementDataStorageColumn
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementClassTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementClassTypeInfoColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementScriptStructTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementScriptStructTypeInfoColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementFramework.TypedElementU32IntValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementU32IntValueCacheColumn final : public FTypedElementDataStorageColumn
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementI32IntValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementI32IntValueCacheColumn final : public FTypedElementDataStorageColumn
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementU64IntValueCacheColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementU64IntValueCacheColumn final : public FTypedElementDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementI64IntValueCacheColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementI64IntValueCacheColumn final : public FTypedElementDataStorageColumn
{
public:
	int64                                         Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementFloatValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementFloatValueCacheColumn final : public FTypedElementDataStorageColumn
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementFramework.TypedElementViewportColorColumn
// 0x0001 (0x0001 - 0x0000)
struct FTypedElementViewportColorColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         SelectionOutlineColorIndex;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

