#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PhotoPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PhotoPage.UI_PhotoPage_C
// 0x0038 (0x0318 - 0x02E0)
class UUI_PhotoPage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      Page;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PhotosPerColumn;                                   // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PhotosPerRow;                                      // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_PhotoThumbnail_C*>           PhotosArray;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         PageIndex;                                         // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Gallery_C*                          GalleryReference;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_PhotoPage(int32 EntryPoint);
	void Initialize(class UUI_Gallery_C* GalleryReference_0, int32 PageIndex_0);
	void PreConstruct(bool IsDesignTime);
	void ResetPage();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_PhotoPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_PhotoPage_C")
	}
	static class UUI_PhotoPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PhotoPage_C>();
	}
};

}

