#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_Controller

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_Controller.UIBP_ListData_Controller_C
// 0x0038 (0x0060 - 0x0028)
class UUIBP_ListData_Controller_C final : public UObject
{
public:
	class FName                                   InputAction;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsChanging)> OnChanging;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIBP_ListData_Controller_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIBP_ListData_Controller_C")
	}
	static class UUIBP_ListData_Controller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_Controller_C>();
	}
};
DUMPER7_ASSERTS_UUIBP_ListData_Controller_C;

}

