#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIST_EndingCredit

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UIST_EndingCredit.UIST_EndingCredit
// 0x0078 (0x0078 - 0x0000)
struct FUIST_EndingCredit final
{
public:
	TSoftClassPtr<class UClass>                   Module_16_E7F15E3A4CF3AB704BACB880408C5863;        // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 Data_0_7_C21B808546438F974622B7AE749D5221;         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Data_1_8_E34D84834463802CE7C20BB840675C59;         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Data_2_10_67580E4749CC632D6975FBBAF3442317;        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Data_3_12_B93B4DCD4C2F32B2A62212ABFA0EDA4C;        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Data_4_14_5C7406124FD3CFE8B6AE62879B256882;        // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FUIST_EndingCredit;

}

