#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_GraphicsAdvanced

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.ExecuteUbergraph_UIW_GraphicsAdvanced
// 0x0188 (0x0188 - 0x0000)
struct UIW_GraphicsAdvanced_C_ExecuteUbergraph_UIW_GraphicsAdvanced final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Setting_C*                         K2Node_DynamicCast_AsUIW_Setting;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_11;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_10;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_9;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_8;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_7;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_6;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_5;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_4;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_1;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_2;       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_3;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_4;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_5;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue;         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_1;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_6;       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_2;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_3;       // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_7;       // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_3;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_4;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_2;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_1;        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_4;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_5;       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_8;       // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_5;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_6;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_6;       // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_7;       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_7;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_9;       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_8;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_8;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_9;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_9;       // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_10;      // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_10;                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_10;      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_11;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDetailScalability_ReturnValue_11;      // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_11;                // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_ExecuteUbergraph_UIW_GraphicsAdvanced;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_11_Stepper_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_11_Stepper_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_11_Stepper_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_10_Stepper_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_10_Stepper_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_10_Stepper_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_9_Stepper_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_9_Stepper_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_9_Stepper_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_8_Stepper_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_8_Stepper_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_8_Stepper_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_7_Stepper_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_7_Stepper_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_7_Stepper_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_6_Stepper_K2Node_ComponentBoundEvent_9_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_6_Stepper_K2Node_ComponentBoundEvent_9_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_6_Stepper_K2Node_ComponentBoundEvent_9_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_5_Stepper_K2Node_ComponentBoundEvent_8_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_5_Stepper_K2Node_ComponentBoundEvent_8_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_5_Stepper_K2Node_ComponentBoundEvent_8_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_4_Stepper_K2Node_ComponentBoundEvent_7_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_4_Stepper_K2Node_ComponentBoundEvent_7_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_4_Stepper_K2Node_ComponentBoundEvent_7_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_3_Stepper_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_3_Stepper_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_3_Stepper_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_2_Stepper_K2Node_ComponentBoundEvent_5_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_2_Stepper_K2Node_ComponentBoundEvent_5_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_2_Stepper_K2Node_ComponentBoundEvent_5_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_1_Stepper_K2Node_ComponentBoundEvent_4_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_1_Stepper_K2Node_ComponentBoundEvent_4_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_1_Stepper_K2Node_ComponentBoundEvent_4_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Advanced_0_Stepper_K2Node_ComponentBoundEvent_3_OnOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_0_Stepper_K2Node_ComponentBoundEvent_3_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Advanced_0_Stepper_K2Node_ComponentBoundEvent_3_OnOptionChanged__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Btn_Next_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Btn_Next_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Btn_Next_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.BndEvt__UIW_GraphicsAdvanced_Btn_Prev_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Btn_Prev_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_BndEvt__UIW_GraphicsAdvanced_Btn_Prev_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.OnReady
// 0x05A0 (0x05A0 - 0x0000)
struct UIW_GraphicsAdvanced_C_OnReady final
{
public:
	TArray<class FText>                           LocalTextList;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0020(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0038(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0050(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0068(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UUIW_Setting_Menu_C* SettingMenu)> K2Node_CreateDelegate_OutputDelegate;    // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Setting_Menu_C*                    K2Node_DynamicCast_AsUIW_Setting_Menu;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        CallFunc_GetScrollBarStyle_ScrollBarStyle;         // 0x00D0(0x04D0)()
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_OnReady;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.InputKeyPrev
// 0x0001 (0x0001 - 0x0000)
struct UIW_GraphicsAdvanced_C_InputKeyPrev final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_InputKeyPrev;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.InputKeyNext
// 0x0001 (0x0001 - 0x0000)
struct UIW_GraphicsAdvanced_C_InputKeyNext final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_InputKeyNext;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.OnFocuedMenu
// 0x0028 (0x0028 - 0x0000)
struct UIW_GraphicsAdvanced_C_OnFocuedMenu final
{
public:
	class UUIW_Setting_Menu_C*                    SettingMenu;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0010(0x0018)()
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_OnFocuedMenu;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.FocusManage
// 0x02D8 (0x02D8 - 0x0000)
struct UIW_GraphicsAdvanced_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0160(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_FocusManage;

// Function UIW_GraphicsAdvanced.UIW_GraphicsAdvanced_C.RefreshOptions
// 0x0050 (0x0050 - 0x0000)
struct UIW_GraphicsAdvanced_C_RefreshOptions final
{
public:
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_1;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_2;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_3;       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_4;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_5;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_4;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_5;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_6;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_7;       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_6;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_7;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_8;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_9;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_8;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_9;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_10;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELScalabilityDefaultLevel                     CallFunc_GetDetailScalability_ReturnValue_11;      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_10;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_11;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_GraphicsAdvanced_C_RefreshOptions;

}

