#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HeadTag

#include "Basic.hpp"

#include "UIST_AbnormalVisible_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectP_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HeadTag.UIW_HeadTag_C
// 0x0140 (0x03F0 - 0x02B0)
class UUIW_HeadTag_C final : public ULHeadTagWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           DelegateVisible;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_C*                       Gauge;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Damage;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLockOn;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsParalyzeEnable;                                  // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PrevHP;                                            // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevRegainHP;                                      // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DamageVisibleTimer;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HeadTagVisibleTimer;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HpRefreshTimer;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CheckHUDTimer;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         OwnerNPC;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBinding;                                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageShowTime;                                    // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevDamage;                                        // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_HUD_C*                             HUDRef;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCombatState;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            DamageColor_Default;                               // 0x0330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DamageColor_Fire;                                  // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DamageColor_Electric;                              // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DamageColor_Acid;                                  // 0x03A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FUIST_AbnormalVisible>          AbnormalArr;                                       // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UImage*>                         AbnormalIconArr;                                   // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_UIW_HeadTag(int32 EntryPoint);
	void OnInitialized();
	void OnDetachFromActor();
	void OnAttachToActor();
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void Construct();
	void SetOwnerNpc(class ALNPCCharacter* InNpc);
	void CompleteTween(class FName CategoryName);
	void InitHeadTag();
	void OwnerNpcDelegate(bool Add);
	void StartLockOn();
	void FinishLockOn();
	void RefreshHP();
	void SetHP(float HPPrecent);
	void ShowAll();
	void HideAll();
	void ShowDamage(int32 Value, ELElementDamageType ElementDamageType);
	void HideDamage();
	void SetLockOn(bool IsLockOn_0);
	void OnParalyzeEnable(bool IsAbleParalyze);
	void OnGroggy(bool IsStarted);
	void CheckNpcDelegate();
	void DisplayInfo(const class FString& InputString);
	void CheckHUD();
	void OnChangeCombatState(bool IsInCombatState);
	void SetVisible(bool bVisible);
	void On_Abnormal_State(class FName AbnormalName, int64 AbnormalUniqueId, bool Visible);
	void AddAbnormal(class FName Name_0, int64 ID, bool Visible, ELAbnormalAbstateClass State);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_HeadTag_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_HeadTag_C")
	}
	static class UUIW_HeadTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HeadTag_C>();
	}
};
DUMPER7_ASSERTS_UUIW_HeadTag_C;

}

