#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Security

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Security.UIW_Security_C
// 0x0040 (0x0388 - 0x0348)
class UUIW_Security_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_Security_C;                     // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              Btn_Checkbox;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULButton*                               Btn_Confirm;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Img_Selected;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Text_Password;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Text_Username;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnLogin;                                           // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UIW_Security(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BndEvt__UIW_Security_Btn_Confirm_K2Node_ComponentBoundEvent_3_Delegate_OnFocusEvent__DelegateSignature(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UIW_Security_Btn_Confirm_K2Node_ComponentBoundEvent_2_Delegate_OnFocusEvent__DelegateSignature(const struct FFocusEvent& InFocusEvent);
	void BndEvt__UIW_Security_Btn_Confirm_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnReady();
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnNeowizAuth(bool Result);
	void Send();
	void OnPWCommitted(const class FText& Text, ETextCommit CommitMethod);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_Security_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_Security_C")
	}
	static class UUIW_Security_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Security_C>();
	}
};
DUMPER7_ASSERTS_UUIW_Security_C;

}

