#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_BossBar

#include "Basic.hpp"

#include "UIST_AbnormalVisible_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectP_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_BossBar.UIW_HUD_BossBar_C
// 0x0138 (0x03D8 - 0x02A0)
class UUIW_HUD_BossBar_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Construct;                                     // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_HP_C*                    Gauge;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_MobDamage;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_MobName;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DamageTimer;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HpRefreshTimer;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PrevHP;                                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevRegainHP;                                      // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         BossActor;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageShowTime;                                    // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevDamage;                                        // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUIW_HUD_BossBar_C* BossBar, class FName BossFName)> HideDispatcher; // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   BossActorFName;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DamageColor_Default;                               // 0x0308(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DamageColor_Fire;                                  // 0x0330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DamageColor_Electric;                              // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DamageColor_Acid;                                  // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsIconDmgTypeOrNot;                                // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_HUD_C*                             HUDRef;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUIST_AbnormalVisible>          AbnormalArr;                                       // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UImage*>                         AbnormalIconArr;                                   // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_UIW_HUD_BossBar(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnComplete(class FName CategoryName);
	void Destruct();
	void OnHideAni();
	void OnShowAni();
	void Construct();
	void InitBossBar();
	void ShowHpBar(class ALNPCCharacter* BossActor_0, bool IsEnter);
	void ShowDamage(int32 Value, ELElementDamageType ElementDamageType);
	void HideDamage();
	void VisibleBossBar(bool IsShow, const class FText& Name_0);
	void RefreshHP();
	void OnParalyzeEnable(bool IsAbleParalyze);
	void OnGroggy(bool IsStarted);
	void Reset();
	void AddAbnormal(class FName Name_0, int64 ID, bool Visible, ELAbnormalAbstateClass State);
	void OnAbnormalState(class FName AbnormalName, int64 AbnormalUniqueId, bool Visible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_HUD_BossBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_HUD_BossBar_C")
	}
	static class UUIW_HUD_BossBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_BossBar_C>();
	}
};
DUMPER7_ASSERTS_UUIW_HUD_BossBar_C;

}

