#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Equipment

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UIST_SecondCategoryArr_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UIEN_EquipSlotSize_structs.hpp"


namespace SDK::Params
{

// Function UIW_Equipment.UIW_Equipment_C.ExecuteUbergraph_UIW_Equipment
// 0x0460 (0x0460 - 0x0000)
struct UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_3;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_52;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_51;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_50;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_49;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_48;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_47;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_4;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_3;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_2;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_46;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_45;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_44;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_43;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_42;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_41;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_21;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_20;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_C*                             K2Node_DynamicCast_AsUIW_HUD;                      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_40;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_39;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_38;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_37;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_36;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_35;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_34;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_33;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_32;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_31;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_30;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_29;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_28;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_27;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_26;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_25;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_24;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_23;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_22;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_21;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_20;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_19;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Menu_BeltSlot_C*               CallFunc_FindBeltSlot_SlotBelt;                    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Menu_PouchSlot_C*              CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Delta;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_18;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_17;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_19;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_16;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_15;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_14;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_13;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_12;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_11;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_10;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_9;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_8;                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_7;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_6;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_5;                // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCController*                         K2Node_DynamicCast_AsLPCController;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_18;                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_17;                // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_16;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_15;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_14;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_13;                // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_12;                // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_11;                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_10;                // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_9;                 // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_9;          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_8;                 // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_8;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_1;            // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_7;                 // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_7;          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_6;                 // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_6;          // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_2;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_3;            // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_5;                 // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_5;          // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_4;                 // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_4;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_4;            // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_5;            // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_3;                 // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_3;          // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_2;          // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_6;            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_7;            // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_1;          // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_8;            // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_9;            // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRefreshPending_ReturnValue;             // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423[0x5];                                      // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem;            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_4;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_3;                // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_2;                // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_1;                // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem;                  // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt2_4_K2Node_ComponentBoundEvent_10_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_4_K2Node_ComponentBoundEvent_10_OnActive__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_4_K2Node_ComponentBoundEvent_10_OnActive__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt1_4_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_4_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_4_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt2_4_K2Node_ComponentBoundEvent_8_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_4_K2Node_ComponentBoundEvent_8_OnSelected__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_4_K2Node_ComponentBoundEvent_8_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt1_4_K2Node_ComponentBoundEvent_7_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_4_K2Node_ComponentBoundEvent_7_OnSelected__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_4_K2Node_ComponentBoundEvent_7_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Slot_Ear_5_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Ear_5_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Ear_5_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Slot_Weapon_3_K2Node_ComponentBoundEvent_4_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Weapon_3_K2Node_ComponentBoundEvent_4_OnSelected__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Weapon_3_K2Node_ComponentBoundEvent_4_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_ListInvenSmall_Group_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_ListInvenSmall_Group_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_ListInvenSmall_Group_K2Node_ComponentBoundEvent_3_OnUserScrolledEvent__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_10_K2Node_ComponentBoundEvent_120_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_10_K2Node_ComponentBoundEvent_120_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_10_K2Node_ComponentBoundEvent_120_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_9_K2Node_ComponentBoundEvent_119_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_9_K2Node_ComponentBoundEvent_119_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_9_K2Node_ComponentBoundEvent_119_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_8_K2Node_ComponentBoundEvent_118_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_8_K2Node_ComponentBoundEvent_118_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_8_K2Node_ComponentBoundEvent_118_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_7_K2Node_ComponentBoundEvent_117_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_7_K2Node_ComponentBoundEvent_117_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_7_K2Node_ComponentBoundEvent_117_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_6_K2Node_ComponentBoundEvent_116_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_6_K2Node_ComponentBoundEvent_116_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_6_K2Node_ComponentBoundEvent_116_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_5_K2Node_ComponentBoundEvent_115_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_5_K2Node_ComponentBoundEvent_115_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_5_K2Node_ComponentBoundEvent_115_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_4_K2Node_ComponentBoundEvent_114_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_4_K2Node_ComponentBoundEvent_114_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_4_K2Node_ComponentBoundEvent_114_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_3_K2Node_ComponentBoundEvent_113_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_3_K2Node_ComponentBoundEvent_113_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_3_K2Node_ComponentBoundEvent_113_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_2_K2Node_ComponentBoundEvent_112_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_2_K2Node_ComponentBoundEvent_112_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_2_K2Node_ComponentBoundEvent_112_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_1_K2Node_ComponentBoundEvent_111_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_1_K2Node_ComponentBoundEvent_111_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_1_K2Node_ComponentBoundEvent_111_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_10_K2Node_ComponentBoundEvent_110_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_10_K2Node_ComponentBoundEvent_110_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_10_K2Node_ComponentBoundEvent_110_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_9_K2Node_ComponentBoundEvent_109_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_9_K2Node_ComponentBoundEvent_109_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_9_K2Node_ComponentBoundEvent_109_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_8_K2Node_ComponentBoundEvent_108_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_8_K2Node_ComponentBoundEvent_108_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_8_K2Node_ComponentBoundEvent_108_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_7_K2Node_ComponentBoundEvent_107_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_7_K2Node_ComponentBoundEvent_107_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_7_K2Node_ComponentBoundEvent_107_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_6_K2Node_ComponentBoundEvent_106_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_6_K2Node_ComponentBoundEvent_106_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_6_K2Node_ComponentBoundEvent_106_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_5_K2Node_ComponentBoundEvent_105_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_5_K2Node_ComponentBoundEvent_105_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_5_K2Node_ComponentBoundEvent_105_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_4_K2Node_ComponentBoundEvent_104_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_4_K2Node_ComponentBoundEvent_104_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_4_K2Node_ComponentBoundEvent_104_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_3_K2Node_ComponentBoundEvent_103_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_3_K2Node_ComponentBoundEvent_103_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_3_K2Node_ComponentBoundEvent_103_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_List_InvenItemSmall_2_K2Node_ComponentBoundEvent_102_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_2_K2Node_ComponentBoundEvent_102_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_List_InvenItemSmall_2_K2Node_ComponentBoundEvent_102_SimpleListItemEventDynamic__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt2_3_K2Node_ComponentBoundEvent_53_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_3_K2Node_ComponentBoundEvent_53_OnActive__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_3_K2Node_ComponentBoundEvent_53_OnActive__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt1_3_K2Node_ComponentBoundEvent_52_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_3_K2Node_ComponentBoundEvent_52_OnActive__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_3_K2Node_ComponentBoundEvent_52_OnActive__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt2_3_K2Node_ComponentBoundEvent_51_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_3_K2Node_ComponentBoundEvent_51_OnSelected__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt2_3_K2Node_ComponentBoundEvent_51_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Belt1_3_K2Node_ComponentBoundEvent_38_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_3_K2Node_ComponentBoundEvent_38_OnSelected__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Belt1_3_K2Node_ComponentBoundEvent_38_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Slot_Gear_K2Node_ComponentBoundEvent_37_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Gear_K2Node_ComponentBoundEvent_37_OnActive__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Gear_K2Node_ComponentBoundEvent_37_OnActive__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Slot_Gear_K2Node_ComponentBoundEvent_36_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Gear_K2Node_ComponentBoundEvent_36_OnSelected__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Gear_K2Node_ComponentBoundEvent_36_OnSelected__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Slot_Foot_K2Node_ComponentBoundEvent_13_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Foot_K2Node_ComponentBoundEvent_13_OnActive__DelegateSignature final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Foot_K2Node_ComponentBoundEvent_13_OnActive__DelegateSignature;

// Function UIW_Equipment.UIW_Equipment_C.BndEvt__UIW_Equipment_Slot_Foot_K2Node_ComponentBoundEvent_12_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Equipment_C_BndEvt__UIW_Equipment_Slot_Foot_K2Node_ComponentBoundEvent_12_OnSelected__DelegateSignature final
{
public:
