#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_BGM

#include "Basic.hpp"

#include "BGM_Struct_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.ExecuteUbergraph_UIW_Alert_BGM
// 0x0028 (0x0028 - 0x0000)
struct UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SoundName)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM;

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.ShowBGM
// 0x0060 (0x0060 - 0x0000)
struct UIW_Alert_BGM_C_ShowBGM final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBGM_Struct                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_BGM_C_ShowBGM;

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.HideBGM
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_BGM_C_HideBGM final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_BGM_C_HideBGM;

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.VisibleEffectShow
// 0x0018 (0x0018 - 0x0000)
struct UIW_Alert_BGM_C_VisibleEffectShow final
{
public:
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_BGM_C_VisibleEffectShow;

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.VisibleEffectHide
// 0x0018 (0x0018 - 0x0000)
struct UIW_Alert_BGM_C_VisibleEffectHide final
{
public:
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_BGM_C_VisibleEffectHide;

}

