#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_Text

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_Module_Text.UIW_Module_Text_C.ExecuteUbergraph_UIW_Module_Text
// 0x000C (0x000C - 0x0000)
struct UIW_Module_Text_C_ExecuteUbergraph_UIW_Module_Text final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_UIW_Module_Text_C_ExecuteUbergraph_UIW_Module_Text;

// Function UIW_Module_Text.UIW_Module_Text_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_Module_Text_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Module_Text_C_OnFocusLost;

// Function UIW_Module_Text.UIW_Module_Text_C.OnFocusReceived
// 0x0268 (0x0268 - 0x0000)
struct UIW_Module_Text_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnFocusReceived_ReturnValue;              // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B0(0x00B8)()
};
DUMPER7_ASSERTS_UIW_Module_Text_C_OnFocusReceived;

// Function UIW_Module_Text.UIW_Module_Text_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_Module_Text_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnMouseButtonDown_ReturnValue;            // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_Module_Text_C_OnMouseButtonDown;

}

