#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_MOV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_MOV.UIW_MOV_C
// 0x0050 (0x02F0 - 0x02A0)
class UUIW_MOV_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Button_Hide;                                   // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Button_Show;                                   // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Mov;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         UIW_Btn_Key;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UBinkMediaPlayer*>               InitMediaPlayBink;                                 // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterial*>                      InitMediaPlayBinkMat;                              // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlaylistIndex;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void BndEvt__UIW_Btn_Key_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Btn_Key_K2Node_ComponentBoundEvent_1_OnStartHold__DelegateSignature();
	void BndEvt__UIW_Btn_Key_K2Node_ComponentBoundEvent_2_OnCancelHold__DelegateSignature();
	void EndBinkMedia();
	void PlayBinkMedia();
	void ExecuteUbergraph_UIW_MOV(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_MOV_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_MOV_C")
	}
	static class UUIW_MOV_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_MOV_C>();
	}
};
DUMPER7_ASSERTS_UUIW_MOV_C;

}

