#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_MOV_Subtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_MOV_Subtitle.UIW_MOV_Subtitle_C
// 0x0028 (0x02C8 - 0x02A0)
class UUIW_MOV_Subtitle_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderText;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              Text;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTimer;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_MOV_Subtitle(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnShowSubtitle(class FName CodeName, float Duration);
	void Hide();
	void CompleteTween(class FName CategoryName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_MOV_Subtitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_MOV_Subtitle_C")
	}
	static class UUIW_MOV_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_MOV_Subtitle_C>();
	}
};
DUMPER7_ASSERTS_UUIW_MOV_Subtitle_C;

}

