#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Listbar

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.ExecuteUbergraph_UIW_Quartz_Listbar
// 0x0178 (0x0178 - 0x0000)
struct UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0030(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0070(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E0(0x0070)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0150(0x0028)()
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_OnMouseLeave;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_OnMouseEnter;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_Listbar_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_OnFocusLost;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_Quartz_Listbar_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_OnFocusReceived;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_OnMouseButtonDown;

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.SetData
// 0x0088 (0x0088 - 0x0000)
struct UIW_Quartz_Listbar_C_SetData final
{
public:
	struct FLQuartzSlot                           SlotData;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0010(0x0018)()
	ELQuartzEffectType                            CallFunc_GetEffectType_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOverlappingEffect_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSpecialBuffCodeName_ReturnValue;       // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSpecialBuffLocalText_OutName;          // 0x0038(0x0018)()
	class FText                                   CallFunc_GetSpecialBuffLocalText_OutTooltip;       // 0x0050(0x0018)()
	class FText                                   CallFunc_GetSynergyNameWithNumber_ReturnValue;     // 0x0068(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Quartz_Listbar_C_SetData;

}

