#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SelectActionType

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_SelectActionType.UIW_SelectActionType_C
// 0x0050 (0x0398 - 0x0348)
class UUIW_SelectActionType_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_SelectActionType_C;             // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_ActionType_C*                      ActionType_1;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ActionType_C*                      ActionType_2;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ActionType_C*                      ActionType_3;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_ChangeInfo;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Select;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ActionType_C*                      SelectedActionType;                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_ActionType_C*>              ActionTypeList;                                    // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_UIW_SelectActionType(int32 EntryPoint);
	void OnCompleteTweenEvent(class FName Name_0);
	void Destruct();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void BndEvt__UIW_Popup_Tutorial_Btn_Next_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Popup_Tutorial_Btn_Prev_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void OnReady();
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSelectedActionType(class UUIW_ActionType_C* ActionType);
	void OnDoubleClickedActionType();
	void Callback(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_SelectActionType_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_SelectActionType_C")
	}
	static class UUIW_SelectActionType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_SelectActionType_C>();
	}
};
DUMPER7_ASSERTS_UUIW_SelectActionType_C;

}

