#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Control_BlankText

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Control_BlankText.UIW_Control_BlankText_C.ExecuteUbergraph_UIW_Control_BlankText
// 0x0040 (0x0040 - 0x0000)
struct UIW_Control_BlankText_C_ExecuteUbergraph_UIW_Control_BlankText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInputActionInfo_Title;                 // 0x0008(0x0018)()
	class FText                                   CallFunc_GetInputActionInfo_Desc;                  // 0x0020(0x0018)()
	bool                                          CallFunc_GetInputActionInfo_IsEmpty;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Control_BlankText_C_ExecuteUbergraph_UIW_Control_BlankText;

}

