#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Stepper

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Stepper.UIW_Stepper_C.ExecuteUbergraph_UIW_Stepper
// 0x0028 (0x0028 - 0x0000)
struct UIW_Stepper_C_ExecuteUbergraph_UIW_Stepper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Stepper_C_ExecuteUbergraph_UIW_Stepper;

// Function UIW_Stepper.UIW_Stepper_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_Stepper_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Stepper_C_PreConstruct;

// Function UIW_Stepper.UIW_Stepper_C.GetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct UIW_Stepper_C_GetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Stepper_C_GetSelectedIndex;

// Function UIW_Stepper.UIW_Stepper_C.GetSelectedPrev
// 0x0010 (0x0010 - 0x0000)
struct UIW_Stepper_C_GetSelectedPrev final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Stepper_C_GetSelectedPrev;

// Function UIW_Stepper.UIW_Stepper_C.SetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct UIW_Stepper_C_SetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Stepper_C_SetSelectedIndex;

// Function UIW_Stepper.UIW_Stepper_C.SetSelectedPrev
// 0x0004 (0x0004 - 0x0000)
struct UIW_Stepper_C_SetSelectedPrev final
{
public:
	int32                                         CallFunc_GetSelectedPrev_Index;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Stepper_C_SetSelectedPrev;

// Function UIW_Stepper.UIW_Stepper_C.GetSelectedNext
// 0x0014 (0x0014 - 0x0000)
struct UIW_Stepper_C_GetSelectedNext final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Stepper_C_GetSelectedNext;

// Function UIW_Stepper.UIW_Stepper_C.SetSelectedNext
// 0x0004 (0x0004 - 0x0000)
struct UIW_Stepper_C_SetSelectedNext final
{
public:
	int32                                         CallFunc_GetSelectedNext_Index;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Stepper_C_SetSelectedNext;

// Function UIW_Stepper.UIW_Stepper_C.SetOrientation
// 0x0001 (0x0001 - 0x0000)
struct UIW_Stepper_C_SetOrientation final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Stepper_C_SetOrientation;

// Function UIW_Stepper.UIW_Stepper_C.SetList
// 0x0010 (0x0010 - 0x0000)
struct UIW_Stepper_C_SetList final
{
public:
	TArray<class FText>                           List;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_Stepper_C_SetList;

// Function UIW_Stepper.UIW_Stepper_C.ReturnSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct UIW_Stepper_C_ReturnSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Stepper_C_ReturnSelectedIndex;

}

