#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_SlaveArm_ReinForceInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo
// 0x0208 (0x0208 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00B0(0x0070)(ConstParm)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0130(0x0070)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01A0(0x0028)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x01C8(0x0008)(NoDestructor)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x01E0(0x0028)()
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnFocusReceived
// 0x01D8 (0x01D8 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00F8(0x0028)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0120(0x00B8)()
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived;

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData final
{
public:
	class ULSlaveArmTree*                         SlotData_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextNameLocalize_ReturnValue;     // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData;

}

