#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategoryButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_CategoryButton.W_CategoryButton_C.ChangeSelectedState
// 0x0C30 (0x0C30 - 0x0000)
struct W_CategoryButton_C_ChangeSelectedState final
{
public:
	bool                                          Selected_;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           SelectedStyle;                                     // 0x0010(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           NormalStyle;                                       // 0x0400(0x03F0)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1[0x3];                                      // 0x07F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x07F4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0808(0x0014)()
	bool                                          Temp_bool_Variable_1;                              // 0x081C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D[0x3];                                      // 0x081D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0820(0x0014)()
	uint8                                         Pad_834[0xC];                                      // 0x0834(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_Select_Default_1;                           // 0x0840(0x03F0)(ConstParm)
};

// Function W_CategoryButton.W_CategoryButton_C.ExecuteUbergraph_W_CategoryButton
// 0x0008 (0x0008 - 0x0000)
struct W_CategoryButton_C_ExecuteUbergraph_W_CategoryButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_CategoryButton.W_CategoryButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CategoryButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

