#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CategoryButton.W_CategoryButton_C
// 0x0820 (0x0B00 - 0x02E0)
class UW_CategoryButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SingleButton_C*                    WBP_SingleButton;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           FilterTag;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 WidgetIndex, const struct FGameplayTag& Filter)> CategoryClicked; // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonName;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         WidgetIndex;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           Normal_Style;                                      // 0x0320(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           Selected_Style;                                    // 0x0710(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__W_CategoryButton_WBP_SingleButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void ChangeSelectedState(bool Selected_);
	void ExecuteUbergraph_W_CategoryButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_CategoryButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_CategoryButton_C")
	}
	static class UW_CategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CategoryButton_C>();
	}
};

}

