#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CustomRigView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CustomRigView.W_CustomRigView_C
// 0x0078 (0x0358 - 0x02E0)
class UW_CustomRigView_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RigIcon;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UW_CustomContainer_C*>           Containers;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        ItemSize;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigSize;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigIconSize;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_CustomRigContainer_C*>        Danglies;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UW_CustomMultiDangleContainer_C*> MultiDanglies;                                    // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          HasUniqueDangly;                                   // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Adjust_Rig_Icon();
	void CalculateSizes(struct FIntPoint* ItemSize_0);
	void InitialiseRig(const struct FBackpackRigDefaults& BackpackRigDefaults, bool UpdateSize, bool ShowDanglies, const struct FGameplayTag& CharacterTag);
	void GetDanglies(TArray<class UW_CustomRigDangly_C*>* Danglies_0);
	void GetItems(TArray<class UW_CustomRigItem_C*>* Items);
	void UpdateRigSize(const struct FBackpackRigDefaults& RigDefaults, bool Condition);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_W_CustomRigView(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_CustomRigView_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_CustomRigView_C")
	}
	static class UW_CustomRigView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CustomRigView_C>();
	}
};

}

