#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CustomRigViewItems

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "W_CustomRigView_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CustomRigViewItems.W_CustomRigViewItems_C
// 0x00F8 (0x0450 - 0x0358)
class UW_CustomRigViewItems_C final : public UW_CustomRigView_C
{
public:
	double                                        LastViewportScale;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FVector4, class UW_CustomContainer_C*> ContainerScreenToWidget;                      // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector2D                              MousePos;                                          // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_CustomContainer_C*                   PreviouslyHovered;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               PreviouslySnapped;                                 // 0x03D0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              RigItemSize;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<struct FVector4, class UUserWidget*>     DangliesScreenToWidget;                            // 0x03F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUserWidget*                            PreviouslyHoveredDangly;                           // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Adjust_Rig_Icon();
	void CalculateSizes(struct FIntPoint* ItemSize_0);
	void ChangePreviewState(bool ShowPreview, bool IsDangly_, class UW_CustomRigItem_C* Item, bool CanBeLoose, bool CanBeFixed, bool IsUnique);
	void ContainerHoverCheck(class UW_CustomContainer_C** Hovered, struct FVector4* SnapLocation);
	void DanglyHoverCheck(class UUserWidget** Hovered, struct FVector4* SnapLocation);
	void FindContainer(class UWidget* Widget, int32* Socket_Number, class UW_CustomContainer_C** Container);
	void FindDanglySlot(class UWidget* Dangly, class UUserWidget** DanglySlot);
	void GetAllItems(TMap<int32, struct FBackpackContainerInfo>* Container_Data);
	void InitialiseRig(const struct FBackpackRigDefaults& BackpackRigDefaults, bool UpdateSize, bool ShowDanglies, const struct FGameplayTag& CharacterTag);
	void RecalculateContainerLocations();
	void RecalculateDanglyLocations();
	void RecalculateLocations();
	void RemoveItem(int32 Socket, class UW_CustomRigItem_C* Item);
	void ShowCantFit();
	void UpdateImage(TSoftObjectPtr<class UMaterialInterface> SoftMaterial);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_CustomRigViewItems_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_CustomRigViewItems_C")
	}
	static class UW_CustomRigViewItems_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CustomRigViewItems_C>();
	}
};

}

