#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DataLoadError

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DataLoadError.W_DataLoadError_C
// 0x00B0 (0x0390 - 0x02E0)
class UW_DataLoadError_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MenuButton_C*                      CreateNewSaveButton;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ErrorPanel;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ErrorSwitcher;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ErrorTextBox;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ExplanationTextBox;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      LoadLastKnownGoodButton;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      LoadLastKnownGoodFileConfirmButton;                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      LoadLastKnownGoodFileOpenSaveDirectoryButton;      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LoadLastKnownGoodFilePanel;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      LoadLastKnownGoodFileQuitGameButton;               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      LoadOldestGoodFileConfirmButton;                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      NewSaveFileConfirmButton;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewSaveFilePanel;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      NewSaveFileQuitGameButton;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      OpenSaveDirectoryButton;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      QuitGameButton;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRetryLoad;                                       // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ErrorText;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__W_DataLoadError_CreateNewSaveButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_LoadLastKnownGoodButton_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_LoadLastKnownGoodFileConfirmButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_LoadLastKnownGoodFileOpenSaveDirectoryButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_LoadLastKnownGoodFileQuitGameButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_LoadOldestGoodFileConfirmButton_1_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_NewSaveFileConfirmButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_NewSaveFileQuitGameButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_OpenSaveDirectoryButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__W_DataLoadError_QuitGameButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_W_DataLoadError(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DataLoadError_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DataLoadError_C")
	}
	static class UW_DataLoadError_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DataLoadError_C>();
	}
};

}

