#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DrillDeviceTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DrillDeviceTimer.W_DrillDeviceTimer_C
// 0x0030 (0x0310 - 0x02E0)
class UW_DrillDeviceTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LootIcon;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Timer;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Countdown_Time;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownTick;                                     // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Count_Time();
	void Countdown(double CountdownTime);
	void ExecuteUbergraph_W_DrillDeviceTimer(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetMarkerInformation(const class FText& Distance, int32 NumDist, int32 MaxVisDist);
	void ShouldCreateWidgetDispatch_Event(bool ShouldCreateWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_DrillDeviceTimer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_DrillDeviceTimer_C")
	}
	static class UW_DrillDeviceTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DrillDeviceTimer_C>();
	}
};

}

