#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_JoiningSquad

#include "Basic.hpp"

#include "CommonUser_structs.hpp"


namespace SDK::Params
{

// Function W_JoiningSquad.W_JoiningSquad_C.Completed_99A2C46243C3E13E42723D9B02325E95
// 0x0028 (0x0028 - 0x0000)
struct W_JoiningSquad_C_Completed_99A2C46243C3E13E42723D9B02325E95 final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function W_JoiningSquad.W_JoiningSquad_C.ExecuteUbergraph_W_JoiningSquad
// 0x0088 (0x0088 - 0x0000)
struct W_JoiningSquad_C_ExecuteUbergraph_W_JoiningSquad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result;                         // 0x0028(0x0028)(ConstParm)
	struct FOnlineResultInformation               Temp_struct_Variable;                              // 0x0050(0x0028)()
	class UFWAsync_JoinParty*                     CallFunc_JoinOnlineParty_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

