#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LootFailReason

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"


namespace SDK::Params
{

// Function W_LootFailReason.W_LootFailReason_C.ExecuteUbergraph_W_LootFailReason
// 0x0020 (0x0020 - 0x0000)
struct W_LootFailReason_C_ExecuteUbergraph_W_LootFailReason final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFWGameCharacter*                       K2Node_DynamicCast_AsFWGame_Character;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_LootFailReason.W_LootFailReason_C.Failed Looting
// 0x0002 (0x0002 - 0x0000)
struct W_LootFailReason_C_Failed_Looting final
{
public:
	ELootFailerReason                             Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

