#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LootFailReason

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ForeverWinter_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LootFailReason.W_LootFailReason_C
// 0x00A0 (0x0380 - 0x02E0)
class UW_LootFailReason_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowFailReason;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             FailReason;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Fail_Text;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFWGameCharacter*                       Character_Ref;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   FailText_Too_Far_Away;                             // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FailText_In_Use;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FailText_NoRoom;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FailText_TooSoon;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FailText_In_Use_2;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FailText_NothingLeft;                              // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FailText_Locked;                                   // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_W_LootFailReason(int32 EntryPoint);
	void Failed_Looting(ELootFailerReason Reason);
	void HideAfter();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_LootFailReason_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_LootFailReason_C")
	}
	static class UW_LootFailReason_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LootFailReason_C>();
	}
};

}

