#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoginError

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_LoginError.W_LoginError_C.ExecuteUbergraph_W_LoginError
// 0x0048 (0x0048 - 0x0000)
struct W_LoginError_C_ExecuteUbergraph_W_LoginError final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_UnformatRedpointError_ErrorNamespace;     // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_UnformatRedpointError_ErrorCode;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_UnformatRedpointError_ErrorMessage;       // 0x0018(0x0010)()
	class FString                                 CallFunc_UnformatRedpointError_OriginalCall;       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_UnformatRedpointError_Context;            // 0x0038(0x0010)()
};

}

