#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MoveItem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FWInventory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MoveItem.W_MoveItem_C
// 0x0030 (0x0310 - 0x02E0)
class UW_MoveItem_C final : public UUserWidget
{
public:
	class UImage*                                 Category;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           LootDisabledProgress;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LootIcon;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Timer;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemCategoryWidget_C*                W_ItemCategoryWidget;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Move_Time;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitialiseItem(TSoftObjectPtr<class UTexture2D> Icon, EItemCategory Category_0, double MoveTime);
	void UpdateProgress(double Progress);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MoveItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MoveItem_C")
	}
	static class UW_MoveItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MoveItem_C>();
	}
};

}

