#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PartCategoryTab

#include "Basic.hpp"

#include "S_WeaponPartCustomizationIcon_structs.hpp"
#include "ForeverWinter_structs.hpp"


namespace SDK::Params
{

// Function W_PartCategoryTab.W_PartCategoryTab_C.ExecuteUbergraph_W_PartCategoryTab
// 0x0050 (0x0050 - 0x0000)
struct W_PartCategoryTab_C_ExecuteUbergraph_W_PartCategoryTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponPartCustomizationIcon         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PartCategoryTab.W_PartCategoryTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PartCategoryTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_PartCategoryTab.W_PartCategoryTab_C.UpdatePartName
// 0x0010 (0x0010 - 0x0000)
struct W_PartCategoryTab_C_UpdatePartName final
{
public:
	class FText                                   NewName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

