#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QuickPlay

#include "Basic.hpp"

#include "CommonUser_structs.hpp"


namespace SDK::Params
{

// Function W_QuickPlay.W_QuickPlay_C.Completed_3EE7DC4046204EC05F2627A09A2CC399
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlay_C_Completed_3EE7DC4046204EC05F2627A09A2CC399 final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function W_QuickPlay.W_QuickPlay_C.Completed_BC4B40954530FB45FEAF4FB6B89CF8D2
// 0x0028 (0x0028 - 0x0000)
struct W_QuickPlay_C_Completed_BC4B40954530FB45FEAF4FB6B89CF8D2 final
{
public:
	struct FOnlineResultInformation               Result;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function W_QuickPlay.W_QuickPlay_C.ExecuteUbergraph_W_QuickPlay
// 0x00D0 (0x00D0 - 0x0000)
struct W_QuickPlay_C_ExecuteUbergraph_W_QuickPlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnlineResultInformation               K2Node_CustomEvent_Result;                         // 0x0008(0x0028)(ConstParm)
	TDelegate<void(const struct FOnlineResultInformation& Result)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlineResultInformation               Temp_struct_Variable;                              // 0x0040(0x0028)()
	class UFWAsync_JoinParty*                     CallFunc_JoinOnlineParty_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Error;                          // 0x0078(0x0010)(ConstParm)
	TDelegate<void(bool bSuccess, const class FText& Error)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0098(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWAsync_FindQuickPlayMatch*            CallFunc_FindQuickPlayMatch_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function W_QuickPlay.W_QuickPlay_C.SelectSessionToJoin
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlay_C_SelectSessionToJoin final
{
public:
	TArray<class UFWLobbySearchResult*>           Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         NumPlayersRequired;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

