#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ThirdPartyAccountLinkingConsent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ThirdPartyAccountLinkingConsent.W_ThirdPartyAccountLinkingConsent_C
// 0x0050 (0x0330 - 0x02E0)
class UW_ThirdPartyAccountLinkingConsent_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MenuButton_C*                      CreateAccountOnlyButton;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      ImportBeginButton;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ImportPanel;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      ImportSkipButton;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      LinkAfterLoginButton;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LinkRequestPanel;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ScreenSwitcher;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEOSUserInterface_SignInOrCreateAccount_Context* Context;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_ThirdPartyAccountLinkingConsent_CreateAccountButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__W_ThirdPartyAccountLinkingConsent_ImportBeginButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__W_ThirdPartyAccountLinkingConsent_ImportSkipButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__W_ThirdPartyAccountLinkingConsent_LoginButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void ExecuteUbergraph_W_ThirdPartyAccountLinkingConsent(int32 EntryPoint);
	void SetupUserInterface(class UEOSUserInterface_SignInOrCreateAccount_Context* Context_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ThirdPartyAccountLinkingConsent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ThirdPartyAccountLinkingConsent_C")
	}
	static class UW_ThirdPartyAccountLinkingConsent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ThirdPartyAccountLinkingConsent_C>();
	}
};

}

