#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UIMockup_Button_WPNPart

#include "Basic.hpp"

#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"


namespace SDK::Params
{

// Function W_UIMockup_Button_WPNPart.W_UIMockup_Button_WPNPart_C.ExecuteUbergraph_W_UIMockup_Button_WPNPart
// 0x02F0 (0x02F0 - 0x0000)
struct W_UIMockup_Button_WPNPart_C_ExecuteUbergraph_W_UIMockup_Button_WPNPart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ConstParm, ReferenceParm)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemDetails                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x0240)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_UIMockup_Button_WPNPart.W_UIMockup_Button_WPNPart_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_UIMockup_Button_WPNPart_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function W_UIMockup_Button_WPNPart.W_UIMockup_Button_WPNPart_C.UpdateNewStatus
// 0x0020 (0x0020 - 0x0000)
struct W_UIMockup_Button_WPNPart_C_UpdateNewStatus final
{
public:
	TArray<struct FDataTableRowHandle>            New_Parts;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
};

}

