#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UIMockup_Button_WPNPart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "W_Button_PartSelectorBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UIMockup_Button_WPNPart.W_UIMockup_Button_WPNPart_C
// 0x0050 (0x07C0 - 0x0770)
class UW_UIMockup_Button_WPNPart_C final : public UW_Button_PartSelectorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_W_UIMockup_Button_WPNPart_C;        // 0x0770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ECustomizationType                            WeaponPartCategory;                                // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         WeaponPartIndex;                                   // 0x0779(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UW_UIMockup_Button_WPNPart_C* PartSelected, class FName RowName, ECustomizationType WeaponPartCategory, uint8 WeaponPartType, uint8 ExtraData)> WeaponPartSelected; // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         WeaponPartExtraData;                               // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName RowName, ECustomizationType WeaponPartCategory, uint8 WeaponPartType, uint8 ExtraData)> WeaponPartHovered; // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              WeaponPartUnhovered;                               // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_UIMockup_Button_WPNPart_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_UIMockup_Button_WPNPart_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_UIMockup_Button_WPNPart_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_W_UIMockup_Button_WPNPart(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateNewStatus(TArray<struct FDataTableRowHandle>& New_Parts);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_UIMockup_Button_WPNPart_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_UIMockup_Button_WPNPart_C")
	}
	static class UW_UIMockup_Button_WPNPart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UIMockup_Button_WPNPart_C>();
	}
};

}

