#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VendorItem

#include "Basic.hpp"

#include "ForeverWinter_structs.hpp"
#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_VendorItem.W_VendorItem_C
// 0x01F0 (0x04D0 - 0x02E0)
class UW_VendorItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AmmoType;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Cost;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_145;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InvalidCharacter;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ItemButton;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SocketLocation;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SoldOutOverlay;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Stock;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Type;                                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemCategoryWidget_C*                W_ItemCategoryWidget;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponExperienceBar_C*               W_WeaponExperienceBar;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WEAPONXPTOOLOW;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemQuantity;                                      // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Subtype;                                           // 0x0378(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UW_VendorItem_C* ItemClicked)> ItemSelected;                 // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Durability;                                        // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedItem                             ItemData;                                          // 0x03B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSavedWeapon                           WeaponData;                                        // 0x03C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    RigData;                                           // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSavedContainer                        ContainerData;                                     // 0x03F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EStoreCategory                                ItemType;                                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedDangly                           DanglyData;                                        // 0x0410(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(class UW_VendorItem_C* Item)> ItemHovered;                         // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              ItemUnhovered;                                     // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSavedFrame                            FrameData;                                         // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         MaxStack;                                          // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UW_VendorItem_C* Item)> ItemDoubleClicked;                   // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          DoubleClick_;                                      // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VendorLevel;                                       // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSavedBuddy                            BuddyData;                                         // 0x0480(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(class UW_VendorItem_C* Item)> ItemPressed;                         // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UW_VendorItem_C* Item)> ItemReleased;                        // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_RigPanel_C*                        RigPanel;                                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              Grid_Size;                                         // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ItemTag;                                           // 0x04C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_VendorItem_ItemButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_VendorItem_ItemButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_VendorItem_ItemButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_VendorItem_ItemButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_VendorItem_ItemButton_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void ClearCost();
	void ExecuteUbergraph_W_VendorItem(int32 EntryPoint);
	class UWidget* Get_ItemButton_ToolTipWidget();
	void GetContainerDetails(const struct FBackpackContainerInfo& BackpackContainerInfo, struct FInventoryContainer* ContainerDetails);
	TSoftObjectPtr<class UTexture2D> GetContainerSocketIcon(const class UClass* Class_0);
	TSoftObjectPtr<class UTexture2D> GetContainerSocketIconBySlotSize(const ERigSlot Slot_0, ERigSlotSize Size);
	void GetItemDetails(struct FSlateBrush* Brush, class FText* Name_0, int32* Quantity, int32* Value_0, struct FVector2D* ImageSize);
	void GetSuggestBuyAmount(int32* Amount);
	void HideIrrelevantDonationData();
	void InitialiseBuddy(const struct FSavedBuddy& SavedBuddy, const struct FVector2D& Size, bool* Initialized);
	void InitialiseContainer(const struct FSavedContainer& SavedContainer, const struct FVector2D& Size, bool* Initialized);
	void InitialiseCost(int32 CurrencyValue, class UW_VendorCurrency_C* VendorCurrency, double PriceMultiplier);
	void InitialiseDangly(const struct FSavedDangly& SavedDangly, const struct FVector2D& Size, bool* Initialized);
	void InitialiseFrame(const struct FSavedFrame& FrameData_0, const struct FVector2D& Size, bool* Initialized);
	void InitialiseItem(const struct FSavedItem& SavedItem, const struct FVector2D& Size, bool XP_Too_Low_, bool* Initialized);
	void InitialiseRig(const struct FDataTableRowHandle& SavedRig, bool Owned, const struct FVector2D& Size, const struct FGameplayTag& CharacterTag, bool* Initialized);
	void InitialiseWeapon(const struct FSavedWeapon& SavedWeapon, const struct FVector2D& Size, const struct FGameplayTag& CharacterTag, bool* Initialized);
	void ReduceQuantity(int32 Amount, bool AutoRemove_, bool* Removed);
	void SelectedStatusChanged(bool Selected);
	void SetGridSizeColumnsRows(const struct FIntPoint& GridSize);
	void SetItemGameplayTag();
	void SetItemVendorLevel(int32 VendorLevel_0);
	void SoldOutCheck(bool XP_Too_Low_);
	void UpdateQuantity();
	void ValidCharacter_(const struct FGameplayTag& CharacterTag, const struct FGameplayTagContainer& AllowTags, const struct FGameplayTagContainer& RequiredTags);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_VendorItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_VendorItem_C")
	}
	static class UW_VendorItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_VendorItem_C>();
	}
};

}

