#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AudioSettingsPanel

#include "Basic.hpp"

#include "Struct_SettingsSave_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_AudioSave_structs.hpp"
#include "Struct_NavigationKeyAction_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK::Params
{

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__EnableMusic_K2Node_ComponentBoundEvent_1_OnSwitchButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__EnableMusic_K2Node_ComponentBoundEvent_1_OnSwitchButtonSelected__DelegateSignature final
{
public:
	class FName                                   ButtonName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__EnableSFX_K2Node_ComponentBoundEvent_2_OnSwitchButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__EnableSFX_K2Node_ComponentBoundEvent_2_OnSwitchButtonSelected__DelegateSignature final
{
public:
	class FName                                   ButtonName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__EnableSounds_K2Node_ComponentBoundEvent_0_OnSwitchButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__EnableSounds_K2Node_ComponentBoundEvent_0_OnSwitchButtonSelected__DelegateSignature final
{
public:
	class FName                                   ButtonName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__EnableUI_K2Node_ComponentBoundEvent_3_OnSwitchButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__EnableUI_K2Node_ComponentBoundEvent_3_OnSwitchButtonSelected__DelegateSignature final
{
public:
	class FName                                   ButtonName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__MasterVolume_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__MasterVolume_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__MusicVolume_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__SFXVolume_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__SFXVolume_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.BndEvt__UIVolume_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_BndEvt__UIVolume_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Call_On_TabChanged
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_Call_On_TabChanged final
{
public:
	class UWidget*                                TabReference;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.ExecuteUbergraph_WB_AudioSettingsPanel
// 0x04B0 (0x04B0 - 0x0000)
struct WB_AudioSettingsPanel_C_ExecuteUbergraph_WB_AudioSettingsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ButtonName_3;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ButtonName_2;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_TabReference;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ButtonName_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ButtonName;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewValue_3;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_1;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveSwitcherName_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveSwitcherName_ReturnValue_1;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveSwitcherName_ReturnValue_2;       // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_NewValue_2;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_2;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewValue_1;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_3;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_NewValue;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings;       // 0x00C0(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_1;     // 0x00E8(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut;                // 0x0110(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_1;              // 0x0130(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_1;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_2;     // 0x0154(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_2;              // 0x017C(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_2;             // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Focused;                              // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Hide;                                 // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19F[0x1];                                      // 0x019F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_3;     // 0x01A8(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_4;     // 0x01D0(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_3;              // 0x01F8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_3;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_4;              // 0x021C(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_5;     // 0x023C(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_4;             // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_6;     // 0x0268(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_5;              // 0x0290(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_5;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_6;              // 0x02B4(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_7;     // 0x02D4(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_6;             // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_8;     // 0x0300(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_7;              // 0x0328(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_7;             // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_8;              // 0x034C(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NormalizeToRange_ReturnValue_4;           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_8;             // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NormalizeToRange_ReturnValue_5;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_6;           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_7;           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_9;     // 0x0398(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_9;              // 0x03C0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_9;             // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_10;    // 0x03E4(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings_11;    // 0x040C(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_10;             // 0x0434(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AudioSave                      K2Node_SetFieldsInStruct_StructOut_11;             // 0x0454(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_10;            // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_AudioSettings_Success_11;            // 0x0475(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_476[0x2];                                      // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MenuMaster_C*                       CallFunc_Get_MenuManager_ReturnValue;              // 0x0478(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast; // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1; // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_2; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_3; // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_UserInterfaceVolume_22_03FA4EEA4023CE43E8DEC291E5B3FCE3_ImplicitCast; // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_SoundEffectsVolume_17_FD7D152249C782ADCB9AA9912E9D3BED_ImplicitCast; // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_MusicVolume_10_36D132D745A5B235457E5288C4579A4A_ImplicitCast; // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_4; // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_5; // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_6; // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_7; // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_MasterVolume_4_A3883DDE4558E8F1B4D0C2855745531D_ImplicitCast; // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_ContentToFit
// 0x0010 (0x0010 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_ContentToFit final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildIndex;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_FocusedName
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_FocusedName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_Navigables
// 0x0020 (0x0020 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_Navigables final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_NavigationInfo
// 0x0058 (0x0058 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_NavigationInfo final
{
public:
	struct FStruct_NavigationKeyAction            ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_Saved_Master_Defaults
// 0x0050 (0x0050 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_Saved_Master_Defaults final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings;       // 0x001C(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_MasterVolumeValue_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_Saved_Music_Defaults
// 0x0050 (0x0050 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_Saved_Music_Defaults final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings;       // 0x0020(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MusicVolumeValue_ImplicitCast;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_Saved_SFX_Defaults
// 0x0050 (0x0050 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_Saved_SFX_Defaults final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings;       // 0x0020(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SFXVolumeValue_ImplicitCast;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_Saved_UI_Defaults
// 0x0050 (0x0050 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_Saved_UI_Defaults final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_SettingsSave                   CallFunc_Load_DisplaySettings_SavedSettings;       // 0x0020(0x0028)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_UIVolumeValue_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_TabButtons
// 0x0010 (0x0010 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_TabButtons final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Get_TabConstructorReference
// 0x0008 (0x0008 - 0x0000)
struct WB_AudioSettingsPanel_C_Get_TabConstructorReference final
{
public:
	class UWB_TabMenuConstructor_C*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.IsBeginPlayScreenEnd?
// 0x0001 (0x0001 - 0x0000)
struct WB_AudioSettingsPanel_C_IsBeginPlayScreenEnd_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.IsFocusable?
// 0x0001 (0x0001 - 0x0000)
struct WB_AudioSettingsPanel_C_IsFocusable_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.IsFocused?
// 0x0001 (0x0001 - 0x0000)
struct WB_AudioSettingsPanel_C_IsFocused_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.OnNavigationCalled
// 0x0002 (0x0002 - 0x0000)
struct WB_AudioSettingsPanel_C_OnNavigationCalled final
{
public:
	Enum_NavigationAction                         Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Receive_Pressed_Key
// 0x0020 (0x0020 - 0x0000)
struct WB_AudioSettingsPanel_C_Receive_Pressed_Key final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_AudioSettingsPanel_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Toggle_Focus
// 0x0001 (0x0001 - 0x0000)
struct WB_AudioSettingsPanel_C_Toggle_Focus final
{
public:
	bool                                          Focused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_AudioSettingsPanel.WB_AudioSettingsPanel_C.Toggle_Widget
// 0x0010 (0x0010 - 0x0000)
struct WB_AudioSettingsPanel_C_Toggle_Widget final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

