#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BottomInfoKey

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_BottomInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BottomInfoKey.WB_BottomInfoKey_C
// 0x0080 (0x0360 - 0x02E0)
class UWB_BottomInfoKey_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ButtonBG;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStruct_BottomInfo                     KeyInfo;                                           // 0x0300(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WB_BottomInfoKey(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_BottomInfoKey_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_BottomInfoKey_C")
	}
	static class UWB_BottomInfoKey_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BottomInfoKey_C>();
	}
};

}

