#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameplaySettings

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Struct_GameSave_structs.hpp"
#include "Struct_NavigationKeyAction_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Enum_NavigationAction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_GameplaySettingsSave_structs.hpp"


namespace SDK::Params
{

// Function WB_GameplaySettings.WB_GameplaySettings_C.BndEvt__CrosshairColor_K2Node_ComponentBoundEvent_3_OnFocused__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_BndEvt__CrosshairColor_K2Node_ComponentBoundEvent_3_OnFocused__DelegateSignature final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.BndEvt__CrosshairColor_K2Node_ComponentBoundEvent_5_OnColorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_GameplaySettings_C_BndEvt__CrosshairColor_K2Node_ComponentBoundEvent_5_OnColorChanged__DelegateSignature final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.BndEvt__CrosshairOpacity_K2Node_ComponentBoundEvent_4_OnFocused__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_BndEvt__CrosshairOpacity_K2Node_ComponentBoundEvent_4_OnFocused__DelegateSignature final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.BndEvt__WB_SingleSettingBar_6_K2Node_ComponentBoundEvent_1_OnFocused__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_BndEvt__WB_SingleSettingBar_6_K2Node_ComponentBoundEvent_1_OnFocused__DelegateSignature final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.BndEvt__WB_SingleSettingBar_7_K2Node_ComponentBoundEvent_2_OnFocused__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_BndEvt__WB_SingleSettingBar_7_K2Node_ComponentBoundEvent_2_OnFocused__DelegateSignature final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.BndEvt__WB_SingleSettingBar_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_BndEvt__WB_SingleSettingBar_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Call_On_TabChanged
// 0x0008 (0x0008 - 0x0000)
struct WB_GameplaySettings_C_Call_On_TabChanged final
{
public:
	class UWidget*                                TabReference;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.ExecuteUbergraph_WB_GameplaySettings
// 0x0138 (0x0138 - 0x0000)
struct WB_GameplaySettings_C_ExecuteUbergraph_WB_GameplaySettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Hide;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Focused;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_TabReference;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFocused_4;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFocused_3;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFocused_2;            // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFocused_1;            // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFocused;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_ComponentBoundEvent_NewColor;               // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_GameSave                       CallFunc_Load_GameplaySettings_ReturnValue;        // 0x0074(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_GameSave                       CallFunc_Load_GameplaySettings_ReturnValue_1;      // 0x00B4(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_GameplaySettingsSave           K2Node_SetFieldsInStruct_StructOut;                // 0x00F4(0x0038)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Save_GameplaySettings_Success;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MenuMaster_C*                       CallFunc_Get_MenuManager_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Get_ContentToFit
// 0x0010 (0x0010 - 0x0000)
struct WB_GameplaySettings_C_Get_ContentToFit final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ChildIndex;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Get_FocusedName
// 0x0008 (0x0008 - 0x0000)
struct WB_GameplaySettings_C_Get_FocusedName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Get_Navigables
// 0x0020 (0x0020 - 0x0000)
struct WB_GameplaySettings_C_Get_Navigables final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Get_NavigationInfo
// 0x0058 (0x0058 - 0x0000)
struct WB_GameplaySettings_C_Get_NavigationInfo final
{
public:
	struct FStruct_NavigationKeyAction            ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Get_TabButtons
// 0x0010 (0x0010 - 0x0000)
struct WB_GameplaySettings_C_Get_TabButtons final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Get_TabConstructorReference
// 0x0008 (0x0008 - 0x0000)
struct WB_GameplaySettings_C_Get_TabConstructorReference final
{
public:
	class UWB_TabMenuConstructor_C*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.IsBeginPlayScreenEnd?
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_IsBeginPlayScreenEnd_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.IsFocusable?
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_IsFocusable_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.IsFocused?
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_IsFocused_ final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.OnNavigationCalled
// 0x0002 (0x0002 - 0x0000)
struct WB_GameplaySettings_C_OnNavigationCalled final
{
public:
	Enum_NavigationAction                         Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Receive_Pressed_Key
// 0x0020 (0x0020 - 0x0000)
struct WB_GameplaySettings_C_Receive_Pressed_Key final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_GameplaySettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Toggle_Focus
// 0x0001 (0x0001 - 0x0000)
struct WB_GameplaySettings_C_Toggle_Focus final
{
public:
	bool                                          Focused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_GameplaySettings.WB_GameplaySettings_C.Toggle_Widget
// 0x0010 (0x0010 - 0x0000)
struct WB_GameplaySettings_C_Toggle_Widget final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

