#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HostGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_HostGame.WB_HostGame_C
// 0x00C0 (0x03A0 - 0x02E0)
class UWB_HostGame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SingleButton_C*                     CreateSession;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           HostGameButtons;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_1;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_2;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_3;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_4;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_5;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_1;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_2;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          UseLAN_;                                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PublicConnections;                                 // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LevelName__Button_00;                              // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelName__Button_01;                              // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelName__Button_02;                              // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelName__Button_03;                              // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelName__Button_04;                              // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LevelName__Button_05;                              // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WB_HostGame_WB_SingleButton_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleButton_2_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleButton_3_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleButton_4_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleButton_5_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_HostGame_WB_SingleSettingBar_1_K2Node_ComponentBoundEvent_1_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__WB_HostGame_WB_SingleSettingBar_2_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature(double NewValue);
	void Call_On_TabChanged(class UWidget* TabReference);
	void Construct();
	void CustomEvent(class UWB_SingleButton_C* SelfReference);
	void ExecuteUbergraph_WB_HostGame(int32 EntryPoint);
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	void On_LoadingScreenEnd();
	void On_Map_Button_Clicked(class UWB_SingleGridButton_C* SelfReference);
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_WidgetConstructed();
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void SelectMap(int32 Index_0, class FName MapID);
	void Set_Button_Text(class UWB_SingleButton_C* Button, const class FText& Button_Text);
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_HostGame_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_HostGame_C")
	}
	static class UWB_HostGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_HostGame_C>();
	}
};

}

