#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_KeyBindingButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_InputKeyInfo_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"
#include "Enum_KeyType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_KeyBindingButton.WB_KeyBindingButton_C
// 0x00E0 (0x03C0 - 0x02E0)
class UWB_KeyBindingButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BGColor;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                KeyBindingButton;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeyText;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_FrameBuilder::UWB_FrameBuilder_C*    WB_FrameBuilder;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   KeyName;                                           // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FStruct_InputKeyInfo                   KeyInfo;                                           // 0x0318(0x0040)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   ReceivedKey;                                       // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnKeyListenerEnd;                                  // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FKey                                   EmptyKey;                                          // 0x0388(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWB_KeyBindingButton_C* Widget)> OnHovered;                  // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__KeyBindingButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__KeyBindingButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__KeyBindingButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Call_On_TabChanged(class UWidget* TabReference);
	void ClearActionKeys();
	void ClearActionMapping();
	void ClearAxisKeys();
	void ClearAxisMapping();
	void ExecuteUbergraph_WB_KeyBindingButton(int32 EntryPoint);
	void Finalize_ReMappingAction();
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	struct FKey Get_CorrectGamepadThumbsticks(const struct FKey& Input);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	bool HasBinding_();
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	void On_LoadingScreenEnd();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_WidgetConstructed();
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void PreConstruct(bool IsDesignTime);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void ReceiveInput(struct FKey& PressedKey);
	void Remove_AxisByScale();
	void Remove_AxisKeys();
	void Set_Border_Color(const struct FLinearColor& NewColor);
	void Set_Border_Size(const struct FVector2D& VerticalBorders);
	void Set_Keybinding_Name(const class FText& KeyName_0);
	void Set_WaitingForInput(const class FText& InText);
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_KeyBindingButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_KeyBindingButton_C")
	}
	static class UWB_KeyBindingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_KeyBindingButton_C>();
	}
};

}

