#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_KeyboardSoldierBindings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_KeyboardSoldierBindings.WB_KeyboardSoldierBindings_C
// 0x0048 (0x0328 - 0x02E0)
class UWB_KeyboardSoldierBindings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SingleSettingBar_C*                 ResolutionWidget;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SettingsContainer;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_1;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_2;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_4;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_6;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WindowMode;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Toggle_Widget(bool Hide, double Delay);
	void Toggle_Focus(bool Focused);
	void Skip_BeginPlayScreen();
	void SimulateClick();
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void On_WidgetConstructed();
	void On_Panel_Unloaded();
	void On_Panel_Loaded();
	void On_LoadingScreenEnd();
	bool IsFocused_();
	bool IsFocusable_();
	bool IsBeginPlayScreenEnd_();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	TArray<class UWidget*> Get_TabButtons();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_Navigables();
	class FName Get_FocusedName();
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	void ExecuteUbergraph_WB_KeyboardSoldierBindings(int32 EntryPoint);
	void Call_On_TabChanged(class UWidget* TabReference);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_KeyboardSoldierBindings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_KeyboardSoldierBindings_C")
	}
	static class UWB_KeyboardSoldierBindings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_KeyboardSoldierBindings_C>();
	}
};

}

