#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_KeyboardVehicleBindings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_KeyboardVehicleBindings.WB_KeyboardVehicleBindings_C
// 0x0038 (0x0318 - 0x02E0)
class UWB_KeyboardVehicleBindings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SingleSettingBar_C*                 Handbreake;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 MoveBackward;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 MoveForward;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SettingsContainer;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 TurnLeft;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 TurnRight;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Toggle_Widget(bool Hide, double Delay);
	void Toggle_Focus(bool Focused);
	void Skip_BeginPlayScreen();
	void SimulateClick();
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void On_WidgetConstructed();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	void On_LoadingScreenEnd();
	bool IsFocused_();
	bool IsFocusable_();
	bool IsBeginPlayScreenEnd_();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class FName Get_FocusedName();
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	TArray<class UWidget*> Get_Navigables();
	void ExecuteUbergraph_WB_KeyboardVehicleBindings(int32 EntryPoint);
	void Call_On_TabChanged(class UWidget* TabReference);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_KeyboardVehicleBindings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_KeyboardVehicleBindings_C")
	}
	static class UWB_KeyboardVehicleBindings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_KeyboardVehicleBindings_C>();
	}
};

}

