#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_KeybindingGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_InputKeyInfo_structs.hpp"
#include "Enum_KeyType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_KeybindingGenerator.WB_KeybindingGenerator_C
// 0x0050 (0x0330 - 0x02E0)
class UWB_KeybindingGenerator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         KeyList;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_KeyBindingButton_C*                 WB_KeyBindingButton;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_KeyBindingButton_C*                 WB_KeyBindingButton_1;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FStruct_InputKeyInfo>           Keys;                                              // 0x0300(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           BorderColor;                                       // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnKeyListenerEnd;                                  // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WB_KeybindingGenerator(int32 EntryPoint);
	class FText FindKeyName(const struct FStruct_InputKeyInfo& InputKeyInfo);
	TArray<class UWB_KeyBindingButton_C*> Generate_Keys(TArray<struct FStruct_InputKeyInfo>& Keys_0, const struct FLinearColor& BorderColor_0);
	void On_KeySelected();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_KeybindingGenerator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_KeybindingGenerator_C")
	}
	static class UWB_KeybindingGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_KeybindingGenerator_C>();
	}
};

}

