#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MouseSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MouseSettings.WB_MouseSettings_C
// 0x0030 (0x0310 - 0x02E0)
class UWB_MouseSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SingleSettingBar_C*                 InvertMouse;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 MouseSensitivity;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SettingsContainer;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MouseSensitivityValue;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertMouseEnabled;                                // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Toggle_Widget(bool Hide, double Delay);
	void SimulateClick();
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void On_WidgetConstructed();
	void On_Panel_Unloaded();
	void On_Panel_Loaded();
	void On_LoadingScreenEnd();
	bool IsFocused_();
	bool IsFocusable_();
	bool IsBeginPlayScreenEnd_();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	TArray<class UWidget*> Get_TabButtons();
	void Toggle_Focus(bool Focused);
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	void Skip_BeginPlayScreen();
	TArray<class UWidget*> Get_Navigables();
	class FName Get_FocusedName();
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	void ExecuteUbergraph_WB_MouseSettings(int32 EntryPoint);
	void BndEvt__WB_SingleSettingBar_4_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature(double NewValue);
	void Call_On_TabChanged(class UWidget* TabReference);
	void BndEvt__InvertMouse_K2Node_ComponentBoundEvent_1_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_MouseSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_MouseSettings_C")
	}
	static class UWB_MouseSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MouseSettings_C>();
	}
};

}

