#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MenuMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Enum_WidgetAnimType_structs.hpp"
#include "Enum_NavigationAction_structs.hpp"
#include "Enum_MenuHandlerType_structs.hpp"
#include "Enum_NavigationType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MenuMaster.WB_MenuMaster_C
// 0x02D0 (0x05B0 - 0x02E0)
class UWB_MenuMaster_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Empty;                                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ContentFadeIN;                                     // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ContentFadeOut;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ContentOut;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ContentIN;                                         // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               MainContentPanel;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BlockingOverlay;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ContentSwitcher;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    WidgetPool;                                        // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          EnableTilt;                                        // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              AspectRatioWindowSize;                             // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NavigationDelay;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ContentToggleDelay;                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CycleNextKeys;                                     // 0x0360(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           CyclePrevKeys;                                     // 0x0370(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           BackKeys;                                          // 0x0380(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           UpKeys;                                            // 0x0390(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           DownKeys;                                          // 0x03A0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           LeftKeys;                                          // 0x03B0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           RightKeys;                                         // 0x03C0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           SelectKeys;                                        // 0x03D0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           DeleteKeys;                                        // 0x03E0(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftClassPtr<class UClass>>           PooledWidgets;                                     // 0x03F0(0x0010)(Edit, BlueprintVisible)
	class UUserWidget*                            CurrentContent;                                    // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               EmptyContent;                                      // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWidget*                                LastFocusedNavigable;                              // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusedNavigable;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWB_TabMenuConstructor_C*               FocusedTabConstructor;                             // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TargetContentClass;                                // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Enum_WidgetAnimType                           ContentAnimationType;                              // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MenuHandlerType                          CurrentMenuType;                                   // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, class UClass*>            ContentStepMap;                                    // 0x0438(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, class UWidget*>           FocusableStepMap;                                  // 0x0488(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        CurrentNavigables;                                 // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWB_SingleSettingBar_C*>         KeybindingSettingBars;                             // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUserWidget*                            LastContent;                                       // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWB_RequestBox_C*                       RequestPopup;                                      // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWB_KeyBindingButton_C*                 FocusedKeyListener;                                // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LastFocusedSwitcherIndex;                          // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastFocusedKeyInput;                               // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LastCursorPosition;                                // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MouseDeltaTimer;                                   // 0x0528(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentTilt;                                       // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* Navigable)> OnNavigableHovered;                     // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Navigable)> OnNavigableUnHovered;                   // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Navigable)> OnNavigableClicked;                     // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsPreviousContent;                                 // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NavigatingByKeys;                                  // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanNavigate;                                       // 0x0572(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingToFocusTab;                               // 0x0573(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusedToSubTab;                                   // 0x0574(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingForInput;                                   // 0x0575(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocusedToEntryBox;                               // 0x0576(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocusedToColorPicker;                            // 0x0577(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCursorVisible;                                   // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastKeyIsGamepadKey;                               // 0x0579(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckCursor;                                       // 0x057A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputDisabled;                                     // 0x057B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SelectedPlayerName;                                // 0x057C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SavedGames;                                        // 0x0588(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioComponent*                        IntroSoundComponent;                               // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Went_to_Selection_Interface;                       // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AC_MainMenuLoop_SC;                                // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddToWidgetPool(const class UUserWidget*& NewWidget);
	void Call_OnFocusChangedForTab(bool IsFocused);
	void Call_OnPanelLoaded_ForTab();
	void Call_OnPanelUnLoaded_ForTab();
	void Call_ReturnBackToMainMenu();
	void Center_Mouse();
	bool Check_CurrentMenu(Enum_MenuHandlerType MenuType);
	void Clear_SavedSteps();
	void Construct();
	void Construct_MenuSystem();
	void Create_AspectRatio_Container(class UUserWidget* Widget);
	void Create_Request_Box(const class FText& Label, const struct FLinearColor& BackgroundColor, const struct FLinearColor& FadeColor, const struct FLinearColor& FrameColor, const struct FLinearColor& ProgressBarColor, double SecondsToHide, const TArray<struct FStruct_CustomButtonAppearence>& Buttons, class UWB_RequestBox_C** RequestPopup_0);
	void Create_Widget_Essentials();
	void Disable_Input(bool InputDisabled_0);
	void ExecuteUbergraph_WB_MenuMaster(int32 EntryPoint);
	class UUserWidget* Find_InContentPool(class UClass* TargetClass, bool* Success);
	void Find_TabbedMenuReference();
	void GoToSelectionInterface();
	void Load_HubWorld_Menu();
	void Load_Content_From_Class(class UClass* PanelToLoad, Enum_WidgetAnimType AnimationType, bool* bSuccess);
	void Load_Previous_Content(Enum_WidgetAnimType AnimationType);
	void Mouse_Delta_Check();
	void Navigable_Clicked(class UWidget* Navigable);
	void Navigable_Hovered(class UWidget* Navigable);
	void Navigable_UnHovered(class UWidget* Navigable);
	void Navigation_Check();
	void On_ContentInAnimFinished();
	void On_ContentOutAnimFinished();
	void OnLoaded_0B757E7448BB44546FBF5DA5AEE2EDE2(TSubclassOf<class UObject> Loaded);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Pool_Widgets();
	void Refresh_Navigables();
	void Remove_FocusableStep(const class UClass*& CurrentWidget);
	void Remove_Request_Box();
	void Remove_Step(const class UClass*& CurrentWidget);
	void Return_Back_In_Pause_Menu();
	void Save_LastFocusable(class UClass* Content, class UWidget* Focusable);
	void Save_LastStep(class UClass* CurrentWidget, class UClass* TargetWidget);
	void Selection_Interface();
	void Send_Pressed_Key_Info(const struct FKey& Key);
	void Set_FocusedNavigable(class UWidget* NewFocus);
	void Set_Mouse_Delta_Timer();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TiltUI(class UWidget* WidgetToTilt);
	void Toggle_Content_Items(class UWidget*& Target, bool Hide);
	void Toggle_Gamepad_Icons(bool Visible);
	void Try_Update_Cursor();
	void Update_Camera_Position(class FName Tag);
	void Update_CurrentMenuType(Enum_MenuHandlerType CurrentMenuType_0);

	bool Check_CurrentPanel(class UClass* Class_0) const;
	bool Check_LastStep(class UClass* Class_0) const;
	class UWidget* Find_ButtonByName(TArray<class FName>& InNameArray) const;
	class UWidget* Find_TargetFocusable(bool Next, bool* Focusable) const;
	class UWidget* Get_FirstEnabledFocusable() const;
	class UWidget* Get_LastFocusable(const class UClass*& TargetContent) const;
	class UClass* Get_LastStep(const class UClass*& CurrentWidget) const;
	void Get_NavigationKeybindings(const struct FStruct_NavigationKeyAction& NavigationKeyInfo, const struct FKey& PressedKey, Enum_NavigationAction* Action, TArray<class FName>* NameArray) const;
	bool HasAnySaveGame_() const;
	void IsAnyAnimationPlaying_(bool* ReturnValueNOT) const;
	bool IsBackKey_(const struct FKey& PressedKey) const;
	bool IsCycleKeys_(const struct FKey& PressedKey, bool* Next) const;
	bool IsNavigationKey_(const struct FKey& PressedKey) const;
	bool IsRequestPopUpVisible_() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_MenuMaster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_MenuMaster_C")
	}
	static class UWB_MenuMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MenuMaster_C>();
	}
};

}

