#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PauseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_CustomButtonAppearence_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_PauseMenu.WB_PauseMenu_C
// 0x0088 (0x0368 - 0x02E0)
class UWB_PauseMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ButtonList;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     Continue;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     ReturnMainMenu;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     SaveGame;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     Settings;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BottomInfoConstructor_C*            WB_BottomInfoConstructor;                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_FrameBuilder::UWB_FrameBuilder_C*    WB_FrameBuilder;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_1;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleButton_C*                     WB_SingleButton_2;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleGridButton_C*                 WB_SingleGridButton;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleGridButton_C*                 WB_SingleGridButton_1;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FStruct_CustomButtonAppearence> RequestBoxButtons;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStruct_CustomButtonAppearence> RequestBoxButtons1;                                // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WB_PauseMenu_MainMenu_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_PauseMenu_MainMenu_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_PauseMenu_WB_SingleButton_3_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_PauseMenu_WB_SingleButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class UWB_SingleButton_C* SelfReference);
	void BndEvt__WB_PauseMenu_WB_SingleGridButton_1_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature(class UWB_SingleGridButton_C* SelfReference);
	void BndEvt__WB_PauseMenu_WB_SingleGridButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature(class UWB_SingleGridButton_C* SelfReference);
	void Call_On_TabChanged(class UWidget* TabReference);
	void ExecuteUbergraph_WB_PauseMenu(int32 EntryPoint);
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	void On_LoadingScreenEnd();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_RequestBox_Button_Clicked(class UWB_SingleButton_C* ButtonReference);
	void On_WidgetConstructed();
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_PauseMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_PauseMenu_C")
	}
	static class UWB_PauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_PauseMenu_C>();
	}
};

}

