#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuestLogFilter

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_QuestLogFilter.WB_QuestLogFilter_C.ExecuteUbergraph_WB_QuestLogFilter
// 0x0008 (0x0008 - 0x0000)
struct WB_QuestLogFilter_C_ExecuteUbergraph_WB_QuestLogFilter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_QuestLogFilter.WB_QuestLogFilter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_QuestLogFilter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_QuestLogFilter.WB_QuestLogFilter_C.Set_Hovered
// 0x0002 (0x0002 - 0x0000)
struct WB_QuestLogFilter_C_Set_Hovered final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_QuestLogFilter.WB_QuestLogFilter_C.Set_Selected
// 0x0002 (0x0002 - 0x0000)
struct WB_QuestLogFilter_C_Set_Selected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

