#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuestCompleted

#include "Basic.hpp"

#include "Struct_QuestCompletedUI_structs.hpp"


namespace SDK::Params
{

// Function WB_QuestCompleted.WB_QuestCompleted_C.Display_QuestCompleted
// 0x0048 (0x0048 - 0x0000)
struct WB_QuestCompleted_C_Display_QuestCompleted final
{
public:
	struct FStruct_QuestCompletedUI               Settings;                                          // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function WB_QuestCompleted.WB_QuestCompleted_C.ExecuteUbergraph_WB_QuestCompleted
// 0x0060 (0x0060 - 0x0000)
struct WB_QuestCompleted_C_ExecuteUbergraph_WB_QuestCompleted final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_QuestCompletedUI               K2Node_CustomEvent_Settings;                       // 0x0008(0x0048)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

