#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TabbedMultiplayerGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TabbedMultiplayerGame.WB_TabbedMultiplayerGame_C
// 0x0060 (0x0340 - 0x02E0)
class UWB_TabbedMultiplayerGame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BBack;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Container;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_134;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TabMenuConstructor_C*               WB_TabMenuConstructor;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   GearManager;                                       // 0x0318(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WB_PickClass_BBack_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Call_On_TabChanged(class UWidget* TabReference);
	void ExecuteUbergraph_WB_TabbedMultiplayerGame(int32 EntryPoint);
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	ESlateVisibility GetGreyArrowVisibility();
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	void On_LoadingScreenEnd();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_WidgetConstructed();
	void OnLoaded_42D9BFB04CA7F4BC6CCF54B6303A16C9(TSubclassOf<class UObject> Loaded);
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_TabbedMultiplayerGame_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_TabbedMultiplayerGame_C")
	}
	static class UWB_TabbedMultiplayerGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TabbedMultiplayerGame_C>();
	}
};

}

