#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Video_GraphicSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Video_GraphicSettings.WB_Video_GraphicSettings_C
// 0x0088 (0x0368 - 0x02E0)
class UWB_Video_GraphicSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SingleSettingBar_C*                 AntiAliasign;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 Foliage;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 OverallQuality;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 PostProcess;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SettingsContainer;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 Shading;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 Shadows;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 TextureQuality;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 ViewDistance;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 VisualEffects;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_2;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TextureQualityLevel;                               // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPQualityLevel;                                    // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShadingQualityLevel;                               // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AAQualityLevel;                                    // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FoliageQualityLevel;                               // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShadowQualityLevel;                                // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VisualEffectsQualityLevel;                         // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewDistanceQualityLevel;                          // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverallQualityLevel;                               // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyAndSaveCustomSettings();
	void BndEvt__AntiAliasign_K2Node_ComponentBoundEvent_9_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__Foliage_K2Node_ComponentBoundEvent_8_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__OverallQuality_K2Node_ComponentBoundEvent_7_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__PostProcess_K2Node_ComponentBoundEvent_1_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__Shading_K2Node_ComponentBoundEvent_2_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__Shadows_K2Node_ComponentBoundEvent_3_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__ViewDistance_K2Node_ComponentBoundEvent_6_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__VisualEffects_K2Node_ComponentBoundEvent_5_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__WB_SingleSettingBar_16_K2Node_ComponentBoundEvent_0_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void Call_On_TabChanged(class UWidget* TabReference);
	void Construct();
	void ExecuteUbergraph_WB_Video_GraphicSettings(int32 EntryPoint);
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	void On_LoadingScreenEnd();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_WidgetConstructed();
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void PreConstruct(bool IsDesignTime);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void Set_Defaults();
	void Set_OverallQuality();
	void Set_OverallQualityToCustom();
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_Video_GraphicSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_Video_GraphicSettings_C")
	}
	static class UWB_Video_GraphicSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Video_GraphicSettings_C>();
	}
};

}

