#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Video_VideoSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Video_VideoSettings.WB_Video_VideoSettings_C
// 0x0078 (0x0358 - 0x02E0)
class UWB_Video_VideoSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_SingleSettingBar_C*                 FPSLimit;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 Gamma;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 MotionBlur;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 Resolution;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 ResolutionScale;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SettingsContainer;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 VSync;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WB_SingleSettingBar_1;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SingleSettingBar_C*                 WindowMode;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           AvailableResolutions;                              // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        FrameRateLimit;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   InFullscreenMode;                                  // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VSyncEnabled;                                      // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MotionBlurEnabled;                                 // 0x0352(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Gamma_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature(double NewValue);
	void BndEvt__MotionBlur_K2Node_ComponentBoundEvent_2_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__ResolutionScale_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature(double NewValue);
	void BndEvt__ResolutionWidget_K2Node_ComponentBoundEvent_3_OnSelectionChanged__DelegateSignature(int32 SelectedIndex, class FName SelectedOption);
	void BndEvt__Vsync_K2Node_ComponentBoundEvent_1_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__WB_SingleSettingBar_2_K2Node_ComponentBoundEvent_0_OnSwitchButtonSelected__DelegateSignature(class FName ButtonName);
	void BndEvt__WindowMode_K2Node_ComponentBoundEvent_4_OnSelectionChanged__DelegateSignature(int32 SelectedIndex, class FName SelectedOption);
	void Call_On_TabChanged(class UWidget* TabReference);
	void ExecuteUbergraph_WB_Video_VideoSettings(int32 EntryPoint);
	int32 Find_SelectedResolutionIndex();
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	void On_LoadingScreenEnd();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_WidgetConstructed();
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_Video_VideoSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_Video_VideoSettings_C")
	}
	static class UWB_Video_VideoSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Video_VideoSettings_C>();
	}
};

}

