#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_WeaponInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "FWWeapon_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_WeaponInventory.WB_WeaponInventory_C
// 0x0238 (0x0518 - 0x02E0)
class UWB_WeaponInventory_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AmmoType;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Count;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Default;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquippedBorder;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EquippedText;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Invalid;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InvalidCharacter;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvalidRig_2;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvalidRig_3;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_NewItem_C*                           NewItem;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                WeaponButton;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponExperienceBar_C*               WeaponExperienceBar;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WeaponIcon;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WeaponName;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WeaponNickname;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    WeaponRow;                                         // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(class UWB_WeaponInventory_C* Weapon)> WeaponDragged;               // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              WeaponReleased;                                    // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFWWeaponDefaults>              ChangedParts;                                      // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             WeaponImage;                                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWB_WeaponInventory_C* WeaponRow)> WeaponHovered;            // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              WeaponUnhovered;                                   // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWB_WeaponInventory_C* WeaponWidget)> WeaponClicked;         // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CanUse;                                            // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Nickname;                                          // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UFWWeaponDefinition*                    WeaponDef;                                         // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFWModifiedStatsPart                   WeaponStats;                                       // 0x0400(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ECustomizationType, class FName>         PartsToRows;                                       // 0x0460(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          RecentlyClicked;                                   // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWB_WeaponInventory_C* WeaponWidget)> WeaponDoubleClicked;   // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTagContainer                  WeaponTags;                                        // 0x04C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CharacterTag;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ValidCharacter;                                    // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWSkillDefinition*                     Skill_Definition;                                  // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 FileUsed;                                          // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdjustStats(class FName RowName);
	void BndEvt__WB_WeaponInventory_Button_63_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WB_WeaponInventory_Button_63_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WB_WeaponInventory_WeaponButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_WeaponInventory_WeaponButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_WeaponInventory_WeaponButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	bool CanUse_();
	void CompatibleAttachment(class FName RowName, TArray<struct FDataTableRowHandle>& Parts, bool* Compatible);
	void Equipped(bool IsEquipped);
	void ExecuteUbergraph_WB_WeaponInventory(int32 EntryPoint);
	class UWidget* Get_WeaponButton_ToolTipWidget();
	void GetAttachmentRow(ECustomizationType Category, uint8 ExtraData, class FString* Row);
	void GetRows(class FName* WeaponRow_0, TArray<class FName>* Part_Rows);
	void GetWeaponData(class FText* Name_0, class UTexture2D** Texture, class FText* Description, float* Weight, class UFWWeaponDefinition** WeaponPartTunable, struct FFWModifiedStatsPart* WeaponStats_0);
	void GetWeaponPartRows(TMap<ECustomizationType, class FName>* PartRows);
	bool HasRequiredTags(const struct FGameplayTagContainer& RequiredTags);
	void PreConstruct(bool IsDesignTime);
	void RenameWeapon(const class FString& Nickname_0);
	void SelectionStatusChanged(bool Status);
	void SetNewStatus(const TMap<ECustomizationType, struct FFWPartRows>& NewParts, const TMap<ECustomizationType, struct FFWPartRows>& KnownParts);
	void SetWeaponData(const class FString& Nickname_0, class UTexture2D* WeaponImage_0, const struct FDataTableRowHandle& WeaponRow_0, const struct FVector2D& WeaponSize, const TArray<struct FFWWeaponDefaults>& WeaponParts, const class FString& Filename, bool CanUse_0, bool DefaultWeapon, int32 Count_0);
	void SetWeaponStats();
	void UpdateUseable(bool CanUse_0);
	void UpdateWeaponTexture(const class FString& InNickname, const class FString& InFilename, class UTexture2D* InWeaponImage);
	void ValidCharacter_(const struct FGameplayTagContainer& AllowTags, const struct FGameplayTagContainer& RequiredTags);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_WeaponInventory_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_WeaponInventory_C")
	}
	static class UWB_WeaponInventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_WeaponInventory_C>();
	}
};

}

