#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VendorSelectedItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VendorSelectedItem.WBP_VendorSelectedItem_C
// 0x0070 (0x0350 - 0x02E0)
class UWBP_VendorSelectedItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Horiline;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemDescription;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Stats;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    WBP_SingleButton;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_VendorItem_C*                        SelectedItem;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UW_VendorItem_C* Item, bool Buy_)> StartTransaction;         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Buy;                                               // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CostMultiplier;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         PlayerCash;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SellMultiplier;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowBuddyData(class UW_VendorItem_C* Item, bool Buy_);
	void UpdatePlayerCash(int64 PlayerCash_0, double CostMultiplier_0, double SellMultiplier_0);
	void Reset();
	void TransactionPossible_(bool* Possible);
	void AddTextStat(const class FText& StatName, double Stat, const class FText& statType);
	void GetVolume_Weight(const struct FInventoryContainer& InventoryContainer, double* VolumeCapacity, float* Weight);
	void SetPriceNameIcon(const class FText& Name_0, TSoftObjectPtr<class UTexture2D> Icon, const struct FDataTableRowHandle& ValueRow, int32 Value, bool Weapon_, const class FText& CurrencyType, bool Buy_);
	void ShowFrameData(class UW_VendorItem_C* Item, bool Buy_);
	void ShowDanglyData(class UW_VendorItem_C* Item, bool Buy_);
	void ShowRigData(class UW_VendorItem_C* Item, bool Buy_);
	void ShowContainerData(class UW_VendorItem_C* Item, bool Buy_);
	void ShowWeaponData(class UW_VendorItem_C* Item, bool Buy_);
	void ShowItemData(class UW_VendorItem_C* Item, bool Buy_);
	void Unhovered();
	void Hovered(class UW_VendorItem_C* Item, bool Buy_);
	void Initialize(class UW_VendorItem_C* Item, bool Buy_);
	void BndEvt__WBP_VendorSelectedItem_WBP_SingleButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_VendorSelectedItem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_VendorSelectedItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_VendorSelectedItem_C")
	}
	static class UWBP_VendorSelectedItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VendorSelectedItem_C>();
	}
};

}

