#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FrameSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_BaseSelector_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FrameSelector.WBP_FrameSelector_C
// 0x0068 (0x03A0 - 0x0338)
class UWBP_FrameSelector_C final : public UWBP_BaseSelector_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_FrameSelector_C;                // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   FrameClassRow;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              FrameIcon;                                         // 0x0348(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_BaseSelector_C* Selector, TSoftObjectPtr<class UTexture2D> Icon)> FrameHovered; // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_BaseSelector_C* Selector)> FrameUnhovered;              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_BaseSelector_C* Selector, class FName Frame)> FrameClicked; // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_FrameSelector_Button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_FrameSelector_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FrameSelector_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_FrameSelector(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_FrameSelector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_FrameSelector_C")
	}
	static class UWBP_FrameSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FrameSelector_C>();
	}
};

}

