#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InnardsLift

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_OptionPopupBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InnardsLift.WBP_InnardsLift_C
// 0x0078 (0x0370 - 0x02F8)
class UWBP_InnardsLift_C final : public UWBP_OptionPopupBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ActionTextBlock;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    SelectButton;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Floors;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_Language_C*           WBP_SingleButton_Floor;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_Language_C*           WBP_SingleButton_Floor_2;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_SingleButton_Language_C*>   Floor_Buttons;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FString                                 Current_Floor_String;                              // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UDataTable*                             Floors_Data_Table;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Floor_Text;                                        // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Drone_on_its_way;                                  // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CloseWidget();
	void Construct();
	class UWBP_SingleButton_Language_C* CreateFloorButton(const class FString& Floor_Level_Name, const class FText& Floor_User_Facing_Name, class FName RowName, int32 Floor_Number, bool Unlocked_);
	void ExecuteUbergraph_WBP_InnardsLift(int32 EntryPoint);
	void Floor_Unlocked_(const class FString& Floor, bool* Floor_Unlocked__0);
	void HubButtonHax();
	void On_Floor_Clicked(const class FString& CultureString, class FName RowName);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void SelectFloor(class FName Floor_Name);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InnardsLift_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InnardsLift_C")
	}
	static class UWBP_InnardsLift_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InnardsLift_C>();
	}
};

}

