#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_3DPreviewImage

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_3DPreviewImage.WBP_3DPreviewImage_C.ExecuteUbergraph_WBP_3DPreviewImage
// 0x0050 (0x0050 - 0x0000)
struct WBP_3DPreviewImage_C_ExecuteUbergraph_WBP_3DPreviewImage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWCharacterSkillsViewModel*            K2Node_Event_InSkillsViewModel;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InSoftTexture;                        // 0x0010(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_3DPreviewImage.WBP_3DPreviewImage_C.SetFWCharacterSkillsViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_3DPreviewImage_C_SetFWCharacterSkillsViewModel final
{
public:
	class UFWCharacterSkillsViewModel*            ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_3DPreviewImage.WBP_3DPreviewImage_C.SetPreviewImage
// 0x0028 (0x0028 - 0x0000)
struct WBP_3DPreviewImage_C_SetPreviewImage final
{
public:
	TSoftObjectPtr<class UTexture2D>              InSoftTexture;                                     // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};

// Function WBP_3DPreviewImage.WBP_3DPreviewImage_C.SetSkillsViewmodel
// 0x0008 (0x0008 - 0x0000)
struct WBP_3DPreviewImage_C_SetSkillsViewmodel final
{
public:
	class UFWCharacterSkillsViewModel*            InSkillsViewModel;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

