#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AttachmentCategoryTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "WBP_CustomizationCategoryBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AttachmentCategoryTab.WBP_AttachmentCategoryTab_C
// 0x0050 (0x0870 - 0x0820)
class UWBP_AttachmentCategoryTab_C final : public UWBP_CustomizationCategoryBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_AttachmentCategoryTab_C;        // 0x0820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(class UWBP_AttachmentCategoryTab_C* AttachmentClicked, class FText WeaponPart, bool IsVital, TArray<ECustomizationType>& CompatibleAttachments, bool OverrideExtraData, uint8 ExtraData)> FilterClicked; // 0x0828(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonName;                                        // 0x0838(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          VitalPart;                                         // 0x0848(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationType>                    CompatibleAttachments;                             // 0x0850(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          OverrideExtraPartData;                             // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         ExtraPartData;                                     // 0x0861(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_FilterButton_Button_52_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_AttachmentCategoryTab(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdatePartName(const class FText& NewName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_AttachmentCategoryTab_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_AttachmentCategoryTab_C")
	}
	static class UWBP_AttachmentCategoryTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AttachmentCategoryTab_C>();
	}
};

}

