#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomizationCategoryBase

#include "Basic.hpp"

#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CustomizationCategoryBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.ExecuteUbergraph_WBP_CustomizationCategoryBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomizationCategoryBase_C_ExecuteUbergraph_WBP_CustomizationCategoryBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.UpdateNewStatus
// 0x0020 (0x0020 - 0x0000)
struct WBP_CustomizationCategoryBase_C_UpdateNewStatus final
{
public:
	TArray<struct FDataTableRowHandle>            New_Parts;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FDataTableRowHandle>            Known_Parts;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.Disabled
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_CustomizationCategoryBase_C_Disabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x007C(0x0014)()
	struct FSlateFontInfo                         CallFunc_ColourTextOutline_SlateFontInfo2;         // 0x0090(0x0060)(HasGetValueTypeHash)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.OnHover
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_CustomizationCategoryBase_C_OnHover final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0050(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0064(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0078(0x0014)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_ColourImageOutline_SlateBrush;            // 0x0090(0x00D0)()
	struct FSlateFontInfo                         CallFunc_ColourTextOutline_SlateFontInfo2;         // 0x0160(0x0060)(HasGetValueTypeHash)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.ColourImageOutline
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_CustomizationCategoryBase_C_ColourImageOutline final
{
public:
	struct FSlateBrush                            SlateBrush2;                                       // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateColor                            Color;                                             // 0x00D0(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	uint8                                         Pad_E4[0xC];                                       // 0x00E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SlateBrush;                                        // 0x00F0(0x00D0)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01C0(0x0014)()
	uint8                                         Pad_1D4[0xC];                                      // 0x01D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrushOutlineSettings             K2Node_MakeStruct_SlateBrushOutlineSettings;       // 0x01E0(0x0040)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0220(0x00D0)()
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.ColourTextOutline
// 0x0150 (0x0150 - 0x0000)
struct WBP_CustomizationCategoryBase_C_ColourTextOutline final
{
public:
	struct FSlateFontInfo                         SlateFontInfo;                                     // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FLinearColor                           OutlineColor;                                      // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         SlateFontInfo2;                                    // 0x0070(0x0060)(Parm, OutParm, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x00D0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x00F0(0x0060)(HasGetValueTypeHash)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.UpdateName
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomizationCategoryBase_C_UpdateName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_CustomizationCategoryBase.WBP_CustomizationCategoryBase_C.ChangeSelected
// 0x03B0 (0x03B0 - 0x0000)
struct WBP_CustomizationCategoryBase_C_ChangeSelected final
{
public:
	bool                                          SelectedStatus;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x007C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0090(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x00A4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x00B8(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_10;                   // 0x00CC(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_11;                   // 0x00E0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_12;                   // 0x00F4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_13;                   // 0x0108(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_14;                   // 0x011C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_15;                   // 0x0130(0x0014)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         CallFunc_ColourTextOutline_SlateFontInfo2;         // 0x0148(0x0060)(HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_ColourImageOutline_SlateBrush;            // 0x01B0(0x00D0)()
	struct FSlateBrush                            CallFunc_ColourImageOutline_SlateBrush_1;          // 0x0280(0x00D0)()
	struct FSlateFontInfo                         CallFunc_ColourTextOutline_SlateFontInfo2_1;       // 0x0350(0x0060)(HasGetValueTypeHash)
};

}

