#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeconflictItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DeconflictItem.WBP_DeconflictItem_C.ExecuteUbergraph_WBP_DeconflictItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_DeconflictItem_C_ExecuteUbergraph_WBP_DeconflictItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DeconflictItem.WBP_DeconflictItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DeconflictItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

