#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RADAR_PuzzleAdvertisement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RADAR_PuzzleAdvertisement.WBP_RADAR_PuzzleAdvertisement_C
// 0x0028 (0x0370 - 0x0348)
class UWBP_RADAR_PuzzleAdvertisement_C final : public UFWLockPuzzleAdvertisement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_InputActionKey_NoBg_C*             LootActionKey;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_36;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          External_Text_Call;                                // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RADAR_PuzzleAdvertisement(int32 EntryPoint);
	void OnUnlocked();
	void RADAR_Puzzle_Text(const class FText& Pre_Text, const class FText& Post_Text);
	void SetPuzzleText(const class FText& PreText, const class FText& PostText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_RADAR_PuzzleAdvertisement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_RADAR_PuzzleAdvertisement_C")
	}
	static class UWBP_RADAR_PuzzleAdvertisement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RADAR_PuzzleAdvertisement_C>();
	}
};

}

