#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TitleArrowButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_BaseButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TitleArrowButton.WBP_TitleArrowButton_C
// 0x0C58 (0x0F40 - 0x02E8)
class UWBP_TitleArrowButton_C final : public UWBP_BaseButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_TitleArrowButton_C;             // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Arrow_Text;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_Text;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_TitleArrowButton_C* Button)> OnClicked;                 // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   TitleText;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           ButtonStyle;                                       // 0x0330(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NormalTextColor;                                   // 0x0720(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_734[0xC];                                      // 0x0734(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           NormalStyle;                                       // 0x0740(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           ClickedStyle;                                      // 0x0B30(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            ClickedTextColor;                                  // 0x0F20(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__WBP_TwoRowButton_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_TitleArrowButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetStyle(bool bClicked_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TitleArrowButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TitleArrowButton_C")
	}
	static class UWBP_TitleArrowButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TitleArrowButton_C>();
	}
};

}

