#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FilterComboBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FilterComboBox.WBP_FilterComboBox_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_FilterComboBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxKey*                           ComboBoxKey;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Option)>  OptionSelected;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         Options;                                           // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   FilterType;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void AddOptions(TArray<class FString>& Options_0);
	void BndEvt__WBP_ComboBox_ComboBoxKey_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(class FName SelectedItem, ESelectInfo SelectionType);
	class UWidget* ContentWidget(class FName Item);
	void ExecuteUbergraph_WBP_FilterComboBox(int32 EntryPoint);
	class UWidget* ItemWidget(class FName Item);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_FilterComboBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_FilterComboBox_C")
	}
	static class UWBP_FilterComboBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FilterComboBox_C>();
	}
};

}

