#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SquadManagerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWMainMenu_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SquadManagerBase.WBP_SquadManagerBase_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_SquadManagerBase_C : public UFWSquadManagementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<bool>                                  ConnectedPlayers;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SelectedPlayer;                                    // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsServer;                                         // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPartyLeader;                                      // 0x02FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSquadMemberButtonHovered;                         // 0x02FE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSquadMemberEditorHovered;                         // 0x02FF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SquadMemberEditor_C*               LocalSquadEditor;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         UnhoverGraceDuration;                              // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void GetMemberEditorWidget(class UWBP_SquadMemberEditor_C** SquadMemberEditorWidget);
	void GetSquadMemberButtons(TArray<class UW_SquadMemberButton_C*>* Array);
	void SetPlayersList(const TArray<class APlayerState*>& PlayersStates);
	void ExecuteUbergraph_WBP_SquadManagerBase(int32 EntryPoint);
	void TryUnhover();
	void SquadMemberEditorUnhovered();
	void SquadMemberEditorHovered();
	void OnSquadMemberButtonUnhovered(int32 PlayerIndex);
	void OnSquadMemberButtonHovered(int32 PlayerIndex);
	void OnSquadMemberButtonClicked(int32 PlayerIndex);
	void OnPlayerStatesChanged(const class FString& PlayerName, const bool bIsHost);
	void SelectSquadMemberButton();
	void SetupSquad();
	void ResetPlayersList();
	void Completed_19F85FDC4A3A555554509FAAAE45F0DF(const struct FOnlineResultInformation& Result);
	void UpdatePlayersList();
	void InvitePlayer();
	void DisbandSquad();
	void LeaveSquad();
	void UnhoverGracePeriod();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SquadManagerBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SquadManagerBase_C")
	}
	static class UWBP_SquadManagerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SquadManagerBase_C>();
	}
};

}

