#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Option_OpenWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Option_OpenWidget.WBP_Option_OpenWidget_C.ExecuteUbergraph_WBP_Option_OpenWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_Option_OpenWidget_C_ExecuteUbergraph_WBP_Option_OpenWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_OptionPopupBase_C*                 CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Option_OpenWidget.WBP_Option_OpenWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Option_OpenWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Option_OpenWidget.WBP_Option_OpenWidget_C.SetButtonTitleText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Option_OpenWidget_C_SetButtonTitleText final
{
public:
	class FText                                   TitleText_0;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

