#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillPanel

#include "Basic.hpp"

#include "FWPersistence_structs.hpp"
#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WBP_BasePanel_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillPanel.WBP_SkillPanel_C
// 0x0230 (0x0510 - 0x02E0)
class UWBP_SkillPanel_C final : public UWBP_BasePanel_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bottom_BG;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_SkillName;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SkillIcon;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SkillDescription;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SkillOwned;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_XP;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BackgroundPanel_C*                 WBP_BackgroundPanel;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PopUpButton_1_C*                   WBP_PopUpButton_1;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Skill_Button_C*                    SkillButton;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSkillData                             SkillData;                                         // 0x0338(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FSkillData>  Skill_Tree;                                        // 0x03A0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSkillData                             Skill;                                             // 0x03F0(0x0068)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         CharacterType;                                     // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Skill_Name;                                        // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              ReturnFocus;                                       // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFWSkillDefinition*                     Skill_Definition;                                  // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CharacterTag;                                      // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnlocked;                                         // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanEquip;                                         // 0x0491(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipped;                                         // 0x0492(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanUnlock;                                        // 0x0493(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanAfford;                                        // 0x0494(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSkillPurchased;                                  // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int64                                         SkillPrice;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurrencyType                          ExperienceCurrencyType;                            // 0x04B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   LearnSkillText;                                    // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EquipSkillText;                                    // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              UpdateXPData;                                      // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_SkillPanel_WBP_PopUpButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Cancelled_A12F5AC8407E2B8E3E82F792C41653DD(class UFWPopupWidget* NewPopUp);
	void Cancelled_FED65AF645EF924AFB4755A8C8C673E6(class UFWPopupWidget* NewPopUp);
	bool CanUnlockSkillForPlayer();
	void Confirmed_A12F5AC8407E2B8E3E82F792C41653DD(class UFWPopupWidget* NewPopUp);
	void Confirmed_FED65AF645EF924AFB4755A8C8C673E6(class UFWPopupWidget* NewPopUp);
	void ConfirmSkill();
	void Construct();
	void Created_A12F5AC8407E2B8E3E82F792C41653DD(class UFWPopupWidget* NewPopUp);
	void Created_FED65AF645EF924AFB4755A8C8C673E6(class UFWPopupWidget* NewPopUp);
	void EquipSkill();
	void ExecuteUbergraph_WBP_SkillPanel(int32 EntryPoint);
	void GetBPGameInstance(class UBP_GameInstance_C** BPGameMode);
	void InitialiseSkills();
	void LearnSkill();
	void SetEquippedSkill();
	void Setup(class UWBP_Skill_Button_C* InSkillButton);
	void TryOpenLearnSkillPopup();
	void UpdateCanAfford();
	void UpdateSkillOwnedText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SkillPanel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SkillPanel_C")
	}
	static class UWBP_SkillPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillPanel_C>();
	}
};

}

