#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterDetails

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CharacterDetails.WBP_CharacterDetails_C.Initialise
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterDetails_C_Initialise final
{
public:
	class FText                                   CharacterTitle_0;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CharacterName_0;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CharacterFaction_0;                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UTexture2D>              CharacterImage_0;                                  // 0x0030(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

