#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponSlotWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ForeverWinter_structs.hpp"


namespace SDK::Params
{

// Function WBP_WeaponSlotWidget.WBP_WeaponSlotWidget_C.ExecuteUbergraph_WBP_WeaponSlotWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_WeaponSlotWidget_C_ExecuteUbergraph_WBP_WeaponSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 K2Node_Event_CustomTexture;                        // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FIntPoint                              K2Node_Event_CustomSize;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScreenshot                            K2Node_MakeStruct_Screenshot;                      // 0x0020(0x0018)()
	class UTexture2D*                             CallFunc_ConvertBytesToTexture_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_WeaponSlotWidget.WBP_WeaponSlotWidget_C.SetTextureFromCustomTexture
// 0x0018 (0x0018 - 0x0000)
struct WBP_WeaponSlotWidget_C_SetTextureFromCustomTexture final
{
public:
	TArray<uint8>                                 CustomTexture;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FIntPoint                              CustomSize;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

