#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActiveQuestDescription

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ActiveQuestDescription.WBP_ActiveQuestDescription_C.ExecuteUbergraph_WBP_ActiveQuestDescription
// 0x0028 (0x0028 - 0x0000)
struct WBP_ActiveQuestDescription_C_ExecuteUbergraph_WBP_ActiveQuestDescription final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0010)()
};

// Function WBP_ActiveQuestDescription.WBP_ActiveQuestDescription_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActiveQuestDescription_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

