#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuMaster

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "FWMainMenu_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuMaster.WBP_MenuMaster_C
// 0x0130 (0x0420 - 0x02F0)
class UWBP_MenuMaster_C final : public UFWMenuMasterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URetainerBox*                           backgroundtexturevid;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_Character;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_CombatLoadout;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_Quests;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_ReadyRoom;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_Regions;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_Squads;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_Vendors;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Btn_WaterVault;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HubMenuWidgetSwitcher;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MasterOverlay;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 REF;                                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_WaterVault;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SubMenuWidgetSwitcher;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ToastMessage_C*                    ToastMessage;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_VaultMaster_C*                       W_VaultMaster;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ArrowButton_C*                     WBP_ArrowButton_Next;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ArrowButton_C*                     WBP_ArrowButton_Prev;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterSelection_C*              WBP_CharacterSelection;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HubMenu_C*                         WBP_HubMenu;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Missions_C*                        WBP_Missions;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OverlayButton_C*                   WBP_OverlayButton_93;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QuestMenu_C*                       WBP_QuestMenu;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VendorMaster_C*                    WBP_VendorMaster;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_MenuButton_C*>              TopButtons;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUserWidget*                            OverlayWidget;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_HubWorldGameState_C*                HubWorldGameState;                                 // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SB_UISelectionSFX_SC;                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SB_UIBackSFX_SC;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFWQuest*                               QuestBeingRewarded;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bWaterVaultUnlocked;                               // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PopUp_QuestRewards_C*              QuestRewardWidget;                                 // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           PendingQuestRewards;                               // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddQuestRewardWidget(class UFWQuest* InQuest);
	void AddToMasterCanvas(class UUserWidget* Widget);
	void BndEvt__WBP_MenuMaster_Btn_Regions_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_Btn_WaterVault_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_ArrowButton_Next_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_ArrowButton_Prev_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_Character_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_CharacterSelection_K2Node_ComponentBoundEvent_10_ReturnFocus__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_CombatLoadout_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_HubMenu_K2Node_ComponentBoundEvent_13_ReturnFocus__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_Missions_K2Node_ComponentBoundEvent_12_ReturnFocus__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_Missions_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_OverlayButton_93_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_Quests_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_ReadyRoom_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__WBP_MenuMaster_WBP_Vendors_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void Cancelled_9C5B98FC45FD2A254479AAA11198C640(class UFWPopupWidget* NewPopUp);
	void Confirmed_9C5B98FC45FD2A254479AAA11198C640(class UFWPopupWidget* NewPopUp);
	void Construct();
	int32 ConvertButtonIndexToWidgetIndex(int32 InIndex);
	void Created_9C5B98FC45FD2A254479AAA11198C640(class UFWPopupWidget* NewPopUp);
	void CreateQuestRewardPopup();
	void Destruct();
	void ExecuteUbergraph_WBP_MenuMaster(int32 EntryPoint);
	void GetCurrentOverlay(class UUserWidget** Overlay);
	void GetSidePanels(TArray<class UWBP_MapSidePanel_C*>* NewParam);
	void Go_to_Map_Select();
	void Go_To_ReadyRoom();
	void Go_To_Vendors();
	void OnCustomPageSelected(int32 Index_0);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnMenuClosed();
	void OnPageSelected();
	void OnRegionMapSelected();
	void OnSquadMenuSelected();
	void OnVendorPageSelected();
	void OnWaterPageSelected();
	void QuestMenuToTopPage(class UWidget* Active_Widget);
	void ResetMenu();
	void SelectedTopButtons(int32 ButtonIndex);
	void SetEntryPoint(class FName MapID, bool bSelected);
	void SetEntryPointTextAndImage(const class FText& Name_0, class UTexture2D* Image, bool bSelected);
	void SetMissionText(const class FText& InName, class UTexture2D* Texture, bool bSelectMap);
	void SetSelectedButton(int32 ButtonIndex);
	void SetWaterVaultUnlocked(bool bUnlocked);
	void ShowOverlayMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MenuMaster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MenuMaster_C")
	}
	static class UWBP_MenuMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuMaster_C>();
	}
};

}

