#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FrameSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWInventory_structs.hpp"


namespace SDK::Params
{

// Function WBP_FrameSelector.WBP_FrameSelector_C.ExecuteUbergraph_WBP_FrameSelector
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_FrameSelector_C_ExecuteUbergraph_WBP_FrameSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWFrameSelectionData                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x00C8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ConstParm, ReferenceParm)
};

// Function WBP_FrameSelector.WBP_FrameSelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FrameSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

