#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputActionKey_Shoulder

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InputActionKey_Shoulder.WBP_InputActionKey_Shoulder_C.ExecuteUbergraph_WBP_InputActionKey_Shoulder
// 0x001C (0x001C - 0x0000)
struct WBP_InputActionKey_Shoulder_C_ExecuteUbergraph_WBP_InputActionKey_Shoulder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bUsingGamepad;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_InputActionKey_Shoulder.WBP_InputActionKey_Shoulder_C.OnInputMethodChangedEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputActionKey_Shoulder_C_OnInputMethodChangedEvent final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_InputActionKey_Shoulder.WBP_InputActionKey_Shoulder_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputActionKey_Shoulder_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

