#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ToastMessage.WBP_ToastMessage_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_ToastMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeToast;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ToastMessage;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ToastOverlay;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           ToastQueue;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_ToastMessage(int32 EntryPoint);
	void On_Toast_Message(const struct FGameplayTag& IntentTag, class APlayerController* PlayerController, const class FText& Message);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ToastMessage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ToastMessage_C")
	}
	static class UWBP_ToastMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ToastMessage_C>();
	}
};

}

