#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DonateWaterButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DonateWaterButton.WBP_DonateWaterButton_C.ExecuteUbergraph_WBP_DonateWaterButton
// 0x0004 (0x0004 - 0x0000)
struct WBP_DonateWaterButton_C_ExecuteUbergraph_WBP_DonateWaterButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DonateWaterButton.WBP_DonateWaterButton_C.UpdateWaterCount
// 0x0020 (0x0020 - 0x0000)
struct WBP_DonateWaterButton_C_UpdateWaterCount final
{
public:
	int32                                         NewPlayerWaterCount;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

