#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TwoTitleButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TwoTitleButton.WBP_TwoTitleButton_C
// 0x0668 (0x0A30 - 0x03C8)
class UWBP_TwoTitleButton_C : public UFWCommonActionUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrefixTextBlock;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Subtitle_text;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_Text;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   SubtitleText;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   TitleText;                                         // 0x0418(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   PrefixText;                                        // 0x0428(0x0010)(Edit, BlueprintVisible)
	struct FSlateColor                            NormalTitleColorAndOpacity;                        // 0x0438(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BorderBrush;                                       // 0x0450(0x00D0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           ButtonStyle;                                       // 0x0520(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnDoubleCliecked;                                  // 0x0910(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0920(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateColor                            HoveredTitleColorAndOpacity;                       // 0x0930(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_944[0x4];                                      // 0x0944(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0948(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateFontInfo                         TitleFont;                                         // 0x0958(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            NormalSubtitleColorAndOpacity;                     // 0x09B8(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_9CC[0x4];                                      // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         SubtitleFont;                                      // 0x09D0(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SingleButton_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SingleButton_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SingleButton_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_TwoTitleButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSubtitleText(const class FText& NewTitleText);
	void SetTitleText(const class FText& NewTitleText);
	void SetupStyle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TwoTitleButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TwoTitleButton_C")
	}
	static class UWBP_TwoTitleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TwoTitleButton_C>();
	}
};

}

