#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestProgress.WBP_QuestProgress_C
// 0x0070 (0x03A0 - 0x0330)
class UWBP_QuestProgress_C final : public UFWQuestProgressWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWQuest*                               My_Quest;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestData_C*                       My_Quest_Data_Widget;                              // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Retry_Attempts;                                    // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UFWQuest>>        Hide_Progress___quests;                            // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Initial_Setup_Complete;                            // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Current_Count_Text;                                // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Current_Progress_Text;                             // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Task_Name_Text;                                    // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBPC_HUDFade_C*                         Local_HUD_Fade;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Change_progress_visibility(bool Visible_);
	void Construct();
	void Continue_to_watch_for_updates();
	void Eval_Progress_for_HUD_fade();
	void ExecuteUbergraph_WBP_QuestProgress(int32 EntryPoint);
	void Inform_HUD_Fade();
	void PreConstruct(bool IsDesignTime);
	void Retry_Get_Quest();
	void Set_tracked_text();
	void Watch_for_updates();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_QuestProgress_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_QuestProgress_C")
	}
	static class UWBP_QuestProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestProgress_C>();
	}
};

}

