#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerStatusWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWMainMenu_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerStatusWidget.WBP_PlayerStatusWidget_C
// 0x0068 (0x03C8 - 0x0360)
class UWBP_PlayerStatusWidget_C final : public UFWPlayerStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DonateWaterButton_C*               DonateWater;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DroneCount;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FastTravelDrone;                                   // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         FastTravelDrones;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_199;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    ModifyLoadoutButton;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NotReady_Text;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Ready_Text;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    SaveLoadoutDetails;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WaterValue;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkinSelection_C*                   WBP_SkinSelection;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WaterTransaction_C*                  WaterDonationTransaction;                          // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlayerStatusWidget_WBP_DonateWaterButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_PlayerStatusWidget_WBP_SkinSelectButton_K2Node_ComponentBoundEvent_0_SelectSkin__DelegateSignature();
	void BndEvt__WBP_PlayerStatusWidget_WBP_SkinSelection_K2Node_ComponentBoundEvent_2_UpdateSkin__DelegateSignature();
	void BndEvt__WBP_PlayerStatusWidget_WBP_SkinSelection_K2Node_ComponentBoundEvent_3_CancelSelection__DelegateSignature();
	void Construct();
	void DonationClosed();
	void ExecuteUbergraph_WBP_PlayerStatusWidget(int32 EntryPoint);
	class UWidget* Get_FastTravelDrone_ToolTipWidget();
	class UWidget* GetToolTipWidget();
	void On_Is_Countring_Down_Changed(bool bNewIsCountingDown);
	void OnPSChanged_Event(const class AFWHubWorldPlayerState* OldPlayerState, const class AFWHubWorldPlayerState* NewPlayerState);
	void PreConstruct(bool IsDesignTime);
	void UpdateDroneCount();
	void WaterAmountChanged(const class AFWHubWorldPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerStatusWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerStatusWidget_C")
	}
	static class UWBP_PlayerStatusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerStatusWidget_C>();
	}
};

}

