#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RADAR_LockPuzzle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RADAR_LockPuzzle.WBP_RADAR_LockPuzzle_C
// 0x0050 (0x0430 - 0x03E0)
class UWBP_RADAR_LockPuzzle_C final : public UFWLockPuzzle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWCharacterHealthViewModel*            FWCharacterHealthViewModel;                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 bgdark;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 chev;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 chev_1;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RadarID01;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RadarID02;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border_2;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerState*                           MyPlayerState;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RADAR_LockPuzzle(int32 EntryPoint);
	void Identify_Radar(const class FText& Radar_Text);
	void OnInitialized();
	void OnIsAliveChanged(bool IsAlive);
	void OnPuzzleIncorrect();
	void OnPuzzleSolved();
	void OnViewModelCreated(class UMVVMViewModelBase* NewViewModel, const class FName ViewModelContext);
	void SetFWCharacterHealthViewModel(class UFWCharacterHealthViewModel* ViewModel);
	void SetupHealthViewmodel(class UMVVMViewModelBase* ViewModel);
	void SetupViewModel();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_RADAR_LockPuzzle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_RADAR_LockPuzzle_C")
	}
	static class UWBP_RADAR_LockPuzzle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RADAR_LockPuzzle_C>();
	}
};

}

