#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputActionKey_NoBg

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ForeverWinter_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputActionKey_NoBg.WBP_InputActionKey_NoBg_C
// 0x0098 (0x0460 - 0x03C8)
class UWBP_InputActionKey_NoBg_C final : public UFWCommonActionUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               PrimaryWeaponHotkey;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x03D8(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            TextColorAndOpacity;                               // 0x0438(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bUsingGamepad)> OnInputChanged;                               // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_InputActionKey_NoBg(int32 EntryPoint);
	void OnInitialized();
	void OnInputMethodChangedEvent(bool bUsingGamepad);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InputActionKey_NoBg_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InputActionKey_NoBg_C")
	}
	static class UWBP_InputActionKey_NoBg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputActionKey_NoBg_C>();
	}
};

}

