#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BranchingDialogueBase

#include "Basic.hpp"

#include "WBP_BaseDialogue_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BranchingDialogueBase.WBP_BranchingDialogueBase_C
// 0x01B8 (0x05D8 - 0x0420)
class UWBP_BranchingDialogueBase_C : public UWBP_BaseDialogue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_BranchingDialogueBase_C;        // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           SelectionResult;                                   // 0x0428(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          FinalDialogue;                                     // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FGameplayTag>              LoyaltyToStartingText;                             // 0x0438(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FDialogueSection> TagToDialogueSection;                         // 0x0488(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDialogueSection                       CurrentSection;                                    // 0x04D8(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HideNext;                                          // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Loyalty;                                           // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                TempWidget;                                        // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFWBarManager*                          Manager_Component;                                 // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Offering_Text;                                     // 0x05C8(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__WBP_TestDialogue_WBP_SingleButton_Close_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TestDialogue_WBP_SingleButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void DialogueSelected(int32 OptionIndex);
	void EndSection(bool* Handled);
	void ExecuteUbergraph_WBP_BranchingDialogueBase(int32 EntryPoint);
	ESlateVisibility GetVisibility_CloseButton();
	ESlateVisibility GetVisibility_NextButton();
	void Initialize(int32 PatronLoyalty, bool Visited, class UFWBarManager* ManagerComponent);
	void ItemDonated(const struct FGameplayTag& ItemTag);
	void RemoveOptions();
	void StartNextSection();
	void StartRelevantSection();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BranchingDialogueBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BranchingDialogueBase_C")
	}
	static class UWBP_BranchingDialogueBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BranchingDialogueBase_C>();
	}
};

}

