#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BottomButtons

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BottomButtons.WBP_BottomButtons_C
// 0x0940 (0x0C20 - 0x02E0)
class UWBP_BottomButtons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TwoTitleButton_C*                  Btn_Back;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TwoTitleButton_C*                  Btn_Confirm;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnConfirmClicked;                                  // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCancelClicked;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ConfirmTitleText;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BackTitleText;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x0340(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0730(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            CancelTextColorAndOpacity;                         // 0x0B20(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_B34[0xC];                                      // 0x0B34(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CancelBorderBrush;                                 // 0x0B40(0x00D0)(Edit, BlueprintVisible, ExposeOnSpawn)
	ESlateVisibility                              ConfirmVisibility;                                 // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_BottomButtons_Btn_Back_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WBP_BottomButtons_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_BottomButtons(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BottomButtons_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BottomButtons_C")
	}
	static class UWBP_BottomButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BottomButtons_C>();
	}
};

}

