#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InvitePlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FWMainMenu_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InvitePlayer.WBP_InvitePlayer_C
// 0x0048 (0x0358 - 0x0310)
class UWBP_InvitePlayer_C final : public UFWInvitePlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundVHS;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border_1;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterial>               TV_Screen_Material;                                // 0x0330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_InvitePlayer_InvitePlayerButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Completed_71999FBD477DE5F20AA70CA1A1A0AE2E(const struct FOnlineResultInformation& Result);
	void ExecuteUbergraph_WBP_InvitePlayer(int32 EntryPoint);
	void OnInitialized();
	void OnLoaded_394F66D34FB213C6B115C5AFE91AACFB(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InvitePlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InvitePlayer_C")
	}
	static class UWBP_InvitePlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InvitePlayer_C>();
	}
};

}

