#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestMenu

#include "Basic.hpp"

#include "FWQuestSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "ForeverWinter_structs.hpp"
#include "STRUCT_UnlockMaps_structs.hpp"
#include "FWMainMenu_classes.hpp"
#include "Enum_NavigationAction_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestMenu.WBP_QuestMenu_C
// 0x02F0 (0x05D0 - 0x02E0)
class UWBP_QuestMenu_C final : public UFWQuestMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TwoTitleBlackButton_C*             BackButton;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuSingleTitleButton_2_C*         Button_AbandonQuest;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuSingleTitleButton_1_C*         Button_AcceptQuest;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuSingleTitleButton_8_C*         Button_TurnInQuest;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    Location;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    QuestGiverName;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QuestSidePanel_C*                  QuestInfoPanel;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QuestPanel_C*                      QuestVendorPanel;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFWScrollBox*                           SB_QuestGivers;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFWScrollBox*                           SB_Quests;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SidePanelSwitcher;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_QuestTag;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextPanel_C*                       TextPanel_Filters;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleTextBlock;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ValidationSwitcher;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_ActiveQuests;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_QuestGivers;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_QuestSelections;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    VendorAvailable;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    VendorAvailable_1;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    VendorFaction;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       VendorSearch;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       VendorSearch_1;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       VendorSearch_2;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    VendorType;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SingleButton_C*                    VendorType_1;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Quests;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Vendors;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_C*                        WBP_VendorFilterFaction_1;                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_C*                        WBP_VendorFilterFaction_2;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_C*                        WBP_VendorFilterType_1;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_C*                        WBP_VendorFilterType_2;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Filters;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Quests;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherQuestButton;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedActiveQuestID;                             // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedQuestID;                                   // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   QuestName;                                         // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Quest_Description;                                 // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SelectedQuestName;                                 // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_QuestGiverButton_C*>        QuestGivers;                                       // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_QuestButton_C*>             QuestSelectionButtons;                             // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_ActiveQuestButton_C*>       ActiveQuestButtons;                                // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<int32>                                 AllSelectedQuestIDs;                               // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SelectedActiveQuestIDIndex;                        // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestButton_C*                     SelectedQuestButton;                               // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UFWQuest*>                       AllQuests;                                         // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_QuestGiverButton_C*                TempSelectedQuestGiverButton;                      // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_QuestButton_C*                     TempSelectedQuestButton;                           // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFWQuest*                               SelectedQuestData;                                 // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              QuestData;                                         // 0x04B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              DefaultQuestImage;                                 // 0x04D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	EQuestGiver                                   SelectedQuestGiver;                                // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_QuestGiverButton_C*                SelectedQuestGiverButton;                          // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MenuMaster_C*                      Master_Menu;                                       // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_This_Quest_Giver;                             // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxQuestOptions;                                   // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Selected_Quest_Row_Names_Scavs;                    // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Selected_Quest_Row_Names_Europa;                   // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Selected_Quest_Row_Names_Eurasia;                  // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Selected_Quest_Row_Names_Euruska;                  // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsQuestHovered;                                   // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasEverSelected;                                  // 0x0561(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_562[0x6];                                      // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFWScrollBox*                           CurrentScrollBox;                                  // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Selected_Quest_Row_Names_Bunco;                    // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FSTRUCT_UnlockMaps> RequiredMap_To_UnlockedMaps;                      // 0x0580(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AbandonQuest();
	void AcceptNewQuest();
	void AcceptQuest();
	void AddQuestDataToMapSidePanel(class UFWQuest* QuestData_0);
	void AddQuestDataToSidePanels(int32 QuestID, class UFWQuest* QuestData_0);
	void BndEvt__WBP_QuestMenu_BackButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__WBP_QuestMenu_WBP_MenuSingleTitleButton_2_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_QuestMenu_WBP_MenuSingleTitleButton_83_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_QuestMenu_WBP_MenuSingleTitleButton_8_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_QuestMenu_WBP_VendorFilterType_1_K2Node_ComponentBoundEvent_8_OptionSelected__DelegateSignature(int32 Option);
	void Call_On_TabChanged(class UWidget* TabReference);
	void Cancelled_0B301F424B2F32779462AE975E627035(class UFWPopupWidget* NewPopUp);
	void Cancelled_D4C1B99F479FEB253BE02CABEDA82445(class UFWPopupWidget* NewPopUp);
	void Check_Tunnel_Index(class UDataTable* Tunnel_Data_Table, TArray<class FName>& Rows, bool* Is_Unlocked_);
	void ClearSelectedQuest();
	void Confirmed_0B301F424B2F32779462AE975E627035(class UFWPopupWidget* NewPopUp);
	void Confirmed_D4C1B99F479FEB253BE02CABEDA82445(class UFWPopupWidget* NewPopUp);
	void Construct();
	class UWBP_ActiveQuestButton_C* Create_Active_Quest_Button(int32 QuestID, class UFWQuest* QuestData_0, bool Repeatable);
	void Created_0B301F424B2F32779462AE975E627035(class UFWPopupWidget* NewPopUp);
	void Created_D4C1B99F479FEB253BE02CABEDA82445(class UFWPopupWidget* NewPopUp);
	void CreateQuestWarning(class FName RowName);
	void DelayedUnhover();
	void DialogueFinished(class UObject* Param);
	void EvalQuestsToShowQuestGiver(const struct FQuestData& Quest, bool* Show);
	void ExecuteUbergraph_WBP_QuestMenu(int32 EntryPoint);
	void ExitMenu();
	void FilterActiveQuests(EQuestCategory QuestCategory);
	void FilterQuests(EQuestCategory QuestCategory);
	void Find_Persistence_Quests(EQuestGiver Quest_Giver, TArray<int32>* Persistence_Quest_Quest_IDs);
	void FocusMainMenu();
	class UWidget* Get_ContentToFit(int32* ChildIndex);
	class FName Get_FocusedName();
	TArray<class UWidget*> Get_Navigables();
	struct FStruct_NavigationKeyAction Get_NavigationInfo();
	TArray<class UWidget*> Get_TabButtons();
	class UWB_TabMenuConstructor_C* Get_TabConstructorReference();
	struct FQuestData GetQuestData(class FName InputPin);
	void GetQuestImage(class UFWQuest* Quest, TSoftObjectPtr<class UTexture2D>* Image);
	void HoverActiveQuest(class UWBP_ActiveQuestButton_C* QuestButton, class FName RowName);
	void HoveringActiveQuest(class UWBP_ActiveQuestButton_C* QuestButton, class FName RowName);
	void HoveringQuest(class FName RowName, class UWBP_QuestButton_C* QuestButton);
	void HoverQuest(class FName RowName, class UWBP_QuestButton_C* QuestButton);
	void Is_Level_Unlocked_Or_Near_Unlocked_(class UFWQuest* Quest, bool* _Is_Unlocked_);
	bool IsBeginPlayScreenEnd_();
	bool IsFocusable_();
	bool IsFocused_();
	bool IsOnVendorPage();
	void On_LoadingScreenEnd();
	void On_Panel_Loaded();
	void On_Panel_Unloaded();
	void On_WidgetConstructed();
	void OnInitialized();
	void OnMessageReceived_75EF2A6A4978A643A3A4FFA3EC5ED378(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel);
	void OnNavigationCalled(Enum_NavigationAction Navigation_0, bool* Success);
	void OpenQuestScreen();
	void OpenVendorScreen();
	void PopulateMapActiveQuestWidget();
	void PopulateQuestItemWidget();
	void Quest_Giver_Button_Clicked(class FName QuestRowName, EQuestGiver QuestGiver, class UWBP_QuestGiverButton_C* QuestGiverButton, const struct FGameplayTag& FactionTag);
	void Quest_giver_Button_Hovered(EQuestGiver QuestGiver, class UWBP_QuestGiverButton_C* QuestGiverButton, const struct FGameplayTag& FactionTag);
	void Ready_5C133E4B4DF56E9FA2FC27981435BB82(class UFWPersistenceSubsystem* Subsystem, const struct FPersistenceResult& Result);
	void Receive_Pressed_Key(const struct FKey& Key, bool* Success);
	void RefreshQuestData();
	void ReloadActiveQuestToSidePanel();
	void ReloadQuestDataToSidePanels();
	void RemoveAllQuestDataFromMapSidePanels();
	void RemoveQuestDataFromSidePanels();
	void Return_to_Index_Zero();
	void ReturnToQuestVendorScreen();
	void SelectedActiveQuest(class UWBP_ActiveQuestButton_C* QuestButton, class FName QuestRowName);
	void SelectFirstQuest();
	void SelectingQuest(class FName RowName, class UWBP_QuestButton_C* QuestButton);
	void SelectingQuestGiver(class UWBP_QuestGiverButton_C* Button, EQuestGiver QuestGiver, bool bHovered);
	void SelectQuest(class FName RowName, class UWBP_QuestButton_C* QuestButton);
	void SelectQuestCategory(EQuestCategory QuestCategory);
	void SelectQuestGiver(EQuestGiver QuestGiver, class UWBP_QuestGiverButton_C* Button);
	void SetQuestHovered(bool bInQuestHovered, class UFWQuest* HoveredQuestData, bool bSetVis);
	void ShouldShowQuest(const struct FQuestData& Quest, bool SkipActiveQuestCheck, bool* Show);
	void SimulateClick();
	void Skip_BeginPlayScreen();
	void Toggle_Focus(bool Focused);
	void Toggle_Widget(bool Hide, double Delay);
	bool TriggerInput(const struct FKeyEvent& Input);
	void UnfilterActiveQuest();
	void UnfilterQuest();
	void UnselectAllQuests();
	void UpdateQuestTagText(class UFWQuest* QuestData_0);
	void UpdateShippingBuild();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_QuestMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_QuestMenu_C")
	}
	static class UWBP_QuestMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestMenu_C>();
	}
};

}

