#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeconflictCustomEquipment

#include "Basic.hpp"

#include "FWInventory_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeconflictCustomEquipment.WBP_DeconflictCustomEquipment_C
// 0x0270 (0x0550 - 0x02E0)
class UWBP_DeconflictCustomEquipment_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PopUpButton_2_C*                   CancelButton;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PopUpButton_1_C*                   ConfirmButton;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_190;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Items;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTitle;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TransactionValue;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueType;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BackgroundPanel_C*                 WBP_BackgroundPanel;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Border_C*                          WBP_Border_1;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ApplyTransaction;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CloseTransaction;                                  // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FDataTableRowHandle>            DeconflictItems;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>            DeconflictWeapons;                                 // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>            DeconflictFrames;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>            DeconflictContainers;                              // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSavedItem>                     DeconflictOptionalItems;                           // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSavedDangly>                   DeconflictOptionalDanglies;                        // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DeconflictPriceMultiplier;                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalValue;                                        // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalCost;                                         // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CurrencyRow;                                       // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          DeconflictingPreview;                              // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerSaveGames_C*                 PlayerSaves;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FDataTableRowHandle> ItemRowToVendor;                                   // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FDataTableRowHandle> WeaponRowToVendor;                                 // 0x0440(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FDataTableRowHandle> ContainerRowToVendor;                              // 0x0490(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FDataTableRowHandle> FrameRowToVendor;                                  // 0x04E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_DeconflictItem_C*>          DeconflictWidgets;                                 // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          ApplyDeconflict;                                   // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             VENDOR_DATA_TABLE;                                 // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_ItemTransaction_CancelButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_ItemTransaction_ConfirmButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void ConsumeDeconflict(const TMap<class FName, struct FDataTableRowHandle>& VendorMap, const struct FDataTableRowHandle& RowHandle, int32 Value);
	void DeconflictContainer(class UWBP_DeconflictItem_C* Container);
	void DeconflictFrame(class UWBP_DeconflictItem_C* Frame);
	void DeconflictItem(class UWBP_DeconflictItem_C* Item);
	void DeconflictWeapon(class UWBP_DeconflictItem_C* Weapon);
	void ExecuteUbergraph_WBP_DeconflictCustomEquipment(int32 EntryPoint);
	void GetPlayerSaves(class UBPC_PlayerSaveGames_C** PlayerSaves_0);
	void GetValue(const struct FDataTableRowHandle& ValueRow, int32 Value, int32* NewValue);
	void GetVendorItems();
	void InitiliseDeconflict(bool DeconflictingPreview_0, TArray<struct FDataTableRowHandle>& DeconflictItems_0, TArray<struct FDataTableRowHandle>& DeconflictWeapons_0, TArray<struct FDataTableRowHandle>& DeconflictFrames_0, TArray<struct FDataTableRowHandle>& DeconflictContainers_0);
	void PreConstruct(bool IsDesignTime);
	void UpdateCost();
	void UpdateStash();
	void VendorHasItems_(class FName Row);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DeconflictCustomEquipment_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DeconflictCustomEquipment_C")
	}
	static class UWBP_DeconflictCustomEquipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeconflictCustomEquipment_C>();
	}
};

}

