#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_HudCompanionStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_HudCompanionStats.Widget_HudCompanionStats_C
// 0x00C8 (0x03A8 - 0x02E0)
class UWidget_HudCompanionStats_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFWCharacterVoiceViewModel*             FWCharacterVoiceViewModel;                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFWCharacterHealthViewModel*            FWCharacterHealthViewModel;                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 BgFrame;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BLANK;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 blankhori;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 blankvert;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           HeatlhBar;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Soundwaves;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NextBuddyIndicatorImg;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrimaryGunImage;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_CharacterImage;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             T_PlayerName;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_Triangle;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFWPlayerState_Default*                 MyPlayerState;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   DeadText;                                          // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0368(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        CurrentHealth;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Widget_HudCompanionStats(int32 EntryPoint);
	void OnExtracted_Event(bool IsTunnelExtract);
	void OnHealthChanged(double InHealth);
	void OnKilled(class UFWHealthComponent* HealthComponent, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void OnMaxHealthChanged(double InMaxHealth);
	void OnPawnSet();
	void OnPawnSet_Event(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnPlayerHealthChanged(class UFWHealthComponent* HealthComponent, float OldHealth, float NewHealth);
	void OnViewModelCreated(class UMVVMViewModelBase* NewViewModel, const class FName ViewModelContext);
	void SetColorByPlayerTag(class FName RowName);
	void SetFWCharacterHealthViewModel(class UFWCharacterHealthViewModel* ViewModel);
	void SetFWCharacterVoiceViewModel(class UFWCharacterVoiceViewModel* ViewModel);
	void SetIsDead(bool bIsDead);
	void SetIsTalking(bool bIsTalking);
	void SetNextBuddyIndicator(bool bOn);
	void SetPlayerData(class AFWPlayerState_Default* PlayerState);
	void SetRecruitData(class FName BuddyTag, class APawn* BuddyPawn);
	void SetupHealth(class APawn* Pawn);
	void SetupHealthViewmodel(class UMVVMViewModelBase* ViewModel);
	void SetupViewModel(class APlayerState* InPlayerState);
	void SetupVoiceViewmodel(class UMVVMViewModelBase* ViewModel);
	void UpdateHealthPercent();
	void UpdatePlayerPawn(class AFWGamePlayerCharacter* PlayerPawn);
	void UpdatePlayerProfile(class AFWGamePlayerCharacter* PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Widget_HudCompanionStats_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Widget_HudCompanionStats_C")
	}
	static class UWidget_HudCompanionStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_HudCompanionStats_C>();
	}
};

}

