#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart

#include "Basic.hpp"

#include "WBP_BaseDialogue_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart.WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C
// 0x0030 (0x0450 - 0x0420)
class UWPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C final : public UWBP_BaseDialogue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C; // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Portrait_Change_Line;                              // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                New_Portrait;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   New_Portrait_Name;                                 // 0x0438(0x0010)(Edit, BlueprintVisible)
	bool                                          Reached_Line_to_Swap_;                             // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart(int32 EntryPoint);
	void Next_Page_Event();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C")
	}
	static class UWPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWPB_DAQuest_Railgun_FrozenSwamp_Kill_Europa_DialogueStart_C>();
	}
};

}

